{"url": "https://www.bbc.com/somali/articles/c74w0wvrenlo", "title": "Yaa ka taqaan ciyaarhannada caanka ah ee ku dhintay shilalka", "text": "Xigashada Sawirka, Getty Images\nDunida kubadda cagta waxaa sannado badan ka dhacay shilal baabuur oo aad u naxdin badan, kuwaas oo galaaftay nolosha dad karti iyo xirfad sare leh.\nWaxaa ugu dambeeyay xiddiggii xulka qaranka Portugal iyo kooxda Liverpool Diogo Jota kaas oo isaga iyo walaalkii ay ku dhinteen shil gaadhi oo ka dhacay dalka Spain maalmo uun ka dib markii uu guursaday.\nDhimashadan, oo inta badan lama filaan ah iyo naxdin leh, waxay raad joogto ah ku reebtaa naadiyada, taageerayaasha iyo qarammada ay ka soo jeedaan.\nQormadan waxaanu idinku soo gudbin doonnaa liiska ciyaartoyda caanka ahaa ee ku naf waayey shilalka gawaadhida iyo diyaaradaha.\nXigashada Sawirka, Getty Images\nWaxaa laga yaabaa in ay ahayd musiibadii cirka ee ugu murugada badnayd ee kubbadda cagta casriga ah markii uu geeriyooday ciyaartoygan ku biiray Cardiff City markii ay burburtay diyaarad yar oo ka soo qaadday Faransiiska.\nEnd of Ugu akhris badan\n28-jirkan ayaa ku safrayay diyaaradda Piper Malibu oo ka soo duushay Nantes, dalka Faransiiska kuna wajahneyd Wales fiidnimadii January 21 2019 ka hor intii aanay ku dhicin kanaal u dhow Guernsey, sidoo kale waxa la dhintay duuliye David Ibbotson oo 59 jir ahaa, kaas oo aan meydkiisa la helin.\nSala waxa uu xilligaasi ku biirayay horyaalka Premier League-ga iyo Cardiff City markaas oo ay £15 milyan kaga soo iibsatay naadiga Faransiiska  ah ee Nantes.\nBaadhitaan ayaa lagu sheegay in Sala uu noolaa shilka ka dib balse uu u dhintay dhaawac culus oo ka soo gaaray madaxa iyo xabadka.\nXigashada Sawirka, Sportsman\nPatrick Mutesa Mafiosango ayaa u ciyaari jiray kooxda Simba iyo xulka qaranka Rwanda.\nCiyaaryahankan caanka ah ayaa 17-kii May 2012 ku geeriyooday shil baabuur oo ka dhacay xaafadda Keko ee magaalada Dar es Salaam, maalmo yar ka dib xilli ciyaareedkii 2011/2012 ee Tansaaniya Mainland Premier League oo ay Simba ku qaadday horyaalka.\nMafisango waxa uu jiray 32 sano, waxaanu hore ugu soo ciyaaray kooxaha Simba, TP Mazembe, APR, Atraco iyo Azam.\nXigashada Sawirka, Cal De Souza\nLaacibkii hore ee Arsenal iyo Sevilla ayaa ku dhintay shil baabuur oo ka dhacay magaalada uu ku dhashay ee Utrera.\nWararku waxa ay sheegayaan in gaadhigiisa oo Mercedes ahaa lagu waday  xawaare dhan 237 km/h (147 mph) ka hor inta aanu xakamaha goosan.\nReyes wuxuu ahaa 35 sano jir wuxuuna la safrayay laba wiil oo ay ilmo adeer yihiin; Mid ka mid ah ayaa isna dhintay.\nWeeraryahankii u soo kacayay Orlando Pirates iyo Bafana, Manyathela, ayaa dhintay isagoo 21 jir ah kaddib markii uu u dhaliyay 48 gool 73 kulan oo uu u saftay Buccaneers.\nManyathela ayaa xilligaasi ka soo laabtay tijaabo uu ku maray Qaarada Yurub wuxuuna gool u dhaliyay kooxda Pirates kadib markii ay guuldarro 2-1 ah kala kulmeen Jomo Cosmos garoonka Rand Stadium. Markaas kaddib ayuu shil ku galay  isaga oo ku sii jeeday magaalada Musina si uu wakhti ula qaato hooyadiis.\nNinkan oo hore ugu guulaystay kabta dahabka ah ee Premier League (PSL) ayaa kooxdiisa  Bucs ku hogaamiyo horyaalka 2002-03, wuxuu ku guda jiray saxiixia kooxda ka dhisan Ukraine ee Dynamo Kiev. Abaalmarinta gooldhaliyaha ugu sarreeya PSL waxaa loogu magac daray Manyathela.\nXigashada Sawirka, Rex Features\nCiyaaryahankii garabka ka ciyaara ee Ingiriiska, ee taariikh sameeyay isagoo ka mid noqday ciyaartoydii ugu horreysay ee madow ah ee matala England ku matala ciyaaraha caalamiga ah, sidoo kale u soo ciyaaray Real Madrid iyo Manchester United, ayaa ku dhintay shil baabuur oo ka dhacay Spain bishii July 1989.\ndhacdadaas naxdinta leh waxa ay soo afjartay xirfaddiisii kubbadda cagta, markaas oo uu jiray  33 sano.", "date": "2025-07-04", "scraped_at": "2025-10-29T17:00:29.447666+00:00", "category": "news", "text_hash": "025742ed28b57152f203fef9e49d8c1e0940831782beed032838e52330d02b01", "minhash_signature": "6406797,4365770,6801673,1169701,28978947,2675576,4091398,7198404,15721158,9137554,2291584,6283743,2545320,6543292,1616394,977854,12193809,10774366,3834573,9114134,15137944,4403576,3653097,4436629,9116320,15491453,1592813,7820038,2708576,15071027,14188148,3433886,51162,4605682,605320,2050924,2247696,5924330,24000897,5250398,19417142,15619661,16697913,10777901,9201761,7157596,8983221,14166840,198995,5250846,8764692,12034897,1962229,524680,8084382,2248595,4939077,317751,1279895,1015903,5154637,4784320,25461242,5117425,8707467,3370865,1381523,12916780,957153,12017280,3787230,14765327,14953688,10267783,7110206,11738968,1092093,3280612,9713682,28187118,2222026,3895101,9037624,1889236,1752510,17887981,10806601,10448706,5625106,31963269,2979860,9642966,2476201,36172388,2447814,7433743,918458,13795045,1492760,11329439,4410278,3203099,10575912,3443507,10090118,6528987,17366327,7871036,9634205,8199985,8926643,30852873,2774395,4246786,2589000,1088361,693888,11210349,5099442,1198763,3940372,30475267,11888193,2816039,3262491,948753,3270217,5118945"}
{"url": "https://www.bbc.com/somali/articles/cyepwnxk64lo", "title": "Afar dal oo Yurub ah oo oggol baasaboor Soomaaliga", "text": "Cabdishakuur Casoowe\nXigashada Sawirka, Getty Images\nBaasaboorka Soomaaliya ayaa dhowrkii sano ee lasoo dhaafay u muuqday mid soo xoogaystay marka loo eego sida uu ahaa wixii ka dambeeyay burburkii dowladdii dhexe ee 1991-kii.\nInkastoo uu meel hoose uga jiro liiska kala sarraynta baasaboorrada, haddana waxaa muuqata in uu sanadkan ka horreeyo waddamo kale oo waawayn, oo ay ku jiraan Pakistan, Ciraaq, Suuriya iyo Afghanistan, sida lagu sheegay xogta ay shaacisay hay'adda Passport Index ee qiimaysa sharciyada socdaalka caalamka.\nHorumarka uu sameeyay baasaboorka Soomaaliya waxaa ka mid ah in waddamada Yurub qaarkood ay si rasmi ah u aqoonsadeen muddo dheer kaddib.\nD﻿adka heysta baasaboorka Soomaaliga ayaa marka ay dalbadaan dal-ku-galka Talyaaniga waxaa baasaboorkooda si caadi ah loo saaraa fiisaha.\nEnd of Ugu akhris badan\nDalal badan oo kale ayaa qofka Soomaaliga ah aan baasaboorkiisa ku dhajinin fiisada, iyagoo warqadda caddeynta fiisaha si gaar ah u siiya. Dowladaha sidaas sameeya waxaa ka mid ah UK, inta badan dalalka Yurub, Canada, Australia iyo Mareykanka.\nW﻿axaa xusid mudan in Talyaaniga uu ka mid yahay gumeysteyaashii Soomaaliya, sidoo kalena yahay dalkii ugu horreeyay ee aqoonsaday dowladnimada Soomaaliya.\nTan iyo bartamihii sanadkii 2018-kii, dalka Norway ayaa aqoonsan baasaboorka ay dowladda Soomaaliya siiso muwaadiniinteeda.\nDadaal dheer kaddib ayay safaaradda Norway ku dhawaaqday xilligaas in ay aqbashay jiritaanka baasaboorkan, sidaas awgeedna ay dadka wata u saari doonto dal-ku-galkeeda (Visa), haddii ay shuruudaha kasoo baxaan.\n\"Wada-shaqayn dhow oo ay yeesheen mas'uuliyiinta socdaalka ee Norway iyo Soomaaliya awgeed, Norway waxay aqoonsan doontaa Baasaboorka Soomaaliya laga billaabo 1-da bisha August 2018. Waxaa ku jira baasaboorka diblomaasiga iyo kan shaqaalaha dowladda iyo baasaboorka muwaadiniinta caadiga ah ee ay soo saarto waaxda socdaalka Soomaaliya,\" ayaa lagu yiri qoraal markaas ay safaaradda Norway ee Soomaaliya soo dhigtay boggeeda Twitter-ka.\nMacluumaadkan waxaa daabacay X.  Waxaan dalbanayenaa fasaxaaga ka hor inta aan la furin, waxaa laga yaabaa inay isticmaalayaan cookies iyo farsamooyin kale. hadii aad u bahato akhri X xeerarka cokie iyo kan ku saabsan xogta gaarka ah ka hor inta aadan aqbalin. si aad u aragto xogta guji ‘aqbal oo soco’.\nDhammaadka X boggan\nMacluumaadkan lama heli karo\nWaddamada kale ee Yurub, UK iyo dalal badan oo kale waxay baasaboorka Soomaaliya dadka wata u aqoonsan yihiin qaxooti, haddii ay dal-ku-gal u oggolaadaanna kuma dhajiyaan baasaboorka.\nTaas baddalkeeda waxay soo raaciyaan warqad caddaynaysa in fiisaha la siiyay qofka, macluumaadkiisana ay ku xusan yihiin.\nHase yeeshee, dowladda Sweden ayaa si gaar ah u qaddarisa baasaboorka Soomaaliga ah ee noociisu uu yahay diblomaasiga.\nXigashada Sawirka, Getty Images\nTan iyo bishii Jannaayo ee sanadkii 2020-kii, Sweden waxa ay aqoonsanayd baasaboorka diblomaasiga ee Soomaaliya, gaar ahaan kan la soo saaray 2014-kii ama wixii ka dambeeyay.\nBalse, dhammaan noocyada kale ee baasaboorka Soomaaliga ma aqoonsana Sweden, sida lagu sheegay bogga internet-ka ee safaaradda Sweden.\nWaddamada Yurub ee aqoonsan baasaboorka Soomaaliya waxaa kale oo ka mid ah Belgium.\nHoraantii sanadkii 2019 ayey dowladda Belgium, oo ah waddan ka tirsam Midowga Yurub ku dhawaaqday in ay aqoonsan tahay labada baasaboor ee Soomaaliga ah ee kala ah service-ka iyo diplomatic-ga.\nBayaan 1-dii bishii Aprile e sanadkaas lasoo dhigay bogga Twitter-ka ee safaaradda ay Belgium ku leedahay Nairobi ayaa lagu xaqiijiyay aqoonsiga noocyada baasaboorka Soomaaliya.\nDhowr waddan oo ku yaalla Koonfurta Qaaradda Ameerika ayaa baasaboorka Soomaaliya lagu aadi karaa iyadoo aan wax dal-ku-gal ama fiiso ah loo qaadanin.\nDalalkaas ayaa kala ah:\nWaxaa jira waddamo kale oo sidaas si la mid ah soo dhaweeya muwaadiniinta Soomaaliya.\nXigashada Sawirka, Getty Images\nWaddamadan qofka u socda waxa kaliya ee looga baahan yahay waa inuu tikit goosto, toosna ugu dhoofo. Sidaas awgeed, marka uu ka dago ayaa la siinayaa aqoonsi muujinaya joogitaankiisa.\nWaxaa ka mid ah:", "date": "2022-08-01", "scraped_at": "2025-10-29T17:01:28.252131+00:00", "category": "news", "text_hash": "b024511b407205b035fa3eedfc4044434f60038d56b7992115980f15701dc953", "minhash_signature": "8722549,470243,21414,5704648,1663105,15875600,3570223,7843798,23285041,15972761,3392584,504298,8880680,14252843,4037318,42294639,11816118,1824084,3779146,4569130,15168516,12707123,12249710,4436629,683878,15296947,6513653,19932985,28048798,1458185,72532,7201218,15685583,14910325,18100553,7144653,11778615,3395169,7568288,2753696,7257737,4139673,5533976,21456650,1047629,1205454,18430904,8876288,356453,7513789,14533397,8964175,22807905,4254907,12302185,25742195,3389774,10966480,6452276,3385452,1736984,3744806,26519550,2625943,367417,1643023,5507204,7125131,8981281,4524645,16599127,2592073,2767371,1984311,3452536,2744291,11709215,3571159,19042229,9278459,20709,7634282,8828317,2482137,9926135,610207,560018,3309294,2627819,2490756,6843178,5424284,388672,11655603,3096599,3151873,133531,8183901,1227304,8893143,20811783,6303826,2784535,6925822,4891968,6128187,6060472,5518395,1945178,2010569,1009201,2841459,9218958,2483454,12581921,1972613,12211196,10800052,580268,713392,1353405,19399871,11262047,3754056,350320,22943600,708039,887214"}
{"url": "https://www.bbc.com/somali/articles/cvgnzed386ko", "title": "Saynisyahanno markii ugu horreysay uur-jiif ka sameeyay hiddo-side laga qaaday maqaarka bini'aadamka", "text": "Xigashada Sawirka, OHSU/Christine Torres Hicks\nSaynisyahannada Mareykanka ayaa markii ugu horreysay sameeyay ugxan-bani'aadam marxalado hore ku jira, iyaga oo wax ka beddelay DNA laga soo qaaday unugyada maqaarka bini'aadamka, kaddibna ku bacramiyay shahwo.\nFarsamadan waxay ka caawin kartaa dadka aan uur qaadi karin cudur ama gaboobid darteed, iyada oo suuragal ka dhigaysa in unug kasta oo jirka ka mid ah ay noqon karayso halka laga bilaabo abuurka nolosha.\nHabkan weli wuxuu u baahan yahay horumarin weyn  taasoo qaadan karta illaa toban sano  ka hor inta aan rugaha taranka ayna ka go'aan gaadhin isticmaalkeeda.\nKhubarradu waxay sheegeen in tani ay tahay horumar weyn, balse ay lama huraan tahay in si furan bulshada loola yeesho dood ku saabsan waxa saynisku suurtagal ka dhigay.\nIlmo-dhalista horey waxay u ahayd sheeko fudud: shahwada ninka ayaa la kulanta ugxanta haweeneyda. Labadooda ayaa isu darsama si ay u sameeyaan ugxan-bani'aadam, sagaal bilood kadibna ilmo ayaa dhasha.\nEnd of Ugu akhris badan\nHadda saynisyahannadu waxay beddelayaan xeerarkii. Tijaabadan ugu dambeysay waxay ka bilaabataa maqaarka bini'aadamka.\nHabka ay adeegsadeen kooxda cilmi-baadhista ee Jaamacadda Oregon Health and Science wuxuu ka qaadaa unug maqaarka dhexdiisa, gaar ahaan qaybta unugga loo yaqaan \"nucleas\" taasoo sidata dhammaan koodhka hidde-sideyaasha jirka lagu dhiso.\nNucleas-kaas ayaa lagu dhex ridaa ugxan laga qaaday qof deeq bixiye ah, taasoo laga saaray dhammaan tilmaamaha hidde-sideedkeeda.\nIlaa hadda, farsamadan waxay la mid tahay tii loo adeegsaday samayntii Dolly [Dolly waxay ahayd laxdii ugu horreesay ee lagu sameeyo tijaabo nuqul lagu abuuro xoolo waaweyn, iyadoo la adeegsanayo unug jirka ah oo laga qaaday wan kale oo weyn]  taasoo dhashay sanadkii 1996.\nXigashada Sawirka, OHSU\nSi kastaba ha ahaatee, ugxantan diyaar uma aha in lagu bacrimiyo shahwo, maaddaama ay horay u sidato dhammaan tirada buuxda ee kromosoomyada.\nBani'aadamku wuxuu ka dhaxlaa 23 xirmo oo DNA ah mid kasta oo waalidiintiisa ah, taasoo isu geynaysa 46 kuwaasoo ugxanta horay u sidato.\nMarka xiga, waxa la sameeyaa waa in la qanciyo ugxanta inay iska tuurto kala bar kromosoomyadeeda, iyadoo loo marayo hannaan ay cilmi-baarayaashu ugu yeereen \"mitomeiosis\" eray ka kooban laba hab oo unugyadu u kala qaybsamaan: mitosis iyo meiosis.\nDaraasaddan oo lagu daabacay joornaalka Nature Communications, ayaa muujisay 82 ugxan oo shaqaynaysa. Kuwaas waxaa lagu bacrimiyey shahwada qaarna waxay u gudbeen marxaladaha hore ee koritaanka uurjiifka. Midna lama horumarin wixii ka baxsan marxaladda lixda maalmood ah.\n\"Waxaan gaarnay wax loo maleynayay inaysan macquul ahayn,\" ayuu yidhi Prof Shoukhrat Mitalipov, oo ah maamulaha Jaamacadda Caafimaadka iyo Sayniska ee xarunta daaweynta unugyada uurjiifka iyo hidde-sidaha.\nFarsamadan weli si buuxda looma hagaajin, maadaama ugxantu si aan kala sooc lahayn u doorato kromosoomyada ay iska tuurayso.\nWaxaa muhiim ah in ay dhammaadka haysato hal nuqul oo kasta oo ka mid ah 23-ka nooc ee kromosoomyada si looga hortago cudurro, balse mararka qaar waxay haysataa labo nuqul oo noocyo ah, halka qaarna aysanba haysan.\nSidoo kale, heerka guusha ayaa aad u hooseeya (qiyaastii 9%), kromosoomyaduna waxay seegaan hannaan muhiim ah oo ah inay is-bedbeddelaan (Hido-sideyaashu kala wareegaan), taas oo la yiraahdo crossing over.\nProf. Mitalipov, oo ah khabiir caan ah oo hormuud u ah cilmi-baadhistan, ayaa ii sheegay:\n\"Waa in aan farsamadan hormarinnaa illaa ay ka noqoto mid dhammeystiran.\nUgu dambeyn, waxaan aaminsanahay in mustaqbalku halkaas u socdo, sababtoo ah dadka aan ilmo dhali karin way sii badanayaan.\"\nXigashada Sawirka, OHSU/Christine Torres Hicks\nTiknoolajiyaddan waxay qayb ka tahay meel cilmi-baadhis cusub oo sii fidaysa, taas oo ujeeddadeedu tahay in shahwo iyo ugxan lagu sameeyo bannaanka jirka bini'aadamka, taas oo loo yaqaan in vitro gametogenesis.\nHabkani weli wuxuu ku jiraa heerka cilmi-baadhista sayniska, lama gaarsiin isticmaal caafimaad, balse himiladu waa in lagu caawiyo lammaaneyaasha aan ka faa'iidaysan karin IVF (bacriminta dibedda jirka) sababtoo ah ma haystaan shahwo ama ugxan ay isticmaalaan.\nWaxa uu gacan ka geysan karaa caawinta dumarka waayeelka ah ee aan lahayn ugxan shaqaynaysa, ragga aan soo saarin shahwo ku filan, ama dadka ay daaweynta kansarku u sababtay bacrami la'aan.\nCilmigani sidoo kale wuxuu beddelayaa xeerarkii hore ee waalidnimada. Farsamada maanta laga hadlayo looma baahna in unug maqaarka laga qaado haweeney  waxaa sidoo kale laga qaadi karaa nin.\nProf. Paula Amato, oo ka tirsan Jaamacadda Oregon Health and Science, waxay tiri:\n\"Marka laga soo tago rajo u abuurista malaayiin qof oo aan ilmo dhalin karin sababo la xiriira shahwo ama ugxan la'aan, habkan wuxuu sidoo kale suurtagal ka dhigi karaa in lammaanayaasha isku jinsi ah ay helaan ilmo hiddo ahaan labadooda la xidhiidha.\"\nProf. Roger Sturmey, oo ah bare ka tirsan Jaamacadda Hull kuna takhasusay daawada taranka, wuxuu sheegay in sayniskani yahay \"mid muhiim ah\" isla markaana \"laga gaadhay horumar weyn.\"\nWuxuu intaas ku daray:\n\"Isla mar ahaantaas, cilmi-baadhis noocan ah waxay muujinaysaa muhiimadda ay leedahay in si furan [aad] bulshadu ugala hadasho horumarka cusub ee cilmi-baadhista taranka.\nHorumarka noocan ah wuxuu inoo sheegayaa in loo baahan yahay sharci adag iyo maarayn hufan, si loo hubiyo isla xisaabtanka loona dhiso kalsooni dadweyne.\"\nProf. Richard Anderson, ku xigeenka agaasimaha Xarunta MRC ee caafimaadka taranka ee Jaamacadda Edinburgh, ayaa isna yiri:\n\"Kartida lagu abuurayo ugxan cusub waxay noqon lahayd horumar weyn.\"\nWuxuu intaas ku daray:\n\"Waxaa jiri doona walaacyo badan oo xagga ammaanka ah (safety concerns), laakiin daraasaddan waa tallaabo loo qaaday dhanka caawinta haween badan si ay u helaan carruur hiddo ahaan iyaga la xiriira.\"", "date": "2025-10-01", "scraped_at": "2025-10-29T17:02:28.230273+00:00", "category": "news", "text_hash": "4ba09d2072c91b05f4ef5a31e7bd8e601513c7d431527e224c98c8d1cd56cc0b", "minhash_signature": "673498,1143887,9531831,7884599,8776876,2607901,5062882,3623519,1517767,10209077,8277106,7768248,2918944,13643058,2072890,3185765,9818521,3630222,3779146,5982630,7346500,11058203,1363551,147494,5113,1101544,6056618,1264297,22519055,1070922,6750828,47883,5386332,1513678,8533952,8145340,5555485,1699790,15301069,1186237,8665411,591763,631753,1833494,18916221,14700902,6347595,5330083,6249486,10124534,2385,870315,12974394,201464,4111942,4540522,32448977,5079713,705560,7883939,4295613,1802985,1180767,1526783,10675192,7027693,2257858,797003,2451961,2363592,2599769,8108001,1583419,955039,6601254,627882,1181349,1909876,2316608,10828324,486827,6290931,7313756,7755963,2606860,9257478,2235962,15579511,6601458,869246,1510018,38105,10461704,4619912,692792,3076513,4723736,18017328,1492760,506065,4222108,13967292,2738257,1258535,519690,271114,5352172,5224541,3823240,4558138,1316527,5206810,613375,27457262,22084643,2943192,13161517,1213160,4158217,15379117,700639,7156830,5289675,2130433,791337,1435870,8876819,4079318"}
{"url": "https://www.bbc.com/somali/articles/c4g7zz2zlneo", "title": "Hadii aad sameyso siddeedaan caado 24 sano oo dheeraad ah ayay cimrigaaga ku dari kartaa", "text": "Xigashada Sawirka, Getty Images\nWaa la yaabnaa markaan aragno waayeel gaaray da'da 100 sano, waayo ma aha qof walba oo intaas gaaro. Sababtoo ah qofkasta ma noolaado waqtigaas dheer,  waxaa jira siyaabo badan oo lagu hagaajin karo laguna kordhin karo cimriga.\nDad badan cimri dheerida waxay ku timaadaa hiddo-side, balse daraasado ayaa muujinaya in hab nololeedkeennu uu saameyn ku yeelan karo cimrigeenna. Dhammaanteen waan ognahay hal dariiq oo sahlan oo cimriga lagu dheerayn karo, taasoo ah in la qaato hab nololeed caafimaad leh.\nSu'aashu waxay tahay: Waa maxay hab nololeed caafimaad leh?\nDaraasad dhowaan la sameeyay ayaa tilmaantay siddeed caado oo muhiim ah oo cimriga qofka ku kordhin kartaa ilaa 24 sano. Tani waxay yaraynaysaa khatarta dhimashada xilli hore. Kooxda cilmi-baarayaasha waxay noocan dhimashada ugu yeereen \"geeri hore\"\nSahanka hadda la sameeyay ayaa daboolay 2,76,000 oo qof.\nEnd of Ugu akhris badan\nKuwa soo socdaa waa siddeed siyaabood oo aad ku noolaan karto waqti dheer.\nKuwani  waa siddeeda qaab oo cimriga ku dheerayna\nXigashada Sawirka, Getty Images\nCunto kala duwan oo dheellitiran ayaa muhiim ah. Inta badan dadka waxay ogyihiin in cuntooyinka degdega ah, kuwa sokorta badan leh iyo kuwa cusbada badan ay caafimaadka waxyeello u leeyihiin. Sidoo kale, cuntooyinka si aad ah loo shiilay waa in laga fogaado.\nCuntadu waa inay ka koobnaataa miraha, khudaarta, badarka isku dhan, iyo borotiinka, sababtoo ah waxay ka hortagaan cudurrada daba dheeraada iyo bararka.\nJimicsi maalinle ah\nHelidda jimicsi dhexdhexaad ah maalin kasta waa muhiim si loo helo caafimaad guud oo wanaagsan. Jimicsiga joogtada ah wuxuu hagaajiyaa caafimaadka wuxuuna sidoo kale yareeyaa halista ah in la qaado cudurrada daba dheeraada.\nJimicsigu wuxuu hagaajiyaa tayada hurdada. Waxaa la ogaaday inuu xiriir la leeyahay arrimo badan oo nololeed. Daraasado badan ayaa muujinaya in hurdada u dhexeysa toddobo ilaa sagaal saacadood ay guud ahaan caafimaadka u wanaagsan tahay. Hurdadu waxay ka caawisaa jirka inuu soo kabto waxayna kaa ilaalin kartaa dhibaatooyin kala duwan.\nSi aad hurdada wanaagsan u hesho, khubaradu waxay kugula talinayaan in laga fogaado cabbitaanka khamriga iyo sigaarka, in la cuno quraacda subax kasta, in la cuno khudaar, in la jimicsado, iyo in si joogto ah loo xakameeyo heerka birta ee jirka.\nXigashada Sawirka, Getty Images\nWelwelku ma aha oo kaliya waxyeello maskaxda ah, laakiin sidoo kale wuxuu saameeyaa caafimaadka jireed. Waxa uu keeni karaa dhibaatooyin badan, oo ay ku jiraan cudurka wadnaha.\nXiriirrada dhow ee aan la leenahay qoyska iyo saaxiibada waa kuwo muhiim ah si aan u joogtayno xiriirada. Waxay yareeyaan fursadaha aan ku dareemeyno kelinimo. Xiriirradani sidoo kale waxay naga ilaalinayaan saameynta xun ee welwelka iyo walbahaarka.\nSida ay sheegtay Lydia Danworth oo ah Saxafiyad dhinaca Sayniska ah oo buug ka qortay saaxiibtinimada, waxa ay sheegtay in marka qofku go'doomiyo hab-dhiska difaaca jidhkiisa uu daciifo. Unugyada dhiiga cad ee qofka caynkaas ah waxay beddelaan hawlahooda jireed, taas oo daciifisa hab-dhiska difaaca.\nShanta xeer ee kor ku xusan waa in la raaco si loo helo caafimaad wanaagsan. Saddexda xeer ee soo socda ayaa noo sheegaya waxa aan iska ilaalino si aan u noolaano nolol dheer.\nKa fogaanshaha dhammaan noocyada daroogada, oo ay ku jiraan mida xooggan sida 'opioids,' waa lama huraan caafimaad wanaagsan. Ka fogaanshaha wax kasta oo la qabatimo, gaar ahaan qabatimada daroogada.\nIsticmaalka xad dhaafka ah ee khamriga waxay sababi kartaa cudurro ay ka mid yihiin beerka oo shaqadiisa gaba, dhiig karka iyo kansarka. Isticmaalka khamriga wuxuu keeni karaa beerka cirrhosis joogto ah, cagaarshow darran ama ama beerka oo si kedis ah u shaqadiisa u joojiy. Sidaa darteed, isticmaalka xad dhaafka ah ee khamriga waa in laga fogaado.\nSigaar cabbiddu waxay keeni kartaa cudurro badan. Ka fogaanshaha sigaar cabbista waxay kordhin kartaa cimriga qofka.\nDr. S. Chandrasekhar, madaxa waaxda daawada guud ee Jaamacadda Caafimaadka ee Government Stanley, ayaa sheegay:\n\"Dhakhaatiirtu waxay sheegayaan in haddii qofka uu joojiyo sigaar cabbista ka hor da'da 40, cimrigiisu wuxuu ku kordhi karaa ilaa 10 sano.\"\n\"Waa sidaas, haddii qofku joojiyo sigaar cabbista kadib da'da 40, waxyeellada sigaar cabbistu ku reebtay jirkiisa waxay hoos ugu dhici kartaa ilaa 90%. Si kastaba ha ahaatee, lama hubo in cimrigiisu si buuxda u kordhayo.\"\nDaraasaddu waxay muujisay in dadka la qabsaday qaab-nololeedkan caafimaad qaba ay gaareen cimri dhan 87 sano — taasoo 10 sano ka badan celceliska cimriga dadka Mareykanka.\nDabcan, wax kasta ma damaanad qaadi karaan cimri dheer, balse siddeedaas caado ee kor lagu xusay waxay kaa caawin karaan inaad ku socoto waddada saxda ah ee cimri dheer lagu gaaro.", "date": "2025-10-16", "scraped_at": "2025-10-29T17:03:29.910737+00:00", "category": "news", "text_hash": "a1cc3071cf2bb1ee5cdba73a535165fde81b2d6aea4ad9b27b9c2ace971760aa", "minhash_signature": "415796,13937476,13659921,301905,28036597,5909172,1668739,2046361,17430809,3727746,647562,4526452,3282246,824495,4780491,24048437,7274250,10774366,389230,795831,1189589,10682150,5025998,4436629,2651553,1177624,4496282,5480805,5188676,14399094,3501538,27986184,7248286,904143,5911277,8526966,2042612,2685667,6152238,12709264,7534763,7927437,21169313,1689224,170360,5651233,370404,8876288,4848575,1729594,5893713,5036709,397395,12301952,9859881,4592616,1194453,1696773,24928778,10295832,8374935,7049267,7666081,4875732,1214915,2334096,1628223,6746441,5325776,7175813,2029772,2101689,385463,3197147,80619,1306452,6012273,3493822,894778,1493625,3403499,4738748,2437790,8765309,3742811,6650005,1751296,749698,610401,5312239,4409413,9085164,922338,6372677,442355,660401,396220,994430,8851445,5271572,4260183,6897321,587259,13792776,4967129,129687,573084,4555887,7267565,7773462,19510064,3117693,2793288,3555895,24640037,5505401,398978,6766401,14603972,20462258,5183424,10758580,2314697,11248212,3911181,4344121,10202796,4683316"}
{"url": "https://www.bbc.com/somali/articles/cp8e15m94mgo", "title": "Muhiimad intee le'eg ayey u leedahay Somaliland isku xirka dekedaha Berbera iyo Jebel Cali", "text": "Xigashada Sawirka, Getty Images\nShirkadda dekedaha caalamiga ee Dubai ee magaceeda loo soo gaabiyo DP World ayaa daahfurtay istaraatiijiyad cusub oo ah marinka maraakiibta ee isku xiraya dekedda Jebel Cali ee Imaaraatka Carabta iyo Dekedda Berbera ee Somaliland.\nAdeegga cusub ayaa shaqaynaya sagaal maalin oo kasta, waxaana sida shirkaddu sheegtay uu kor u qaadayaa Isku xirka  caalamiga ee shaqada DP World, waxaana uu xoojinaya booska ay Berbera ka taagan tahay marin biyoodka badeed oo noqonaya albaab iyo xarun loo soo maro Bariga Afrika.\nSomaliland ayaa dhankeeda ku tilmaamtay Khadka dhanka Maraabiibta ee sida tooska isugu xiraya dekedaha Jabal cali iyo Berbera inay tahay talaabo meesha ka saaraysa caqabadihii laga kala kulmi jiray badeecadaha iyo alaabooyinka gaaraya dekedda berbera .\nMaareeyaha dekedaha Somaliland Cali Diiriye Axmed ayaa uga waramay BBC sida uu khadkani ku yimid iyo waxyaabaha uu kusoo kordhinayo Dekedda Berbera oo uu sheegay inay samaynaysay horumar muddooyinkii u dambeeyay.\n''Dekedda Berbera in muddo ahba waxaa ka socday horumar maalinba meel gaarayay oo isa soo tarayay. Khadkan maraakiibta ee cusub ee u kala gooshaya ama isku xiraya dekedda Berbera Jebel Cali, waxa uu qayb ka yahay koriinka ay dekeddu samaynaysay, arrintaasi ayaana sabab u ah shirkadaha faraha badan ee gaadiidka ka shaqeeya badda ay la socdaan horumarka. Waana gaadiid cusub oo inoo soo kordhay oo dekedda aan horay u imaan jirin, si toos ahna uga dhex shaqaynaya labada dekedood.\nEnd of Ugu akhris badan\nQorshaha isku xirka labada dekedood ayaa sida uu maareeyuhu sheegay ay ka wada shaqeeyeen shirkada DP World ''Qorshahani waxa uu ku yimid oo iska kaashaday oo in muddo ahna ka wada shaqaynayay hay'adda maamulka dekeddaha Somaliland iyo shirkada DP World oo inta badan masuuliyadoodu tahay inay si dhow uga wada socdaan fudaydinta ganacsiyada iyo isweydaarsiga dekedda ka dhacaya ee wixii culays ah ee jira meesha looga saari lahaa ama loo fudaydin lahaa ka shaqeeya. Marka daraasado iyo cilmi baaris aan samaynay ayaan ku ogaanay inay daruuri tahay in la yareeyo shixnadaha dekeddeena ku socda oo dekedo badan soo mari jiray'' ayuu yiri.\nXigashada Sawirka, Government of Dubai Media Office\nMaareeyaha dekedaha Somaliland ayaa sheegay in alaabaha laga soo qaado Dubai ay soo mari jireen dhowr dekedood oo ay kamid yihiin Jeddah iyo Jabuuti, muddo dheer dabadeedna ay gaari jireen Berbera. ''Si aan arrintaasi meesha uga saarno waxaanu samaynay in aanu abuurno oo aan aasaasno isku xir toos ah oo inta ay toos uga yimaadaan dekedda Jebel Cali u yimaadaan Berbera''.\nKhadkan tooska ee isku xiraya labada dekedood ayaa leh faa'iido badan sida uu aaminsan yahay maareeye Cali Diiriye.\n''Arrintani faa'iidooyin badan ayay yeelanaysaa runtii, waa marka koowaade alaabihii ama shixnadihii daahi jiray ee dekedaha faraha badan marka ay soo maraan ku dambayn jiray dekeddeena, horta degdeg ayay u imaanayaan oo wakhtigii wuu yaraanayaa, wakhtigii aad buu u soo yaraanayaa, boqolkiiba 60 ayaan wakhtiga yaraynay, waxa kale oo ay inoo kordhinaysaa in dekeddu ay kor u kacdo, waxa kale oo imaanaya in ganacsato kale oo meelo kale mari jiray oo alaabahooda kala soo dagi jiray ay soo noqdaan oo ay dekeddii isticmaalaan, waxa kale oo aynu ka faa'iideynaa in dhaqaalaha dalka iyo wadamada jaarka ee aan dekeddaha lahayn sida Itoobiya oo kale uu kobac fiican ka helo, kana faa'iideystaan fursadaha.\nShirkada DP World ayaa heshiiska maamulka dekedda Berbera ku saxiixday heshiis bishii Maajo 2016, waxaana ay si rasmi ah maamulka dekedda ula wareegtay sannadkii 2017. Heshiiska ayaa dhigayay muddo 30 sano ah oo maamulidda dekedda. Saamiga shirkadda ayaa ahaa 65% ay qaadanayso halka Somaliland ay lahaanayso  35%. Sannadkii 2018 Itoobiya ayaa ku biirtay qayb ka lahaanshaha saamiga Dekedda oo ay heshay 19%, taasi oo ka dhigtay saamiga hadda ee DP World 51 boqolkiiba.\nDaraasad uu sameeyay Bangiga Adduunka sanadkii 2022 ayaa dekedda Berbera ay ka gashay kaalinta 144 xagga maamulka dekedaha caalamka.", "date": "2025-10-17", "scraped_at": "2025-10-29T17:04:28.329305+00:00", "category": "news", "text_hash": "105fa3e328a41205aee35b4075f5774251b9c7ec79d3092a7ca478c378ba84cd", "minhash_signature": "9427475,298232,22010378,3817217,5772667,2042482,1304980,3539336,12261727,921944,9040234,5511786,407343,2344137,50199,6523054,26485586,5027315,9804829,6735730,4150525,4893798,4500555,2763048,26135879,11582237,1871991,1840941,30693538,13337208,6664123,943003,706323,6889537,460526,477651,5140796,6535664,9459607,1142270,1458724,1172851,16043586,245173,8189390,8310551,9218893,10821,3246563,5438786,4151894,3068901,18757490,4484791,696961,18936315,12634778,3326531,23629077,15494552,350326,10647633,15981442,9525020,1372069,8910152,9953014,8414746,5912268,8734571,12862652,2147748,217895,2621949,28054381,23531567,2994126,5935350,6347135,81119,221039,1152336,9127258,1447790,735604,7423067,453480,5956025,3598552,17073727,425330,8570332,10592367,1255589,3131750,7568618,2206680,6582396,5160377,2281373,8465478,6782332,14235054,7643189,15407363,5278327,4146480,12359870,5419083,1713101,5197106,4621555,4178238,17551708,8340864,14722159,8758625,1885911,8406162,578222,32154432,5281629,4430273,1294284,10841711,7160400,14040451,1530156"}
{"url": "https://www.bbc.com/somali/articles/c5yp2gzpe18o", "title": "Markabka uu iska leeyahay ninka Israa'iiliga ah ee ay Iran ka doonayso $170 milyan oo doollar", "text": "Garsoorka Iran ayaa dalbaday in lagu ganaaxo 170 milyan oo doolarka Mareykanka ah mulkiilaha markab xamuul oo horaantii sanadkii hore lagu qabtay gacanka Persian, laguna eedeeyay inuu xiriir la leeyahay Israel.\nCiidamada Ilaalada Kacaanka Islaamiga ah ayaa markabka la wareegay 20 bilood ka hor bishii April 2024 waxayna xireen 25 ka mid ah shaqaalihii markabka, kuwaas oo qaarkood markii dambe la sii daayay.\nSannadkii hore, isla markii uu baahay warka ku saabsan qabashada markabka \"meel u dhow marinka Hormuz\", ayaa la sii daayay muuqaal muujinaya ciidamada Ilaalada Kacaanka Iran oo markabka ku galay diyaarad helikobter ah.\nAsghar Jahangir, oo ah afhayeenka garsoorka Iran ayaa shir jaraa'id oo uu ku qabtay Tehran ku yiri: \"Qaar ka mid ah konteenarada markabkan waxay sideen walxo khatar ah oo waxyeello leh, kuwaas oo ka marka loo eego sharciga Jamhuuriyadda Islaamiga ah ee Iran ee xeebaha Gacanka Faaris iyo Badda Cumaan, lagu helay inay ku xad-gudbeen mabaadi'da marinka ee in ah in si dhib la'aan ah lagu maro, ayna khalkhal geliyeen nabadda, nidaamka, iyo amniga gobolka.\"\nWaxa uu sheegay in dacwad ka dhan ah shirkadda iska leh markabkaasi la gudbiyay taa oo lagu eedeeyay \"maalgelinta argagixisada\", arrintaasina ay ku socoto dib u eegis dhanka garsoorka ah, balse aan weli la cayimin xilliga la qaadi doono dacwadda.\nEnd of Ugu akhris badan\nXigashada Sawirka, NurPhoto via Getty Images\nAsghar Jahangir ayaa sheegay in mulkiilaha markabka uu yahay \"qof saameyn ku leh\" dowladda iyo \"kaaliyaha dhaqaale\" ee ciidamada badda Israel.\nXiliga laqabanayay Mareykanka ayaa falkaasi ku tilmaamay mid \"burcad badeed\" isagoo dalbaday in lasii daayo shaqaalahooda. Wasiirka arrimaha dibadda ee Israa'iil ayaa sidoo kale ugu baaqay Midowga Yurub in ay Ilaalada Kacaanka Iran ku darto \"ururada argagixiso\".\nSida laga soo xigtay afhayeen u hadlay garsoorka dalka Iran, markabkan marka laga reebo shixnaddiisa ayaa qiimihiisu dhan yahay 170 milyan oo doolar, wuxuuna siday 2,760 konteenar.\nMarkabkan oo lagu magacaabo MSC Aris, isla markaana ku socda calanka dalka Portugal ayaa waxaa iska leh shirkadda Zodiac Shipping oo horay dhowr markab looga qabsaday biyaha ku teedsan dalka Iran.\nMarkii la qabtay markabka, Zodiac Shipping wuxuu sheegay inaysan mas'uul ka ahayn markabka, inkastoo uu xiriir la leeyahay MSC. Zodiac wuxuu sheegay inay \"si buuxda mas'uul uga tahay\" xamuulka, shaqaalaha iyo waddada uu qaadayay.", "date": "2025-10-29", "scraped_at": "2025-10-29T17:05:28.305686+00:00", "category": "news", "text_hash": "2d261e2d37169a462041ca7837f4a93c896bed47bfa73870798ace8d1858efca", "minhash_signature": "9725071,28861811,869466,1424291,6233757,28185485,10083739,242800,9223050,27984234,2356614,4541716,1157609,6999013,3657679,8878422,3112923,8851449,1911495,34250594,5493545,6566014,1656378,19375886,10722763,33626687,2434346,7133532,6379703,23061752,3353229,77238,2159805,8331849,13447877,27872246,7534828,26294827,2756982,16449816,574176,4815410,7318106,17289627,19300698,9719639,17824771,7918510,317203,1812456,21381716,11042319,24834128,10340074,3053223,32636580,3721768,4200902,1369409,15263403,2894668,26871567,10336522,22219720,12236258,2121971,12201052,26115652,29449649,21152736,8472318,8103989,2322382,12179361,3544140,2516138,232095,9123031,7857760,183942,4112397,6034375,7333770,8437035,10080701,35335840,13736036,4438562,19203053,16469391,839870,5980459,10052668,32485561,17133277,38883748,5557693,4260166,1492760,1513895,18571252,8348090,8700938,9709956,6999873,4049902,32768633,2347493,13260398,12540298,1496624,3699358,5071935,8422183,3510423,27276025,1867819,22421335,2624900,321196,248808,2870158,16618090,16248207,21214143,4073868,41299414,4059448"}
{"url": "https://www.bbc.com/somali/articles/cgkyer30v88o", "title": "Ninka ugu da'da weyn adduunka 'Ma jirto sir ka dambaysa cimri dhererka'", "text": "Xigashada Sawirka, PA Media\nNinka ugu da’da weyn adduunka ayaa shaaca ka qaaday in aysan jirin “siro gaar ah” oo uu ku soo gaaray cimrigaan xilli uu u dabaaldegayay 112-sano jirkiisa.\nJohn Tinniswood, oo ku dhashay magaalada Liverpool taariikhda marka ay ahayd 26 Agoosto 1912, ayaa u sheegay Guinness World Records in uusan \"wax fikrad ah ka haysan gabi ahaanba\" sababta uu u noolaa muddada intaa la eg.\nNinka ugu cimriga dheer ayaa taageera kooxda kubadda cagta ee Liverpool, waxa uuna ku nool yahay guri dadka lagu daryeelo oo ku yaal Southport.\nNinkaan ayaa noqday qofka ugu da’da weyn adduunka bishii Abriil kadib markii uu geeriyooday Juan Vicente Pérez Mora oo 114 jir ahaa.\nWaxa uu sheegay in uu ahaa nin aad u firfircoon markii uu yaraana uu sameeyn jiray “socod badan”, laakiin waxa uu rumaysnaa in dadka kale uusan “waxba ka duwanayn”, waxa uu intaa ku daray: “Waad noolaan kartaa waqti dheer ama waqti gaaban laakiin waxba kama badali kartid wax kasta oo ku saabsan.\"\nEnd of Ugu akhris badan\nMr Tinniswood, oo dhashay sanadkii uu dagay (quusay) markabkii Titanic, ayaa sheegay uu dib u xasuusanayo noloshiisii hore.\n\"Sababta aan u noolahay muddadaas dheer, wax fikrad ah kama haysto, \" ayuu yiri. \"Ma jirto wax gaar ah oo aan sameeyay ayuu sii raaciyay.\n\"Aad ayaan u firfircoonaa yaraanteydii, socod badan ayaan sameyn jiray. mana garan karo in taasi ku lug leedahay\" ayuu yiri.\n\"Laakiin aniga, ma jirto wax aa dadka uga duwanaa, wax gaar ah ma jirin.\"\nMr Tinniswood waxa uu dhashay 20 sano ka dib markii la aasaasay kooxdii uu ugu jeclaa kubadda cagta ee Liverpool, waxa uuna taageerayay tan iyo inta ay qaadayeen koobabka marka laga reebo laba xilli cayaareed oo ka horeysay dhalashadiisa, waana mar ay ku guuleysteen qaadista laba horyaal oo kala ahaa sanadihii1901 iyo 1906.\nXigashada Sawirka, Family photo\nMarkii uu qarxay dagaalkii koowaad ee adduunka waxa uu jiray laba sano, sidoo kale xilligii uu u dabaal dagayay 27-sano jirkiisa ayuu bilaabmay dagaalkii labaad ee adduunka.\nWaxa uu ka soo shaqeeyay ciidamada gaar ahaan waxa uu door weyn ka qaatay mushaaraadka ciidanka, isku dubaridka iyo saadka, balse waa uu ka badbaaday dagaalkii labaad ee adduunka.\nXaaskiisa ayuu ka bartay goob ku taala magaalada Liverpool, oo lagu cayaaro qoob ka cayaarka, waxa ayna is guursadeen 1942.\nGabadhooda Susan waxa ay dhalatay sanadkii 1943, lamaanaha ayaana ku faraxsanaa noloshooda ka hor inta aysan dhiman xaaska ninkaan 112 jirka ah sanadkii 1986.\nDagaalkii labaad ee adduunka ka dib, waxa uu xisaabiye u ahaa Shell iyo BP ka hor intii aanu ka fadhiisan 1972.\nWaxa uu sheegay in uu cuni jiray kalluunka iyo baradhada oo uu cuni jiray Jimce kasta balse uusan laheyn wax nidaam ah oo u gaar ah.\nXigashada Sawirka, PA Media\n\"Waan cunaa wax kasta oo la ii keeno, waxaana lamid ahay dadka kale, mana jirto wax ii gaar ah\" ayuu yiri.\nTan iyo markii uu gaaray da’da 100-jirka, sanad kasta dhalashadiisa waxa uu kaarka dhalashada ka heli jiray boqortooyada, waxaana kaarkii ugu horeeyay siiyay boqoradda Queen Elizabeth II.\nMar wax laga weydiiyay waxa uu u maleynayo in dunida ay wax badan iska beddeshay tan iyo carruurnimadiisii, waxa uu sheegay in aysan jirin kala duwanaasho ra’yigiisa ah, ama in wax badan ay iska badashay, waxa uu raaciyay in hadda dunidu ka adag tahay tii hore, ama ay adag tahay inay ka fiicnaato sidii ay ahayd waagaas.\n\"Malaha meelaha qaar waa ay jirtaa, laakiin meelaha kale way ka sii daran tahay,\" ayuu raaciyay.\nNinka ugu da'da weyn ayaa ahaa Jiroemon Kimura oo u dhashay Japan, kaas oo gaaray da'da 116-sano iyo 54 maalmood, waxa uuna dhintay sanadkii 2013.\nHaweeneyda adduunka ugu da’da weyn, waa Tomiko Itooka oo 116 jir ah oo u dhalatay Japan.", "date": "2024-08-26", "scraped_at": "2025-10-29T17:06:29.725999+00:00", "category": "news", "text_hash": "e2bc0070cc5ed80144262eb6444edc02cfc2263c0eed7f82e201f121929f5b2f", "minhash_signature": "20308354,554631,7101421,9955399,1910112,3378140,1294051,25549822,18556113,12059481,3688786,4526452,12390857,17871914,9929052,8878422,2245732,10774366,11705254,7529534,2410935,5992851,51635377,6859998,7643015,7196594,2369043,9670079,3504249,3352076,98639,558384,3046794,1550469,4929674,3805810,16607695,1683887,503779,8391521,27988226,6765098,2340481,3931041,10027915,3696570,5873194,7550635,4496981,9603603,1912406,23775489,5900591,561399,16807929,57663,5197414,7688278,10574916,3895914,23191835,2658378,8217252,5086795,14109085,12146411,7651487,1159877,5928028,9756635,9129124,6599956,1160466,4676195,9483879,1464297,925552,9964018,831702,2487434,14558252,8362873,3154094,5788536,2214729,11130385,7289127,7628062,3505368,14681248,9441091,2142779,2244962,13120419,5292842,14726090,1810808,5316030,2435620,17561845,4525585,2264914,940830,5827161,10980063,16817570,23655680,4979386,5845260,7496959,2299445,5837923,7977364,4295963,11122363,9652985,1094438,2099611,605029,4505261,14649620,5559022,1301767,21481662,1590738,846130,3057923,1377522"}
{"url": "https://www.bbc.com/somali/articles/cj972yd2xldo", "title": "Xus la yaab leh oo ka dhaca dalkan Muslimka ee Soomaaliya xiriirka dheer la leh", "text": "\"Anigu kaligay iskama iman halkan; markuu igu yiraahdo imaaw, waan imaadaa,\" ayay tiri Sherine, haweeney aan kula kulmay afafka hore qubuurta Imam Xuseen ee Qaahira. Waxay si xooggan u muujisay in booqashada ninka uu Nabi Maxamed NNKH awoowaha u yahay ay suurtagal tahay oo kaliya iyadoo loo maro nooc ka mid ah 'kaarar casuumaad' oo loo diro dadka raacsan, meel kasta oo ay joogaan.\nFikraddan waxaa wadaaga Masriyiin badan, kuwa waxbartay iyo kuwa aan wax baranba, kuwaasoo aaminsan in booqashada qubuurta Imam Xuseen ay suurtagal u tahay kaliya dadka uu isagu oggolaaday. Waxay fasiraan oggolaanshahan iyadoo loo fududeeyo safarkooda kuna suurtogasho inay istaagaan qubuurtiisa horteeda.\nSherine waxay u sheegtay BBC Carabi: \"Sida aan qofna u tegi karin guriga qof kale la'aantiis casuumaad, ayaa sidoo kale loola mid tahay, xataa haddii aad agtiisa joogto, haddii uusan ku doonayn, ma imaan kartid hortiisa.\" Tani waxay maskaxda ku soo celisay muuqaal caan ah oo fannaanadda Amal Zayed ku jishay filimka \"Labada Qasri Dhexdooda,\" markii ay ku tiri (Mudane Sayed): \"Sayidkeen Al-Xuseen ayaa i casuumay, markaas ayaan u jawaabay\"?!\nSi kastaba ha ahaatee, Sherine, oo aaminsan in \"cidii soo booqata halka laga qabuuraha aysan la kulmayn niyad jab,\" ma jecla inay booqato xilliga ay Masriyiintu ugu yeeraan \"Mawliidka,\" sababo la xiriira ciriiriga aadka u badan ee ka hor istaaga inay gudaha u gasho masaajidka. Si kastaba, mararka qaar way booqataa Sayid Al-Xuseen.\nInkasta oo goobtan, oo ku taalla wadnaha magaalada Qaahira, oo ay barxadahadeedu noqdeen meel ay booqdaan dad ka kala yimaada daafaha dunida, haddana dalxiisayaasha iyo muwaadiniinta sida Sherine ayaa laga yaabaa inay la kulmaan dhibaatooyin ku saabsan helitaanka goobta xilliga dabaaldegga Mawliidka, marka ay buuxsanto ilaa xad, iyadoo ay camiraan \"taageerayaasha Sayidna Al-Xuseen,\" taasoo ka dhigta  meel aan xataa lug lagu tagi karin. Halkaas oo sanadkii laba jeer lagu qabto isu-soo-bax aad u ballaaran.\nEnd of Ugu akhris badan\nWaxaa si wanaagsan loo yaqaan in Imam Xuseen ibn Cali, oo ah wiilka uu awoowaha u yahay Nabi Muxamed (NNKH), uu dhashay horraantii bisha Sha'baan sanadkii afraad ee taariikhda Islaamka. Si kastaba ha ahaatee, Masriyiintu waxay sidoo kale u dabaaldeggaan xuskiisa Talaadada ugu dambeysa ee bisha Rabi' al-Aakhir, dhacdo hareysa xuska dhalashadiisa, taasoo sanadkan ku beegan 21-ka Oktoobar. Maxaa sabab u ah arrintan?\n\"Masriyiintu waxay ku xiran yihiin Ahlul-Bayt-ka (qoyska Nabi Muxamed NNKH) iyagoo u sii maraya Imam Xuseen, kaas oo ah furaha jacaylkooda oo dhan ee ay u qabaan ehelka Nabiga,\" ayay tiri weriyaha iyo qoraaga reer Masar Nawara Najm, taas oo xaqiijisay inaysan marnaba ka harin booqashada qubuurtiisa markasta oo ay u baahato si ay ugu raadiso \"deggenaanasho\"\nWareysi ay siisay BBC-da, waxay ku sheegtay imaanshaha \"madaxa sharafta leh\" ee Masar – sida ay rumeysan yihiin Masriyiin badan – inuu ahaa \"dhalasho cusub oo u bilaabatay Masriyiinta, dhalasho ruuxi ah,\" taasoo keentay in ay munaasabaddan ugu yeeraan \"Mawliid,\" oo Masriyiintu ay u arkaan mid farxad iyo sharafba leh.\nWaxaa cajiib ah in hadalkaas oo kale uu adeegsaday Imaamka iyo daaciga Masjidka Al-Xuseen ee magaalada Qaahira, Dr. Moamen Al-Khaliji, oo BBC-da u sheegay \"Waxay la mid tahay dhalashadii Masar oo kale\", waxayna muujiyeen sida ay ugu faraxsan yihiin imaatinkiisii Masar oo ay ku tilmaameen \"dhalasho\".\nInkasta oo ay jiraan sheekooyin kala duwan oo ku saabsan goobta uu yaallo \"madaxa sharafta leh,\" haddana jacaylka gaar ahaaneed ee Masriyiintu u hayaan Imam Xuseen ayaa ka dhigaya mid meel gaar ah kaga jira qalbigooda.\nDr. Cabdul-Baaqi Al-Qataan, oo ah borofisar taariikhda iyo ilbaxnimada Islaamka ka dhiga Jaamacadda Cayn Shams, ayaa u sheegay BBC-da in Faatimiiyiinta iyo Masriyiintii waqtigaas ay u arkeen imaanshaha madaxa Imam Xuseen sidii \"dhalasho cusub, ama dhalashadiisii labaad, ka dib tii ugu horreysay.\"\nWaa xusid mudan in taariikhyahanno dhowr ah ay sheegeen in madaxa Imam Xuseen la geeyey Qaahira maalin axad ah siddeedii bisha Jumada al-Aakhir sanadkii 548 Hijri. Si kastaba ha ahaatee, Masriyiintu waxay xuska sannadguuradaas u dabaaldeggaan laba bilood ka hor taariikhda rasmiga ah ee ku qoran taariikhda Hijriyada.\nDr. Al-Qataan wuxuu sheegay in doorashada taariikhda laga yaabo inay la xiriirto \"safarkii ugu horreeyay ee madaxa laga soo qaaday Ashkelon,\" markaas oo uu Al-Afdal, wasiirka Faatimiyiinta, uu madaxa u qaaday Masar dhammaadkii bisha Rabi' al-Aakhir. Wuxuu intaas ku daray in arrintani sidoo kale laga yaabo inay sabab u tahay khilaafka ku saabsan waqtiga rasmiga ah ee madaxa la geeyey Qaahira, taas oo qaar ka mid ah taariikhyahannadu ay sheegeen inay ahayd Rabi' al-Aakhir sanadkii 549 taariikhda Hijriga.\nImaamka masaajid Xusayn wuxuu BBC-da u sheegay in xafladaha dhalashada Imam Xuseen ee gudaha masaajidkiisa \"ay yihiin kuwo nabdoon oo ay ka mid yihiin akhriska Qur'aanka, duruus ku saabsan xadiisyada, casharro ku saabsan nolosha iyo taariikhda Nabi Muxamed, iyo jacaylka qoyska Nabi, iyo sidoo kale habeenno ay ka dhacaan akhris Qur'aan iyo ducooyin.\"\nXigashada Sawirka, Dr. Moamen Al-Khaliji, Imam and Preacher of Imam Hussein Mosque\nJacaylka Xuseen waa furaha farxadda.\niftiinkiisuna meel walba ku faafay.\nQabiil ka soo farcamay abtirsinye  qofka La doortay.\nNuurka wajigiisa ayuu ku iftiimiyey Masar.\nWaa erayadii qasiidadii Sheekh Taha al-Fashni, oo geeriyooday horaantii 1970-meeyadii, waxay muujinayaan rumaysnaan qoto dheer oo ay qabaan inta badan Masriyiinta in madaxa Xuseen, wiilkii uu awoowaha ahaa Nabi Muxamed NNKH ee gabadhiisu dhashay , lagu aasay dhulkooda. Tani waxay dhacdaa inkastoo qaar ka mid ah dadka Masar, sida xubno ka tirsan waxa loo yaqaan \"dhaqdhaqaaqa Salafiga,\" ay arrintan beeniyaan.\nMacluumaadkan waxaa daabacay Google YouTube.  Waxaan dalbanayenaa fasaxaaga ka hor inta aan la furin, waxaa laga yaabaa inay isticmaalayaan cookies iyo farsamooyin kale. hadii aad u bahato akhri Google YouTube xeerarka cokie iyo kan ku saabsan xogta gaarka ah ka hor inta aadan aqbalin. si aad u aragto xogta guji ‘aqbal oo soco’.\nDhammaadka YouTube boggan\nMacluumaadkan lama heli karo\nWaxaa xusid mudan in ka dib markii Imaam Xuseen lagu dilay dalka Ciraaq tobankii bishii Muxarram ee sannadkii 61-aad ee Hijriyada, kuna beegan tobnaadkii Oktoobar 680-kii,Miilaadiga, jirkiisa lagu aasey meesha maanta loo yaqaan Qubuurta Al-Hussainiya ee Karbala, sida ay isla ogol yihiin taariikhyahannadu.\nSida laga soo xigtay taariikhyahannada, madaxu waxa uu noqday muran ka dhashay dhacdooyinkii ka dambeeyay dilkii Xuseen, oo ay geysteen ciidamadii Ibn Ziyad, guddoomiyihii Ciraaq xilligii xukuumadda Umayyad Califa Yazid ibn Muawiyah, ciidamadiisuna madaxiisa ku wareejiyeen magaalooyin kala duwan oo Ciraaq iyo Bilad al-Sham ah.\nWaxaa jira qisooyin kale oo sheegaya in madaxa loo celiyey Madiina oo lagu aasey agagaarka hooyadiis, Sayidah Faatima, xabaalaha Al-Baqiic', sida lagu sheegay buugga Al-Tabaqat Al-Kubra ee uu qoray Ibn Sa'd, taariikhyahanka iyo xadiisyahanka qarnigii labaad Hijri, iyo sidoo kale Ibnu Taymiyyah, xadiis rugii noolaa qarnigii toddobaad iyo sideedaad ee Hijriga.\nWaxaa kaloo jira qisooyin sheegaya in madaxii Al-Xuseen uu ku aasan yahay khasnadda hubka ee Dimishiq tan iyo dowladdii Yaziid bin Mucaawiyah, waxaana lagu yiri Bab Al-Faradis oo ka mid ah albaabadii taariikhiga ahaa ee Dimishiq hore, sida uu Ibnu Kathiir ku sheegay (Al-Bidayah wa Al-Nihayah).\nWaxaa sidoo kale jira riwayado sheegaya in madaxa Al-Xuseen lagu aasay keydka hubka ee Dimishiq xilligii Yazid bin Muawiyah, sida lagu sheegay  qoraal laga helay albaabka Bab Al-Faradis, oo ah mid ka mid ah albaabada taariikhiga ah ee Dimishiqii hore, sida uu ku xusay Ibn Kathir buuggiisa ' Al-Bidayah wa Al-Nihayah'\nBBC-da ayaa la xiriirtay Maktabadda Ingiriiska si ay wax ugu tiraahdo waxa loo yaqaan \"Qoraal gacmeedkii taariikhiga ahaa ee ugu da'da weyn\" kaasoo soo jeedinaya in madaxa Xuseen laga wareejiyey Ashkelon loona qaaday Masar. Qoraal gacmeedkan, oo uu qoray taariikhyahanka Axmed ibn Yuusuf ibn Cali, oo loo yaqaan Ibn al-Azraq al-Farqi, ayaa ahaa garsoore ka soo jeeda qoys caan ah oo ku noolaa Mayyafariqin, oo ah magaalada ugu weyn ee Diyarbakir, hadda ku taalla Turkiga.\nBuuggiisa, \"Taariikhdii Mayyafariqin,\" Al-Farqi wuxuu ku xusay qoraal-gacmeedka - oo ay BBC-du ka heshay nuqul la sawiray - labada qisooyin ee ugu caansan. Midda hore waxa uu yiri \"waxaa jiray dadka reer Eshkalon ah oo dadka reer Dimishiq waydiistay madaxii Al-Xuseen, markaasuu la siiyey, markaasay  ayu qaadeen Eshkalon oo ay ka dul dhiseen macbad weyn, waxaana lagu bixiyey lacag aan la qiyaasi karin\".\nQisada labaad ee uu uga waramay cutubka ku saabsan Ciraaq, gaar ahaa xukunkii Yasiid Ibnu Mucaawiyaah iyo xilkii Al-Xuseen, waxaa uu yiri \" Waxa la sheegay in madaxda lga qaaday Karbala iyo in Jirkiisa lagu aasay tan kowaad ayaa ah tan qisada saxda ah ee sida ballaaran loo wariyey.\nWuxuu sheegay in madaxu yaallay Eskhalon ilaa sannadkii 549 ee Hijriyada,Dabadeedna waxaa u soo baxay khaliif Al-Zafer oo madaxii ku duubnaa sanduuqa laabta ku qaaday isagoo Ashqeloon ka soo qaaday geeyeyna Masar wuxuuna  Masar ka dul dhisay macbad weyn, wuxuuna ku bixiyey lacag faro badan.\nXigashada Sawirka, AFP via Getty Images\n\"Waxaad tahay jacaylkayga weyn, kan ugu horreeya iyo kan uugu dembeeya, mana jiro qof kale oo aan adiga ahayn, jacaylkayga, qalbigaygu wuxuu u xiran yahay jacaylkaaga.\" Waa tuduc ka mid ah hees uu leeyahay fanaankii reer Lubnaan ee Ragheb Alama. Nawara ayaa maqashay heestan oo uu ku luuqeeyay mid ka mid ah asxaabteeda mar ay booqatay Al-Xuseen, iyadoo ku muujinaysay heerka uu gaarsiisan yahay jacaylka ay u qabto.\nNawara waxay sheegtay in jacaylkeeda Xuseen uu leeyahay dhinac \"aan macquul ahayn,\" oo ku dhuumanaya dareen \"sirr\" ah, marka lagu daro in uu matalo qiimaha \"geesinimada, is-huridda, iyo ka hortagga madaxda cunsuriga ah iyo beenta, iyo baaqyadiisa ka dhanka ah ceebaynta iyo adduunka.\"\nImaam Xuseen waxa ay taageerayaashiisu u yaqaaniin \"madaxweynaha Jamhuuriyadda Qarsoon,\" oo ay ula jeedaan inuu yahay hoggaamiyaha ruuxiga ah ee Masar, iyo \"Waardiyaha Bakarooyinka\" oo dadka martida u ah khayr, barako iyo iftiin u bixiya.\nXigashada Sawirka, Getty Images\nDr. Moamen, Imaamka iyo daaciga Masjidka Al-Xuseen, wuxuu yiri, \"Barakada ugu weyn ee Awliyada xaqa ah ee Ilaahay ee Masar ku sugan waa sayidkeenna Imaam Xuseen, waana sababta aan ugu yeerno ilaaliyaha Barakooyinka, taas oo ah, waa kan ugu khayrka badan awliyadii Ilaahay ee xaqa ahaa ee Masar.\"\nImaamka oo ku takhasusay cilmiga fiqiga iyo falsafada ee kuliyadda aasaasiga ah ee diinta, ayaa intaa ku daray in tani ay muujinayso heerka uu gaarsiisan yahay jacaylka ay Masaarida u qabaan Xuseen, kaas oo awoowgiis Nebi Muxamed uu \"la soocay\" oo uu ku tilmaamay \"in cid kale aanay lahayn\", marka uu yidhi \"Ilaahay waa jecel yahay qofka Xuseen jecel\" xadiis.\nRuntu waxa ay tahay in qofkasta oo u kuur gala bulshada Masar uu arki doono, in 800 oo sano, ay Masaaridu iska dhaxleen jacayl ay u qabaan Xuseen, kana maran kooxaysi.\nWaxay siiyeen magacyo kala duwan oo ka tarjumaya qadarin iyo sharafta uu ku leeyahay qalbiyadooda. Waxay madaxiisa ka dhigeen Kabco ay u safraan mar kasta oo ay raadinayaan degenaansho, farxad, iyo barako, iyaga oo aan dan ka lahayn arrimo muran ka taagan yahay oo arrintan ku saabsan.", "date": "2025-10-22", "scraped_at": "2025-10-29T17:07:28.368888+00:00", "category": "news", "text_hash": "74446119b8b8ffd1993e18bf1468e37bc1adeac998a908e714b05e9f291e3377", "minhash_signature": "1388556,2959463,3091023,1950992,1203274,874039,789087,5799711,5032519,946809,21479,504298,2468849,2737320,1886794,394921,2367262,227165,2028625,554102,9857695,3109440,1817122,4436629,21137,425806,264460,3507300,3786600,610873,2823181,467032,2065174,75208,678001,484806,1572898,1790799,1104624,1737287,723373,1654401,529519,2934928,5590241,786533,2346184,2160439,317203,68927,80497,804483,8142,1384928,6458,4578253,6274371,204581,4236903,1395250,6674185,2045447,425968,194598,1314673,4856291,376138,3142595,3219382,5607690,4783175,1699584,3066012,4637588,277659,2841221,2854440,3937306,1601657,1062306,1648267,257900,8784654,1424595,4440962,2549819,1196521,3309294,208698,352932,5498009,3998096,560618,327573,2086700,1827755,1279608,149,86489,13666723,173134,8060930,272755,592252,783028,1097738,423618,1101684,98073,457090,5868208,3148166,902373,1157284,1332660,1377107,2448800,3409479,1703593,3612843,1353405,1342359,322619,257057,374386,10204567,11236995,3062348"}
{"url": "https://www.bbc.com/somali/articles/cd1nrvxy587o", "title": "Ismaaciil Cumar Geelle oo BBC-da u sheegay waqtiga uu xilka ka dagayo", "text": "Xigashada Sawirka, Getty Images\nMuddo 23 sano ah ayuu Ismaaciil Cumar Geelle xukumayay dalka Jabuuti oo ay ku nool yihiin shacab tiradoodu dhan tahay hal milyan oo ruux, balse hadda waxa uu ku dhawaaqay waqtiga uu ka dagayo xilka.\nWareysi gaar ah oo uu Madaxweyne Geelle siiyay BBC-da ayuu uga hadlay arrimo ay ka mid yihiin qorsheyaasha dowladdiisa, mucaaradka, sicirka nolosha, kobaca, halista kooxaha jihaad doonka ah, xiriirka Soomaaliya iyo xasaradaha Itoobiya.\nIsmaaciil Cumar Geelle waddankiisa waxa uu buundo uga dhigay ganacsiga ay dowladda Shiinaha la wadaagto qaaradda Afrika, sidaasna waxa uu ku noqday marinkeeda cusub.\nBalse dadka kasoo hor jeeda waxa ay maamulkiisa ku qeexeen mid shacabka muquuninaya oo ka hor istaagaya waxyaabaha ay xor u yihiin.\nWariyaha BBC-da, Nicolas Négoce, oo dhowr oo wareystay Madaxweynaha Jabuuti ayuu u sheegay in uu xilka wareejin doono sanadka 2026-ka, oo ku beegan marka uu dhammaado muddo xileedka hadda u socda.\nEnd of Ugu akhris badan\nTaas ayaa ka dhigan in Geelle uusan mar kale usoo istaagi doonin tartanka doorashada madaxweynaha marka ay doorashada xigta dhacayso.\nXigashada Sawirka, Getty Images\nSu'aalaha la waydiiyay inta uu wareysigu socday waxaa ka mid ah mid ku saabsanayd sida uu u arko dadka u badan dibad joogga ee baraha bulshada soo dhigaya baaqyada ay ugu jeedinayaan in uu xilka iska casilo, maadaama ay ku eedeeyeen in uusan shacabkiisa u qabanin wax ku filan.\nIsagoo ka jawaabayay su'aashaas ayuu Madaxweyne Geelle yiri: \"Haddii aad dibad joog tahay micnaheeda ma aha inaad mucaarad noqoto. Haddii aadan rabin inaad ka shaqyaso gudaha dalkeenna micnaheeda ma aha inay fasax kuu tahay inaad abuurato sheekooyin aan jirin.\"\nInta badan dadka reer Jabuuti iyo kuwa dhaliila maamulka Madaxweyne Geelle ayaa tusaale usoo qaata sicirka nolosha ee qaaliga ah. Waxyaabaha sida gaarka ah aad looga cawdo waxaa ka mid ah qiimaha korontada oo sarreeya.\n\"Ma nihin waddan saliidda soo saara. Ma nihin waddan leh wabiyo oo korontada ka dhaliya gudaha. Waxaan hoos dhigay qiimihii korontada oo horay u sarreeyay. Waddamada dariskeenna ah marka laga reebo Itoobiya, xitaa maba haystaan adeeg koronto oo la isku hallayn karo. Waa inaan ku faanno waxa aan haysanno ilaa hadda,\" ayuu yiri Madaxweyne Geelle.\nXigashada Sawirka, Getty Images\nMar uu ka hadlayay heerka faqriga ayuu yiri: \"Wax roob ah ma aannaan helin muddo saddex ilaa afar sano ah. Ma jiraan beero. 6% ilaa 8% kobac dhaqaale ah kama imaado meel cidlo ah. Waxa uu ka imaadaa shaqo joogto ah oo aan u hayno sidii aan u cirib tiri lahayn faqriga iyo jaajada.\"\nDhinaca khatarta kooxaha loogu yeero argagixisada ayuu sidoo kale ka hadlay madaxweynaha Jabuuti, waxa uuna si gaar ah diiradda u saaray hadal hal sano ka hor uu yiri hoggaamiyaha Al-Shabaab, Axmed Cumar, oo ku baaqay in la weeraro Mareykanka iyo Faransiiska saldhigyada ku leh Jabuuti.\nWaxa uu sheegay in dowladdiisu aysan halis gooni ah dareemeynin.\n\"Mar walba waan isdifaaci doonnaa. Way dhihi karaan wax kasta oo ay rabaan balse annagu waan kasoo hor jeednaa qalalaasaha, argagixisada, xagjirnimada iyo wax walba oo wax u dhimaya xornimadeenna iyo xornimada dadka kale,\" ayuu yiri.\nXigashada Sawirka, Getty Images\nWaxaa kale oo Geelle wax laga waydiiyay sida loo sii xoojin karo xiriirka Jabuuti iyo Soomaaliya, maadaama uu bishii June Muqdisho uga qayb galay caleema saarka Madaxweyne Xasan Sheekh Maxamuud, dhawaanna uu madaxweynaha Soomaaliya qudhiisa booqday Jabuuti.\n\"Waligeed ma jirin caqabad noo dhaxaysay annaga iyo Soomaaliya, tan iyo sanadkii 2000. Waxaan ka mid nahay taageerayaasha tirada yar. Waligeen kama aannaan cago jiidin, mar walbana waan taageeri jirnay [Soomaaliy] si ay dowladnimadooda usoo ceshtaan.\"\nDhanka kale, mar uu ka hadlay xasaradda Itoobiya waxa uu sheegay in ay socdaan dadaallada dib u heshiisiinta, ayna rajaynayaan in ay natiijo fiican kasoo baxdo.\n\"Itoobiya way badbaadi doontaa. Annagu waxaan mar walba u xusul duubaynaa in la helo Itoobiya mideysan oo horumarta,\" ayuu yiri madaxweynaha Jabuuti.", "date": "2022-07-20", "scraped_at": "2025-10-29T17:08:29.741924+00:00", "category": "news", "text_hash": "b77bf81c40499246084324091367a70d2baadc975507d19fc8bc48977a6e2b81", "minhash_signature": "4121492,9794783,17169987,4078497,1759059,3361393,4565440,8378359,5026093,4806415,1786162,4526452,1148157,12911215,2471777,2409529,23871820,4011106,4874497,6062655,7512143,5718863,204914,4436629,2457185,5013278,9811408,25861182,10393832,81276,11887664,2364212,7449761,1989321,2448289,2795974,5524090,5597215,23389128,11828107,1022442,1842392,25561581,17105264,25654799,3956655,9878557,3455323,14043515,1094176,11656401,3048396,302336,5007551,25833180,1958357,7123834,6177143,2956139,3337469,14466210,615590,11475407,19582406,11166526,10220532,7591779,1571315,6356195,10772691,2676708,6878191,14953688,5525616,11653318,232624,6118447,7227288,8248516,32794,11506488,7306943,3876351,1825766,1574701,739241,2482019,29457570,6346695,7719083,4526270,834278,10087646,5769848,7164507,11009701,1095607,190105,812358,27615924,10456939,13164568,22886940,7296709,483451,16985418,4322676,2238366,11070008,10001623,4380980,256264,3087863,2617020,6300135,21162517,14431355,9314290,6849199,16195249,3970829,1055918,9010322,1861837,754368,40154965,3571176,5315148"}
{"url": "https://www.bbc.com/somali/articles/cgkzrjdpj67o", "title": "Maxaadan ka ogayn musiibada ka taagan Darfur iyo kooxda RSF?", "text": "Xigashada Sawirka, Reuters\nXoogaga Gurmadka Degdegga ah ee RSF ayaa ku dhawaaqay inay gacanta ku hayaan magaalada El Fasher, oo ah caasimadda gobolka Waqooyiga Darfur, oo ah magaaladii ugu dambeysay ee ugu weyneyd ee ay gacanta ku hayaan ciidamada Sudan.\nKu dhawaaqistani waxa ay ka dhigan tahay isbeddel aasaasi ah oo ku yimid khariidadda dagaalka ee gobolka, maadaama dhammaan shanta gobol ee Darfur ay hadda gacanta ku hayaan ciidamada taageerada degdegga ah (RSF).\nWarkan ayaa lagu sheegay war rasmi ah oo la soo saaray iyo sawiro muujinaya in ciidamada ay gudaha u galeen gudaha magaalada iyo xarunta taliska qeybta 6-aad ee ciidamada lugta.\nIyadoo la filayo inuu bayaan ka soo baxo taliska ciidamada oo lagu cadeynayo sida ay wax u dhaceen, gudoomiyaha golaha madax banaanida dalka Sudan, Abdel Fattah al-Burhan, ayaa sheegay in ka bixitaanka magaalada loo sameeyay \"si loo ilaaliyo nolosha muwaadiniinta iyo in laga ilaaliyo El Fasher burbur kale.\"\nWaxa uu sharraxay in qaar badan ay isku dayayaan in ay si dhuumaaleysi ah ku maraan wadooyinka galbeedka iyo koofurta, waxaana uu sheegay in tiro ka mid ah dadkaasi la dilay xilli ay doonayeen in ay gaaraan Tawila, gaar ahaan dhanka galbeed oo ay ku sugan yihiin Ciidamada Gargaarka Degdegga ah, halkaas oo ay sidoo kale ku heystaan tiro dad ah, ayuu yiri.\nEnd of Ugu akhris badan\nXigashada Sawirka, Reuters\nQabshada Ceel Fasher waxay ka dhigan tahay isbedel weyn oo dhanka militariga ah, iyadoo magaaladu ay ka dhigan tahay fariisimadii ugu dambeeysay ee ciidanku ku lahaa gobolka Darfur, kaas oo ka kooban ku dhawaad afar meelood meel dhulka Suudaan.\nEl Fasher waa mid ka mid ah goobihii ugu xumaa ee ay ka dhaceen dagaallada sokeeye ee Suudaan: waxa ay Qaramada Midoobay ku tilmaantay xuddunta dhibaatada,  dadka ku go'doonsan halkaas waxaana ka go'ay cunnadii iyo daawadii ay go'doomiyeen RSF-ta, dad badan ayaa ku dhintay, kuna barakacay dagaalka.\nWaxay ku taal waqooyiga gobolka Darfur, meel in ka badan 800 oo kilomitir dhanka galbeed ka xigta caasimada Khartoum, waxayna qiyaastii 195 kiiloomitir u jirtaa Nyala oo ah caasimadda gobolka Koonfurta Darfur.\nEl Fasher waxay ku taal meel istiraatiiji ah oo ku taal Waqooyiga Darfur. Hadda waa magaalada kaliya ee weyn ee laga heli karo magaalooyinka waqooyiga Suudaan, sida Ad Dabba, dhanka Darfur, sababtoo ah waxay u dhowdahay juqraafi ahaan meelahaas.\nXigashada Sawirka, GETTY\nMagaaladu waxay qani ku tahay kheyraadka dabiiciga ahoo kamid ah xoolaha iyo macdanta, taas oo dhaqaalaheedu muhiim ka dhigeysa, marka laga yimaado muhiimadda ciidan iyo tan siyaasadeed.\nSidaa darteed, El Fasher waxay u taagan tahay marinka ugu muhiimsan ee kolonyada gargaarka bini'aadantinimo ee ka imaanaya Port Suudaan ee xeebta Badda Cas, kuwaas oo hadda hela mucaawino shisheeye ka hor inta aan loo qaadin qaybo kala duwan oo ka mid ah gobolka Darfur.\nSidoo kale, Chad waxay xuduud la leedahay El Fasher dhanka galbeed iyo Liibiya oo dhanka waqooyi ah, taasoo ka dhigaysa goob istaraatiiji ah oo muhiimad ciidan u leh xisbiga maamula, gaar ahaan marka la eego joogitaanka kooxaha hubeysan iyo ciidamada Suudaan ee ku sugan xudduudaha labada dal ee deriska ah, sida laga soo xigtay warbixinnada warbaahinta iyo ururada ay khuseyso amniga gobolka, sida kooxda xasaradaha caalamiga ah.\nEl Fasher waxaa dega qabaa'il iyo qowmiyado kala duwan oo ka kala yimid guud ahaan Suudaan. Si kastaba ha ahaatee, dadka intiisa badani waxay ka soo jeedaan qowmiyadaha ay ka soo jeedaan kooxaha hubaysan, sida Zaghawa, Fur, iyo Masalit. Qaar badan oo ka mid ah kooxahan ayaa deggan xeryo barakac oo ku baahsan El-Fasher.\nGacan ku heynta Ciidamada Taageerada Degdegga ah ee magaalada El-Fasher, ayaa loo arkaa in ay wax ka bedeleen dagaalka socday tan iyobishii April sanadkii 2023.\nXoogaga waxay hadda maamulaan inta badan galbeedka Suudaan, iyagoo siinaya dhul ballaaran iyo istiraatiijiyad qooto dheer.\nFalanqeeyayaasha ayaa aaminsan in isbedelkani uu u riixi karo dib u habeynta khariidadda isku dhaca iyo dheeli-tirka awoodda gorgortanka. Si kastaba ha ahaatee, waxay sidoo kale kor u qaadaysaa cabsida laga qabo in dagaalku uu gaaro gobollada waaweyn ee Kordofan iyo Darfur, halkaasoo daacadnimada qabaa'il iyo danaha dhaqaale ay isku xiran yihiin.\nEl Fasher hal maalin kuma dhicin, ee waa ka dib go'doomin dheer iyo dhibaatadii bani'aadantinimo oo daba dheeraatay. Xakameynteeda waxay wax ka bedeli kartaa wejiga dagaalka, iyo malaha wejiga Suudaan laftiisa. Maanta, waxay hoos timaadaa maamul cusub waxayna wajaheysaa xaqiiqo aan la hubin.\nSida suudaaniyiintu ayka dhiir sugayaan waxa xigi doona isbeddelkan ka dib, su'aasha ugu weyn ayaa ah: El Fasher ma noqon doontaa bilowga dhamaadka dagaalka, mise bilawga cutub sii adag?", "date": "2025-10-28", "scraped_at": "2025-10-29T17:09:28.337683+00:00", "category": "news", "text_hash": "044abf7ac4e1f95caad27f7af1508bdbf4fad07d4e24c1178c284f3ccb05c82c", "minhash_signature": "1872077,1248418,9057333,3597860,205881,10046990,11011284,5119088,7112886,2376606,1754962,59520,2753369,1054367,11713884,720898,8378922,10774366,3779146,841151,649828,14082669,12998978,581289,1195470,82550,15207472,4104497,43695,2856319,13035207,4747575,11602874,1869612,3222399,2676790,13248310,6385070,11886997,10138239,3932370,5673898,9081842,3720981,1393177,1997035,6353518,103442,317203,2482151,6232663,8982839,6023581,17227848,3064800,1859368,9023580,3930718,10452200,257553,4981654,9208300,11360511,1281345,6171592,3935330,66938,4549625,1689362,5977737,246921,1442833,6109870,1854261,3081411,7506875,2994126,3083975,11011889,5462164,7479689,645018,1710570,9466501,1752510,4787201,34426282,15734589,64238,2288514,4150511,1436431,5555,5523348,4298016,18040489,5163449,5942836,1492760,2590770,3106705,5059174,1998655,11040727,19082747,2738613,6929355,5784076,4341048,6544036,1355313,3073218,5481911,6519302,517430,10434790,4757486,14452401,7634642,1769137,3395426,1187385,4875190,12021673,3087610,2500917,15681808,4828411"}
{"url": "https://www.bbc.com/somali/articles/c1wqpelz5dwo", "title": "Dhalinyarada Muqdisho oo helay goob cusub oo ay u dalxiis tagaan", "text": "Maanta oo ay taariikdu ku beegantahay 27-ka bisha Sep, dunida waxaa laga xusayaa maalinta dalxiiska aduunka.\nMagaalada Muqdisho markaan eegno, dadka waxay badanaa u dalxiis tagaan xeebaha ku yaala dalka balse, bilihii u dambeyay waxa ay qaarkood u dalxiis tagayeen degmada Balcad ee gobolka shabeelaha dhexe, degmadaas oo caan ku ah beeraha ku yaalala hareeraha webiga Shabeele maadama la dhisay wadada isku xirta Muqdisho iyo Balcad.\nWariyaha BBC-da Muqdisho, Maxamuud Cabdicasiis ayaa booqday degmadaas, warbixintaan ayuuna halkaas ka soo diray.\nEnd of Ugu akhris badan", "date": "PT6M12S", "scraped_at": "2025-10-29T17:10:30.219010+00:00", "category": "news", "text_hash": "aba1ae7caed7d4b9e90e6b0ed2d6ce12470294fecd4a733dc287129b95f51e0e", "minhash_signature": "161942161,49171095,65588581,10258343,138775432,53323530,1221711,39057581,49056273,94186960,43125418,13651863,37939063,26535199,24566235,55334362,2405550,10774366,65949215,10672451,4914269,5228055,6717799,40878746,21658553,67547856,185527190,74344301,41776885,23785220,21265497,63720068,88204951,2364833,108700,5380657,67311761,22519902,69773772,115222684,63333352,60330512,9139315,59318525,39938417,13928828,8607083,47344881,44976762,107238218,14669719,10142221,41289629,62746187,6003723,27151571,44187328,36222724,113065523,2710384,147814571,5547695,36954896,6473830,33904093,58032843,33286515,35961791,1926466,10967261,98489242,57136233,14953688,12371667,8526123,139253897,2035410,51338269,95421590,3883766,10968364,17782952,14109390,108270219,200995562,20326600,38650219,57704974,3357729,5725105,34471871,6267717,12949654,58901188,22188751,90854440,56881081,30219209,30573255,38846390,49570581,48333472,109463254,29909638,57617474,39660065,5754790,13884726,92956507,65938074,126399925,151019498,28673848,25226111,69701131,102913142,9901911,6199895,109411105,154808494,1029048,20236482,86018759,96427906,9470141,19305959,54248188,41747778"}
{"url": "https://www.bbc.com/somali/articles/cx2p35208nzo?at_medium=RSS&at_campaign=rss", "title": "Sidee looga falceliyey in baarlamaanka Jabuuti uu meesha ka saaro xadka da'da madaxtinnimada?", "text": "Xigashada Sawirka, Facebook/Ismail Gualleh\nQaar ka mid ah xisbiyada mucaaradka ah ee Jamhuuriyadda Jabuuti ayaa ka hor yimid tallaabadii shalay baarlmaanka dalkaasi ay wax kaga beddeleen dastuurka dalkaas.\nSi gaar ah, waxay ansixiyeen shalay qodob meesha ka saaaraya xaddidaadda da'da madaxweynaha taas oo u gogol xaadhaysa in markii lixaad uu xilka u tartami karo Madaxweyne Ismaaciil Cumar Geelle.\nMucaaradka ayaa ku doodaya in madaxweynuhu uu horey u ballan qaaday in aanu dastuurka wax ka baddel ku sameyn doonin hase-yeeshee ay hadda arrintaasi dhacday.\n\"Dastuurka waxaa laga dhigtay shaadh marna yaraysanaya, marna la ballaadhsanaayo, markii ugu horreysay ee la beddelay waxay 2010 oo dano gaar ah loo beddelay, hadanna isla sidii uun baa loo beddalay\" ayuu BBC-da u sheegay Khadar Cabdi Ibraahim oo ah guddoomiyaha Xisbiga Model.\nMadaxweyne Ismaaciil Cumar Geelle ayaa haatan jira da'aadda 77 jir.\nEnd of Ugu akhris badan\nDhammaan 65 xildhibaan ee goobta joogay ayaa Axaddii u codeeyay in la tirtiro xadka da'da ee 75 sano, taas oo u oggolaanaysa hoggaamiyahan muddada dheer xilka hayay inuu ka qayb galo doorashooyinka la qorsheeyay bisha Abriil ee 2026.\nGo'aankan ayaa u baahan oggolaanshaha madaxweynaha oo ay ku xigto codsi labaad oo baarlamaanka ah labada Noofambar, ama afti qaran.\nGeelle, ayaa xukumayay dalkan ku yaalla Geeska Afrika tan iyo 1999, markaas oo uu xilka kala wareegay Xasan Guuleed Abtidoon, madaxweynihii aasaasay dalkaas.\nXannibaaddan dastuuriga ah ayaa waxaa la soo rogay 2010-kii iyada oo uu Geelle isagu hoggaaminayay dib-u-habeyntan cusub oo ay ku jirto in la tirtiro xadka muddo-xileedka madaxweynaha, balse sida oo kalena la dhimo muddada xilka lixda sano ilaa shan sano.\nGuddoomiyaha Golaha Wakiillada, Dileita Maxamed Dileita, ayaa isbeddelka difaacay isaga oo ku tilmaamay mid lagama maarmaan u ah ilaalinta xasilloonida gobolka oo qalalaase ka jiro. Wuxuu sheegay in taageerada dadweynuhu ay dhaaftay 80 boqolkiiba, inkastoo BBC aanay si madax bannaan u xaqiijiso sheegashadan.\nXigashada Sawirka, SOCIAL\nMucaaradka ayaa se sheegay dhankooda in arrintaas aanay wax ba ka jirin dadkuna xaalkan ka xumaadeen.\n\"Hadalka Guddoomiyaha Baarlamaanka waa mid siyaasadeed, siiba barobagaando, laakiin runtii marka xaqiiqada la taabto reer jabbuuti way kacsan yihiin, way cadhaysan yihiin, mana aqbalayaan mana doonayaan in dastuurkooda la taataabto\" ayuu BBC-da u sheegay Khadar Cabdi Ibraahim.\nGeelle ayaa ah hoggaamiyaha saddexaad ee ugu muddada dheer Bariga Afrika, wuxuu ku xigaa Yoweri Museveni-ga Uganda oo xilka hayay ku dhowaad 40 sano, iyo Isaias Afwerki-ga Eritrea oo talada haya muddo gaaraysa 27 sano.\n\"Madaxweynuhu wuu ku khasaaray siyaasaddii dalka gudahiisa, waayo dadka reer Jabuuti boqolkiiba 42 waxa ay ku nool yihiin saboolnimo xadka dhaaftay, dhallinyaraduna waa shaqo la'aan, waxaana ay ka fikiraan sidii ay dalka ugu tahriibi lahaayeen, markaa isbeddel iyo qof leh siyaasad kale oo cusub baa loo baahan yahay\" ayuu ku dooday Khadar.\nXigashada Sawirka, SOCIAL\nGo'aanka baarlamaanka Jabuuti ee laalay xadka da'da ee musharrixiinta madaxweynenimada ayaa dhalisay falcelin xooggan oo ka imanaysa shacabka gudaha iyo dibadda dalka, gaar ahaan baraha bulshada. Xilli doorashada la qorsheeyay bisha Abriil 2026.\n\"Waqtigii Jabuuti ay toosi lahayd waa yimid, aan dhahno 'maya muddo-xileed lixaad. Waxaan samayn karnaa sida dhalinyaradii Madagascar,\" ayuu yiri Xaakim, arday 24 jir ah\n\"Keliya afgembi dimuqraaddi ah ayaa ka badbaadin kara Jabuuti riyadan madow. Tani waa wax la yaab leh oo aan la rumaysan karin. Waan ka daalnay,\" ayay baraha bulshada ku qortay Xaawa, haweeney u dhaqdhaqaaqda xuquuqda bulshada.\n\"Codbixinta baarlamaanka ma aha wax igu cusub,\" ayay tidhi Sonia Le Gouriellec, oo ah khabiir ku takhasustay Geeska Afrika.\n\"Waxaa jira mudaharaadyo baraha bulshada ka socda, balse waxaan ka baqayaa in mucaaradku uusan heli doonin meel uu isku muujiyo gudaha Jabuuti, oo ah dal cabudhsha xorriyadda hadalka iyo saxaafadda.\"\nDhankiisa, Guddoomiyaha Golaha Wakiillada, Dileita Maxamed Dileita, ayaa sharraxay in isbeddelka dastuuriga ahi uu muhiim u yahay \"ilaalinta xasilloonida dalka, oo ku yaalla gobol ay ka jiraan caqabado amni,\" isagoo tixraacaya dalalka deriska la ah — Soomaaliya, Itoobiya, iyo Eritrea.\nDastuurka dalka ayaa hore u sheegayay in qof ka weyn 75 jir aanu ka qayb gali karin doorashada madaxtinnimada, taasoo hor istaagtay madaxweynaha hadda jira, oo 77 sano jir ah, inuu u tartamo muddo-xileedkiisii lixaad ee doorashada soo socota.", "date": "2025-10-27", "scraped_at": "2025-10-29T17:11:28.681086+00:00", "category": "news", "text_hash": "32f44920c969ee41f220f9911a067b8a7a195268a42613af9a05663e9c69b783", "minhash_signature": "22089188,10649034,12608699,7180394,7417181,14271004,14228800,6334414,4019459,3283897,13175366,7735664,4581803,28890439,4855979,2575618,16424616,10774366,11870552,1393294,12215812,4090426,7500705,9978276,3230537,15119159,435706,84042,4301261,5635751,10523914,12873613,12501477,4605682,157142,3860602,9248975,857487,25112870,3530820,3022804,16130133,2075112,8092413,1538710,15445709,4761798,28396428,545675,6268823,11628945,27584663,3826964,621068,3187102,946658,25694126,16976447,6595485,7523259,17105482,2083480,10881869,5997368,16165893,3774382,4429997,2839409,803920,5268278,10935359,6955447,1033530,6736292,287755,855752,15213099,3134119,5976385,32794,1858929,8290207,5505967,17617089,176932,6646811,6986244,894181,3001646,3501737,3481419,10060207,2422906,1126628,34221445,1247,19630295,2002302,1227812,1958014,2021490,3832414,2609440,13349589,1316625,19979233,11659018,2333362,453063,4730586,1009201,1668128,1053392,8286316,9420426,6147614,2076266,1319114,4549592,21152434,10518056,14169614,11459364,925539,13661598,579141,5619493,3989064"}
{"url": "https://www.bbc.com/somali/articles/c87e8rz0r7go", "title": "Maxay dumarku uga kaadi badan yihiin ragga", "text": "Xigashada Sawirka, Getty Images\nNolosha maalinlaha ah, waxaa laga yaabaa in aan aragno in dumarku ay si ka badan ragga ugu wareegayaan ama u socdaan.\nDadka qaar ayaa laga yaabaa inay isweydiiyaan in kaadi haysta ragga ay ka weyn tahay tan dumarka?\nJawaabtu waa: Taasi sax ma aha. Sharaxaaddu waa mid wax yar adag, waxayna la xidhiidhaa jir dhiska, dabeecadda, iyo arrimo maskaxeed.\nWaxaa dhici karta in dumarku ay dareemaan rabitaanka ah inay kaadiyaan si ka badan ragga, balse ma jiro farqi weyn oo u dhexeeya cabbirka kaadi haysta ragga iyo dumarka\nKaadi haystu waa bac u eg kubbad hawo ku jirto oo ku taal caloosha hoosteeda Waxay ka samaysan tahay laba lakab oo jidh ah\nEnd of Ugu akhris badan\nLakabka koowaad waxaa loo yaqaan luuqadda Ingiriiska eray ahaan detrusor, kaas oo ah lakabka dibadda, halka lakabka labaadna loo yaqaan transitional epithelium, kaas oo ku yaal gudaha.\nLakabka dibadda ee detrusor-ka waa mid jilicsan oo dabacsan; wuu balaadhan karaa ama wuu is-xidhi karaa sida kubbad hawo ku jirto, taasoo u suurtagelinaysa kaadi haysta inay kaydiso kaadi badan iyada oo aan qofku dareemin cadaadis. Marka ay buuxsanto ayay qofku bilaabantaa inuu dareemo baahi uu ku kaadiyo.\nLakabka gudaha, ee loo yaqaan transitional epithelium, isna wuu balaadhan karaa si uu u qaado kaadida sii kordheysa, wuxuuna sidoo kale ka ilaalinayaa gudaha kaadi haysta sunta iyo kiimikooyinka waxyeellada leh ee ku jira kaadida.\nXigashada Sawirka, Getty Images\nKaadi haystu waa xubin si qurux badan u dhisan oo adkaysi leh, taasoo awoodeeda balaadhinta iyo isxidhitaanka ay la qabsato isbeddelka tirada kaadida iyada oo aan dillaacin ama jabin inta uu qofku nool yahay.\nDhinaca qaab-dhismeedka jirka, isku-mid ahaanshaha u dhexeeya kaadi haysta ragga iyo dumarka ayaa ka badan farqiga u dhexeeya.\nLabaduba waxay kaydin karaan kaadi dhan 400 ilaa 600 millilitir. Unugyada ku wareegsan kaadi haysta ayaa saameyn kara sida qofku u dareemo baahida inuu kaadiyo.\nHalkaas ayeyse kala duwanaanshuhu ka bilowdaa.\nRagga, kaadi haystu waxay uga ku taallaa qaybta kore ee qanjirka prostate-ka, waxayna ku dhow dahay mindhicirka dambe ee u dhow dabada.\nXigashada Sawirka, Getty Images\nDumarka, kaadi haystu waxay uga taallaa meel u dhexeysa lafaha miskaha, meel u dhow ilma-galeenka iyo xubinta taranka ee gudaha.\nMarka haweeney uur leedahay, kororka cabbirka ilma-galeenka ayaa cadaadis saara kaadi haysta, taasoo keenta inay u baahato inay si joogto ah u tagto musqusha mararka qaar ilaa 20 daqiiqo kasta, gaar ahaan seddaxda bilood ee ugu dambeysa ee uurka.\nXitaa marka haweeneydu uur lahayn, ciriiriga booska ku xeeran kaadi haysta ayaa keeni kara inay si degdeg ah u dareento baahida kaadi, marka loo eego ragga.\nCilmi-baadhayaal qaar ayaa muujiyay in haween qaarkood ay si dhakhso leh u dareemaan rabitaanka kaadi, taasoo la xidhiidhata isbeddelka hormoonnada iyo cabbirka meelaha miskaha oo ah halka ay kaadi haystu ku taal.\nMuruqyada ku yaal hoosta miskaha  halka ay ku fadhiyaan kaadi haysta, ilma-galeenka, iyo mindhicirka  waa kuwo aad muhiim u ah.\nDumarka, dhalmada, isbeddelka hormoonnada, ama gabowga ayaa wiiqi kara muruqyadaas, taasoo saameyn karta awoodda kaadi haysta inay xajiso kaadida.\nQeyb kale oo muhiim u ah xakameynta kaadida waa urethral sphincter  waa muruq wareegsan oo u shaqeeya sida qasnadda, kana ilaaliya kaadida inay soo baxdo ilaa qofku diyaar u yahay inuu kaadiyo.\nSi kastaba ha ahaatee, sabab kale oo keenta kaadida oo ku badan dumarka waa caabuqa mareenka kaadida (UTI), taasoo dumarka ugu badan ku dhacda sababtoo ah dhuunta kaadi-mareenka oo gaaban. Caabuqaasi wuxuu keeni karaa in kaadi haystu aad u dareento, waxaana dhici karta in astaamuhu sii jiraan xitaa ka dib marka la daweeyo.\nWaa caado ay tahay gabdhaha yaryar in loo sheego inay tagaan oo ay kaadiyaan, gaar ahaan marka ay da'doodu yar tahay. Waxaana inta badan la baraa inay ka fogaadaan musqulaha dadweynaha.\nTani waxay keentaa caado ah in la faaruqiyo kaadi haysta ka hor inta aysan buuxin, taasoo xaddidi karta awoodda kaadi haysta ee fiditaanka.\nXigashada Sawirka, Getty Images\nDhinaca kale, wiilasha inta badan looma cadaadiyo inay kaadiyaan marka ay yar yihiin.\nKaadi haystu waxay la qabsataa dabeecadaha lagu tababaray.\nTababarka kaadi haysta  oo ay dhiirrigeliso hay'adda caafimaadka ee UK  wuxuu ka kooban yahay in si tartiib ah loo kordhiyo waqtiga u dhexeeya kaadida hadda iyo tan xigta.\nTani waxay caawisaa in si wanaagsan loo habeeyo xidhiidhka ka dhexeeya kaadi haysta iyo maskaxda, taasoo yareyn karta dareenka degdegga ah ee loo baahan yahay in la kaadiyo.\nSidaas darteed, ma aha in la yiraahdo kaadi haysta dumarka way ka yar tahay tan ragga, balse booska fiditaankeeda ayaa kooban.\nHaddaba, kaadi badan oo ku badan dumarka waa natiijo ka timaadda isku darka jir dhis, dabeecad, iyo isbeddelada ku dhaca jidhka haweeneyda waqti ka waqti.\nBarofaysar Michelle Spear waa macallimad caafimaad oo wax ka dhigta Jaamacadda Bristol ee dalka UK.", "date": "2025-08-01", "scraped_at": "2025-10-29T17:12:28.650276+00:00", "category": "news", "text_hash": "11d38b54ba68b93382664ed40fde34312e32c9f87f769973ea39fdb3fca8072c", "minhash_signature": "4744932,441231,12066323,7854192,1198050,2807522,5438151,3686574,5309781,5059080,1307663,168475,2009935,3720765,2384322,5923797,768725,670124,5146861,1702268,3901443,10455691,9097076,966434,7237949,6825806,3457093,4799643,3235519,10259259,15255493,2351110,4445423,25351076,937916,1223919,3072888,2685667,5872670,18391737,16676381,2946795,2274318,778709,3731415,8418137,2800626,1302645,6871809,5538632,1912406,4906189,2695936,1516837,14547832,15520877,5448827,7439006,7331711,5420151,17391089,750550,185451,6615864,2916517,8609183,7978458,11609823,4563795,23166531,4104096,7108637,5322354,3591494,4306154,1745679,6182595,6927042,312003,2155662,8033033,962192,1133017,10116972,4658249,290671,43372376,5543004,659637,3989503,1570285,9207208,805644,12431988,13881973,5201,5143325,2629202,12837622,787130,3298077,8136612,3920507,4754740,4897568,5655653,714401,1807306,10745997,4690504,18783023,11604218,14597109,2180274,2831116,1059970,2069390,16299690,3603670,9649330,8244838,3213811,4063971,13165713,5218808,12970013,6812126,15489819"}
{"url": "https://www.bbc.com/somali/articles/cr43zq6kp5yo", "title": "Jacayl ka bilowday xabsi: Sida nin Muslim ah oo reer Afgaanistaan ah  u guursaday haweeney Yuhuudi ah", "text": "Xigashada Sawirka, Sammi Cannold\nMarkii Kabul ay gacanta u gashay Taliban bishii Agoosto 2021, adduunku wuxuu arkay sawirro muujinaya jahawareerka ay dadka Afgaanistaan ku jireen iyagoo ku soo daadanaya garoonka diyaaradaha,  si degdeg ahna u isku dayaya inay baxsadaan.\nWashington D.C., caasimadda Maraykanka, nin hore uga tirsanaa ciidamada badda oo lagu magacaabo Safi Rauf ayaa bilaabay hawl uu isagu gaar u qaaday: inuu caawiyo asxaabtiisii iyo dadka uu la shaqayn jiray ee ku xanniban Afgaanistaan.\nMarnaba ma uusan filayn in intii uu ku jiray hawshaas badbaadinta nolosha uu la kulmi doono jacaylkiisa noloshiisa, isla markaana isagoo Muslim ah uu jeclaan doono haweeney Yuhuudi ah oo diinteeda iyo nolosheedu si weyn uga duwanyihiin tiisa.\n\"Waan yara ka labalabeeyay ka hor inta aan caawin qofkii ugu horreeyay,\" ayuu xasuustaa. \"Laakiin taas ayaa wax walba i beddeshay. Markaas ka dib waxaan caawiyay qof kale, dabadeedna qof kale.\nSi lama filaan ah ayay arrintu isugu beddeshay hawl ballaadhan annagoo caawinayna boqolaal qof oo ku sugan Afgaanistaan iyo tiro badan oo annaga naga mid ah oo Washington joogtaa.\"\nEnd of Ugu akhris badan\nXigashada Sawirka, Sammi Cannold\nSafi, oo ku dhashay xero qaxooti ah una soo haajiray Maraykanka isagoo dhalinyaro ah, ayaa isku arkay dhexda hawl samatabbixin ah oo aad u adag.\nXaaladdaas adag gudaheeda ayuu la kulmay Sammi Cannold  oo ah agaasime masraxeed ka shaqeysa magaalada New York, taasoo si degdeg ah u isku dayaysay in la soo saaro saaxiib qoyskeeda ah oo ku xanniban Kabul.\nXigashada Sawirka, Sammi Cannold\n\"Aniga gebi ahaanba ma aqoon cidna,\" ayay tidhi Sammi. \"Markaas ayaan daawaday barnaamij gaar ah oo telefishin ah oo ka warramaya Safi iyo kooxdiisa. Waxaan u diray farriin qoraal ah anigoo waydiinaya inuu i caawin karo. Wuxuuna iigu jawaabay in waxa ugu habboon ay tahay inaan tago Washington oo aan ku biiro kooxdiisa is xilqaamayaasha ah.\"\nMarkaas ayay buuxsatay boorsooyinkeeda, raacday tareen una safartay magaalada Washington D.C., iyadoo si toos ah u gashay xarunta hawlgalka oo ay ka buuxeen rag badankood ahaa askar hore. \"Anigu waxaan ku noolaa jahawareerka masraxa,\" ayay tiri iyadoo qosleysa. \"Tani waxay ahayd isbeddel weyn oo lama filaan ah.\"\nSammi waxba kama aysan aqoon Afgaanistaan, balse waxay lahayd xirfado mid degdeg ah ka dhigtay qof aan laga maarmi karin.\n\"Waxaan horay ugu baranay shaqooyin la xidhiidha waraaqaha xogta kombiyuutarka iyo isgaadhsiinta,\" ayay tidhi. \"Markaas ayaan noqday sarkaalka isgaadhsiinta ah.\"\nXigashada Sawirka, Safi Rauf\nInkasta oo ay jireen xaalad degdeg ah iyo jahawareer ka jiray xarunta hawlgalka, haddana arrin kale ayaa si tartiib ah u socotay.\n\"Ma jirtay shucuur? Waxaan u maleynayaa in jawaabtu tahay haa,\" ayay tidhi Sammi. Waxay xasuusatay inay fiirisay da'da Safi bog internet ah si ay u ogaato haddii \"uu ku habboon yahay in dookheeda uu yahay.\"\n\"Magaca Safi iyo da'diisa ayaan ka raadiyay Google, sababtoo ah shaqadu way daalisay xilligaas, wuxuuna u ekaa da' weyn marka la barbar dhigo sida uu hadda u egyahay,\" ayay raacisay.\nSocodkoodii dheer ee ugu horreeyay wuxuu dhacay abbaaro saddexdii habeenimo, iyagoo sugaya dadkii laga daadgureynayay inay ka gudbaan barta hubinta ee Taliban. Waxay ku wareegeen taallooyinka magaalada Washington ilaa ay ka gaareen Lincoln Memorial.\nXigashada Sawirka, Getty Images\n\"Waxay u muuqatay sidii filim,\" ayay tidhi Sammi. \"Markaas ayaan bilaabay inaan isweyddiiyo: ma ninkaan baa aan guursan karaa?\"\nMarkii dambe ayay mar kale kulmeen, waxayna halkaas ku wadaageen dhunkashadoodii ugu horreysay, iyagoo taagan hareeraha waddada, hadlaya oo dareemaya isku soo dhowaansho xooggan.\nXigashada Sawirka, Sammi Cannold\nSafi wuxuu yidhii, \"Sammi waxay mar walba igu oran jirtay goormaad i geyneysaa guriga waalidkaa.\"\nLaakiin Safi iyo qoyskiisu waa Muslimiin, halka Sammi ay tahay Yuhuudi. Si kastaba ha ahaatee, jacaylkoodu wuu sii xoogaystay.\nXigashada Sawirka, Andy Henderson\nSi kooban haddaan u dhigo, Safi si dhab ah ayuu jacayl ugu dhacay,\" ayay tidhi Sammi. \"Wuxuuna aad u xiiseeyaa muusigga gaar ahaan qaabka heesaha Les Misérables, oo ah meel aan aniguna aad ugu xeeldheerahay.\"\nXigashada Sawirka, Sammi Cannold\nBishii Diseembar 2021, Safi wuxuu u safray Kabul si uu uga qaybqaato howlaha gargaarka bini'aadantinimo isaga iyo walaalkiis. Inkasta oo loo digay inuusan tagin, Safi wuu ku adkeystay, isagoo sheegay in Amnesty International ay u ballanqaadday inay ka difaaceyso waxyeellada Taliban.\nLaakiin maalintii ay ahayd inay dhammaystiraan hawshaas, Taliban ayaa qabatay Safi, walaalkiis, iyo shan ajnabi oo kale.\n\"Markii hore way na kala saareen, anigana meel gaar ah ayay i geeyeen qol yar oo aan ka badnayn lix lix feet dherer iyo ballacba. Ma jirin daaqad, mana jirin sariir,\" ayuu yiri.\nXigashada Sawirka, Sammi Cannold\nDhanka kale, Sammi waxay ku sugnayd New York iyadoo walaac iyo cabsi ku jirta, mar kasta oo ay fiiriso khariidadda Google si ay u ogaato meesha uu joogo. Markasta oo ay eegto, waxay arki jirtay inuu ku sugan yahay xarunta dhexe ee sirdoonka Taliban.\n\"Si fiican uma aqaan magaalada Kabul, balse waan ogaa inuu ku jiro xaalad aad u xun,\" ayay tidhi.\nKa dib dhowr toddobaad, Safi wuxuu ku guuleystay inuu saaxiibo la noqdo mid ka mid ah waardiyayaasha, isagoo si qarsoodi ah u siin jiray lacag si uu u helo fursado kooban oo uu taleefan ugu waco Sammi.\nXigashada Sawirka, Safi Rauf\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, James Gourley / Getty Images\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, Safi Rauf\nXigashada Sawirka, Sammi Cannold\nXigashada Sawirka, Sammi Cannold\nWadahadallada lala galay Taliban waxay qaadatay waqti, laakiin maalintii 70-aad way ogolaadeen inay sii daayaan Safi. Sammi waxay sheegtay in mar ay Taliban ku hanjabeen inay dilaan Safi haddii Mareykanku uusan samayn wixii ay rabaan.\n\"Markaas dambe ayaa naloo sheegay inaan aniga iyo waalidka Safi u safri doonno Qatar maadaama halkaas ay ka socdeen wadaxaajoodyadu.\" Sammi ayaa siisay safar Qatar waxayna halkaas kula kulantay waalidka Safi markii ugu horreysay.\nXigashada Sawirka, Sammi Cannold\nWaxay noloshooda ku sii waddeen Maraykanka, waxay wada degnaayeen guriga isla markaana dabadeedna is guursaday, iyadoo xafladda guurkuna ay isku darsatay dhaqamada Afghanistan iyo Yuhuudda. Martidii xafladda ka soo qayb gashay waxaa ka mid ahaa Afgaan iyo Yuhuudi iyo sidoo kale qaraabo iyo asxaab.\nXigashada Sawirka, Sammi Cannold", "date": "2025-10-25", "scraped_at": "2025-10-29T17:13:28.694417+00:00", "category": "news", "text_hash": "c5246ee8b9ce178aafd17baba9a5fbb6b734b68fa4ea1f7dd80224fac89aadf3", "minhash_signature": "638255,4101254,6920833,4369161,16283563,247256,3738324,7699687,9183325,5452882,671617,2199975,4514682,1630519,3882951,3265610,293816,4944333,3779146,12318857,241448,1860416,1889509,4436629,4222622,4198466,4860242,8939627,8979708,2222076,1459866,613726,685149,5433044,732938,3108809,1426073,1220546,2772879,536019,2498503,5673898,495068,1453437,352200,3657723,1942562,1790540,6949463,2723702,8371475,3212322,165134,1566301,5888680,3755336,3378639,6711568,3551765,4832158,14907115,523835,23246171,4481602,7475968,10924757,5507912,919376,25091574,28391159,1979039,4859227,798224,8832151,2148399,1155802,5293469,365441,985293,790787,3769,1418664,5884571,2900986,1654717,1289640,58909,1312149,8997239,5880364,8574602,1633072,2177913,1441607,2679830,1307694,527261,4715428,520680,1452042,10885500,8400362,36393,3061024,8412982,26946277,2997385,4392986,3135102,524974,2873140,10568024,3021211,9466704,759821,450510,5646661,3111015,117725,717998,7359590,607030,3626894,9566767,6768113,433084,1539892,2934252"}
{"url": "https://www.bbc.com/somali/articles/cx24g5kzgqjo", "title": "Dhegeyso: Mid ka mid ah dadkii ka badbaaday shilkii Shinniile oo BBC la hadlay", "text": "Shil tareen oo ka dhacay degmada Shinniile ee gobolka Siti ee deegaanka Soomaalida, dalka Itoobiya ayaa galaaftay nolosha tobneeyo qof oo ku safrayay waddada tareenka ee isku xidha Jabuuti iyo Diridhabe. Waxaa jira iyaguna dad kale oo ay dhawaacyo soo gaadheen.\nXasan Jaamac Buux oo ka mid ahaa rakaabkii saarnaa tareenkaasi isla markaana ka mid ah dadka ka badbaaday dhacdadaas ayaa sidii ay wax u dhaceen uga warramay BBC-da.\nLifaaqa kore ka dhegeyso:\nXigashada Sawirka, SRTV", "date": "2025-10-22", "scraped_at": "2025-10-29T17:15:28.591677+00:00", "category": "news", "text_hash": "85880dca06d5e17f1cea26e2879fb01fe0367c8b3179236b268bb17507927489", "minhash_signature": "12010077,46525397,94424839,40724503,32082721,59747424,804217,5836143,61615648,53956188,267529953,24038663,110112178,112653700,38543932,50900922,36240405,14603128,73117709,21378387,78584005,1854627,33187100,1930356,76189429,33560968,57363831,72572597,51168656,2794013,4042930,24997664,11116041,130871342,9694039,11118129,77207089,276076811,35135393,165735171,54452547,1661466,51475472,47388812,82731579,4892736,201166425,68403321,13315992,44869348,52378580,12169240,11255313,23286506,31852178,111124925,143155002,35319232,92351628,84366150,20558261,102175962,35206762,43394274,4295921,13403345,194229265,40102670,1689362,63120378,6920145,43459086,23151599,5538094,122774026,66774537,6122486,18647518,31662408,9753613,1170567,45508281,140797051,12954665,16682918,207932147,23293503,12693655,190471201,91370402,171134726,29490899,41161769,47460439,75583056,83491826,53282647,3010098,1492760,20881210,2286871,217020102,1878049,2068512,36772685,32661724,265569093,107929284,8450541,34467620,52235314,9547521,16093390,58839527,38990774,71432584,55325458,74188543,208354362,89326251,44452309,14708282,75277913,87326764,11462434,7627685,35316672,17774044"}
{"url": "https://www.bbc.com/somali/articles/cm2nmmmvlr4o", "title": "Najma Nashaad oo ka hadashay \"quruxdeeda dabiiciga ah ee dadku ku tilmaamaan iyo tan codkeeda\"", "text": "Xigashada Sawirka, Social\nNajma Cabdinaasir Ciise oo loo garan ogyahay Najma Nashaad waxa ay ka mid tahay fanaaniinta Soomaaliyeed ee sida weyn u soo shaac baxay sanadihii dambe.\nWaa fanaanad ay dad badani aad u jecel yihiin marka ay noqoto codkeeda, muuqaallada heeseheeda iyo waliba qurux dabiici ah oo dadku ku tilmaamaan.\nHeesaha ay qaaddo oo u badan jacayl ayaa la arkaa in dhallinyaro badani ay aad ula dhacsan yihiin marka laga eegayo dhinaca baraha bulshada.\nNajma Nashaad taageerayaasheedu waa kuwo kaliya ka garanaya shaashadaha weliba xilliga ay heeseyso, balse waxaa jirta taariikh nololeed iyo waxyaabo xasuus u leh nolosheeda oo aysan dad badani wax badan ka ogeyn.\nNashaad oo wareysi kooban siisay BBC-da goor sii horreysay ayaa sheegtay in ay ku dhalatay magaalada Nairobi ee dalka Kenya, oo ay ku barbaartay magaalada Galkacyo dhinaca Puntland, halka sidoo kale ay nolosheeda in badan oo ka mid ah ku qaadatay magaalada Hargeysa ee Somaliland.\nEnd of Ugu akhris badan\n“Anigu waxa aan ku dhashay dalka Kenya taas oo aysan dad badani ogeyn, waxa aan ku barbaaray magaalada galkacyo, waxaana ku noolahay magaalada Hargeysa, runtii si kale marka loo dhigo waxa aan oran karaa waxa aan ahay Soomaali Sujuu Soomaaliya ku koray”.\n“Dad badan waan ka taariikh ficanahay oo marba haddii aan Kenya ku dhashay, Galkacyana ku koray oo aan cabay biyihii Bardcad Hargeysa harwanaagna aan ku koray dee dabcan taariikhba iima harin”, ayey sii raacisay Najma Nashaad.\nNashaad oo sidoo kale mar wax laga weydiiyay quruxda iyo soo jiidashada gaarka ah ee dadku tilmaamaan ayey arrintaasi uga jawaabtay qaab uu kaftan ku dheehan yahay.\nXigashada Sawirka, Facebook/Najma\n“Marka ay noqoto quruxdayda iyo waxa ay dadku iga yiraahdaan, runtii waxa ay ka mid tahay hadallada igusoo noq-noqda, laakiin anigu marka aan is qiimeeyay dee dadka ayaan la mid ahay, iima muuqdaan wax gaar ah”, ayey tiri.\nWaxa ay sheegtay in qof kasta oo uu ilaahay dhameystiray lixaadkiisa uu qurux badan yahay, dadka sida gaarka ah, “dadka ugu sii fiirsada ee weliba ku yiraahda ma qurux badnid dabcan iyaga ayey wax ka qaldan yihiin” ayey sii raacisay.\nWixii ugu farxadda badnaa ee ay dunida kula kulantay ayey ku tilmaantey maalintii ay hooyo noqotay, isla markaana uu u dhashay wiilkeeda curadka ah.\nNajma Nashaad waa ooridii hore ee fanaan Cawaale Dayr oo wiilkeeda aabbihii ah iyaga oo mar si wadajir ah u soo wada shaac baxay.\nHeesaha ugu caansan ee qaadday waxaa kamid ah heesta halku dhiggeedu yahay ‘Arki maysid’ oo uu sameeyay abwaan Cabdiraxmaan Xaaji, laxankana uu ku laray Cabaas Hiraad.\nErayada heesta waxaa kamid ah:\nArki maysid ilamadan qubi jiriyo oohintaydii\nArki maysid kalsoonidii ambatiyo aaminkaygiiye\nArki maysid ammaantaydii hore iyo ololahaygiiye\nArki maysid intaan oran jiriyo erayadaydiiye!\nArki maysid ogaalkaad lumisay iyo ilaalintaydee\nMana arkaysid xiskii oofin jiray amarradaadiiye!.\nXigashada Sawirka, Facebook/Najma\nHeestaasi waxaa barta Youtube ka daawaday ku dhawaad 17 milyan oo qof iyadoo muuqaalka heesta uu muujinayo jilliin ka turjumaya erayada.\nNajma ayaa jacayl u qaadday wiil dhallinyaro ah oo wajigiisa laga dheehan karo duruuf fara badan, halka iyadu ay ka soo jeeddo qoys ladan.\nUgu dambeyn wiilka ayey is guursanayaan, waxa ayna ku noolaaneysaa guri ay ka muuqato duruufta wiilka ay is calmadeen, waxaase jirta in qoyskeedu ay dayriyeen welibana aabeheed uu dhowr jeer u gacan qaaday intii aysan wiilka is guursan si ay u kala uga harto.\nUgu dambeyn ninka ay nolosheedii ladneyd uga soo tagtay ayaa noqonaya mid dayacay oo aysan ka helin wax farxad ah sidaana waxa ay ugu soo noqneysaa reerkii ay ka dhalatay, waana tan ka turjumeysa heeska ‘Arki maysid’.\nXilligii ay fanka ku soo biirtay Najma waxa ay sheegtay in ay cajiib u ahayd marka ay dad khabiirro dhanka fanka ah ay ku yiraahdaan alleyhe waad soconeysaa oo meel sare gaarsii fankaaga sida ay iyaduba sheegtay.", "date": "2024-09-08", "scraped_at": "2025-10-29T17:16:30.318033+00:00", "category": "news", "text_hash": "991a3ead31e80496fc6573f93cd5f90abd8ff541909c60bdf9191033ee8234ef", "minhash_signature": "130188,10742106,3488264,26138997,6521443,4916641,6575592,9864872,24998282,4924119,13053363,11071399,150718,15036481,19252706,3803669,6869728,5881526,19473435,7921330,14518068,3705878,6265838,11972366,6534558,2854113,12515247,30786134,18708941,9875576,7022372,1450365,1961717,2288703,3293915,30363715,1889077,975983,4314375,495470,7040484,18778282,5917721,7567422,5853134,3657682,16063348,22324637,4848575,17499711,2319668,3334150,1628586,13322181,487734,562777,15244412,14238935,9589382,1275464,592502,11125538,6179065,8848575,7386874,1990410,572695,2174218,14492640,1264138,21510662,10239778,921971,4401622,7550111,338801,2277904,17887391,2569988,5941271,17325804,3294866,1875342,4703720,1752510,2154769,136220,11261198,12777401,10760494,9163378,1553562,11817528,339417,12078152,4251178,7803453,2838471,1492760,39316139,3035741,19617668,21635,2103354,2378088,32195551,2316965,14917279,7096251,1756984,3159476,2671938,13010432,4582949,4852094,6852417,4609504,4243821,264880,8341678,5861593,902115,3966745,655819,1249614,5185850,3772393,4534076"}
{"url": "https://www.bbc.com/somali/articles/c0l7zjn5r7eo", "title": "Aabaha qoyskii dhawaan lagu laayey Galgaduud oo oo saluugsan xukunka maxkamadda", "text": "Xigashada Sawirka, Baraha Bulshada\nAxmed Maxamuud Canshuur oo ah aabaha qoyskii dhowaan lagu laayay Gobolka Galgaduud, gaar ahaan seddex gabdhood oo uu dhalay iyo hooyadood  ayaa BBCda u sheegay in uu kasoo hor jeedo isla markaasina aanu qaadaneyn xukun ay dhawaan ridday maxakamadda gobolka Galgaduud kaas oo la xiriira rag loo soo qabtay dembigaas, isagoo sheegay in sida xukunka loo riday uu madmadow ku jiray.\nMaxkamadda Gobolka Galgaduud oo xukunka soo saartay ayaa sheegtay in aan la helin caddeymo dhab ah oo muujinaya in eedeysanayaasha ay geeysteen dembigaas waxaana ay dhanka kale ku xukuntay eedeeysanayaasha kala ah, Cabdi Cismaan iyo Gallad Axmed Xuseen tacsiir shan sano xabsi ah, halka Ayuub Maxamed Cabdi lagu xukumay saddex sano.\nMaxkamadda ayaa sheegtay in ciddii aan ku qanacsaneyn xukunka maxkadda ay u furantahay Racfaan muddo soddon maalmood ah.\nHaddaba aabaha qoyska ayaa BBCda uga warramay dareenkiisa iyo waxa uu ku diidanyahay xukunka, isagoo marka hore ka hadlaya dareenkiisa ayuu sheegay  in warka ah in la dilay qoyskiisa uu soo gaaray habeen saq dhexe ah  oo la hurdo isagoo jiifa meel seddex Kiloomitir u jirta xaafadda uu xabdda ka maqlay meel ku aadan xaafadda ay deganaayeen qoyskiisu kadibna markii uu xaafadda yimid u arkay dadkii xaafadda joogay ,qoyskiisa oo dhintay oo rasaas lala dhacay .\nAxmed Maxamuud Canshuur waxa u sheegy in arintaasi ay ahayd arrin fool xun oo aan ku wanaagsaneyn dhaqanka Soomaaliyeed iyo diinta Islaamka ahna wax lala yaabo. Dadka dhintay ayuu ku sheegay in ay ahaayeen afar qof sedex qof iyo hooyadood, kuwaas oo kala ah Sahar Cartan Xirsi oo hooyada ah, Nuurta Axmed Maxamuud, Xaawo Axmed Maxamuud, iyo Faa'iso Axmed Maxamuud oo gabdhahiisa ah.\nEnd of Ugu akhris badan\nMar la weeydiiyay aabaha in ragga ay dowladdu u soo qabatay dilka in uu wax aqoon ah u lahaa iyo in kale, waxa uu yiri \" haa marka hore deris baan ahayn, dad aan is naqaan ayey ahaayeen\" isagoo sheegay in dadkaasi lagu soo qabtay caddeymo ay dowladdu dhexdooda ka heshay.\nAxmed waxa uu sheegay in dowladdu u yeertay oo ay ku tiri raggii u eedeeysanaa dilka qoyska in maxkamad la saarayo sidaasna uu ku yimid maxkamadda.\nIn kasta oo Maxkamadda Galgaduud ay sheegtay inay dembi ku waysay raggaasi eedeeysanayaasha ah aabaha ayaa misna ku dooday in caddeymihii iyo marqaatiyaashii la keenay maxakamadda aanay suurta gelin in raggaasi lagu xukumo dembiga ah in ay dileen qoyskiisa.\nMar la weydiiyay aabe Axmed sababta ay u suurta geli weysay in raggaasi lagu xukumo in lagu helay dembiga ah in ay iyagu qoyska dileen waxa uu yiri aniga oo maleysanayo in raggaasi la xukumo ayey maxakadu igu tiri \"kitaabkan mar\" dadkaan in ay dadkii qoysakaada dilay yihiin ku dhaaro ama kitaab ayaa ayaga lamarsiinayaa ka dibna  iridda ka bax\".\nXigashada Sawirka, Facebook\nAabaha ayaa ku doodaya in arintaasi aanay xaq ahayn isagoo intaa ku daray dadkiisa in la dilay inay caddahay, dadkii dilayna ay ku caddaatay isagana aan dhaar xaq loogu lahayn.\nWaxa uu ku dooday in caddeymo sax ah la keenay maxkamadda sida marqaatiyaal, dadkii aasay qoyska, fuuqa ama qarashka rasaasta la riday ee dadka lagu laayey  oo aan soo qaaday buu yiri kadib markii ay dowladdu ii dirtay, dabadeedna waa la isku fiiriyay buu  yiri waana is lahaadeen\" intaas oo caddeyn ah markii lasoo maray oo wax lagu qaadan karo, waa ay suurta geli weysay in raggaasi sharciga la mariyo ayuu yiri aabaha qoyska.\nMar la weeydiiay Axmed maadaama uu caddeymahaas uu hubo sababta uu ugu dhaaran waayey Maxkamada in raggaasi ay dilka geeysteen waxa uu sheegay in aanu isagu dhaar lahayn isagaoo sheegay in sababta uu ugu dhaaran waayey ay tahay in la yiri waxa aad leedahay diyo \"dadkaasina waa ay ii caddaayeen in ay dadkeyga laayeen, iyadoo la igu yiri in markii aad dhaartana diyo ayaad leedahay\".\nAxmed waxa uu sheegay in arinkaasi aanu weli dhamaan oo uu taagan yahay, isagoo sheegay in dowladda  gaar ahaan madaxweynaha Galmudug uu arinkan dib eegis ku sameeyo.\nAxmed waxa uu sheegay in aanu diyaar u ahayn in uu isagu dad islaameed uu dilo dembigii lagu sameeyay dadkiisa oo inuu sidaasi sameeyo aanu diyaar u ahayn \"nin muslim ah ayaan ahay, xoog iyo xumaan wax ku dooni maayo\" ayuu yiri Axmed oo intaas ku daray in dowladiina ay wax u qaban weysay, dad islaam ah in u dhibaateeyana aanu diyaar u ahayn sidaas darteed uu gurigiisa iska aadayo.\nWaxa aan isku daynay in aan xiriir la sameeyno maamulka maxkamada Galgaduud si aan wax uga weeydiino eedaahaasi loo jeediyay hasa yeeshee nooma suuro gelin in aan helno.", "date": "2025-10-20", "scraped_at": "2025-10-29T17:17:29.032164+00:00", "category": "news", "text_hash": "c9a14f8ebded0e409993bd7412c931b3f1e0281430f93ca7b70d1ee5d830a433", "minhash_signature": "4802811,2122211,10138177,12824210,8016811,972279,3442114,3497272,15609604,8498114,2229113,2684664,8368725,1750036,545858,21211890,4334407,2771514,1127657,7025773,19742218,363663,2436370,810653,1497576,653739,5157897,11987840,1218788,5383420,308737,7648307,404062,2780819,4170277,7258268,2557194,1394788,8882451,8880263,1458724,88947,2842580,844615,8099829,7884442,17740530,2960501,1849122,2724475,1192147,23752801,11470484,285825,12775283,6180154,7520618,5313216,2558758,99036,670172,9966662,12927855,1402302,26425277,400631,9308627,18602416,1689362,6263986,3374125,5145992,2045768,6234316,5841451,1626423,5614528,1232779,3921600,4028739,13523191,9694641,794348,3056092,10418084,13985024,2059044,8702736,8245005,3935221,92055,868741,16345494,12485721,6377710,563398,2172701,8878816,19914184,5746052,7357062,6579145,18189777,345766,13417080,4592065,3736599,16653834,2431800,10499830,25846833,14766619,162097,8483451,522204,21082987,14796799,7373,1093992,36829874,490303,20459306,7968521,3448380,2688208,4199596,5642027,481562"}
{"url": "https://www.bbc.com/somali/articles/cy687613j13o", "title": "BIRI-MA-GEYDO - Waa kuwee dadka dilka ka caaggan", "text": "Waxaa soo badanaya dilalka loo geysanayo dadka ku suntan nabadda iyo samafalka oo waayadii hore aan lagu degdegi jirin xasaanadda ay huwan yihiin awgeed.\nDadkan dilka ka caaggan oo loo yaqaan BIRI-MA-GEYDO ayaa isugu jira shakhsiyaad haldoor ah oo bulshada ugu jira kaalimo muhiim ah iyo kuwo u nugul in la dulmiyo, sidaas darteedna bulshadu xil iska saartay ilaalintooda.\nInkasoo ay adag tahay in la helo tirokoob rasmi ah, haddana waxaa la aaminsan yahay in sannad walba Soomaaliya lagu dilo boqollaal qof oo Biri-ma-geydo ah, kuwaas oo aan helin bedbaadadii ay mudnaayeen.\nDadka dilka ka caaggan ee sannadkaan la beegsaday waxaa ka mid ah, foolaadka bulshada iyo 'maato ilmadow' ah oo badankood loo dilay aano qabiil ama ujeeddooyin kale oo aysan mudneyn.\nXigashada Sawirka, Social\nDadka aysan birtu gayin waxaa loo kala saaraa 2 kooxood oo kala ah Biri-ma-geydo joogto ah oo xilli kasta ka caagan in aano loo dilo iyo kuwo xasaanadoodu ku kooban wakhti cayimin.\nEnd of Ugu akhris badan\nBiri-ma-geydada joogto\nHaweenka\nCarruurta\nCulimada diinta\nFarriin sidayaasha\nHoggaanka dhaqanka\nNaafada iyo dadka baahiyaha gaarka ah qaba\nDadka laga tirada badan yahay.\nBiri-ma-geydada wakhtiyeysan\nErgada nabaddoonka ah\nWaayeelka\nDhaawaca\nMaganta\nMusaafirka khabaar moogga ah\nMaxaabiista dagaalka\nXirfadleyaasha dadweynaha u adeega, sida macallimiinta iyo dhakhaatiirta IWM.\nSoomaalidu waxay leedahay xeerar soo jireen ah oo qeexaya xiriirka ka dhexeeya bulshooyinka danwadaagta ah iyo sida loo maareynayo xaaladaha ku xeeran noloshooda. Xeerarkaas waxaa ka mid ah mid xeerinaya badbaadada dadka loo yaqaan Biri-ma-geyda, gaar ahaan xilliyada colaaddahu jiraan.\nHaddaba Abwaan Cali-Deeq Maxamed Xaashi oo aqoon durugsan u leh Dhaqanka Soomaalida ayaa BBC-da uga warramay sababihii keenay in la dajiyo Xeerar Biri-ma-geyda, kuwaasoo ay dejiyeen odayaal hore, ilaa haddana lagu dhaqmo.\n“Xeerka Biri-ma-geydadu wuxuu si cad u qeexayaa dhaqamada ka reebban dhinacyada diriraya, gaar ahaan in aan la iska dilin dadka bulshada waxtarka u leh iyo kuwa nugul.\nUjeeddooyinka laga lahaa sameynta xeerkan way badnaayeen waxaanse ku soo koobayaa 7 qodob oo ku qotomay aragti fog, ku waas oo looga jeedey in looga gaashaanto mahadhooyinka ka dhalan kara dagaallada sokeeye, sida:\nIn la yeesho kala-har, oo dhinacyada colka ah aysan isku talaxtagin, jirtoo dagaalka ay nabadi ka danbayn doonto.\nIn dagaalka aan lagu dilin qof dhinacyada dirirsan iyo ummadda oo dhanba wada anfici kara.\nIn colaaddu aysan sii daba-dheeraan.\nIn dagaalku uusan reebin cadaawad iyo uur-ku-taallo aayaha ma-hadho ku noqda isma-hurtada markaas colka ah.\nIn aan la dilin qof markaas aan halis ku ahayn nolosha qof kale.\nIn aan la galabsan ciribxumada nabsiga iyo habaarka ka yimaadda xeergudubka dagaalka.\nIn la dhawro sharafta beesha oo aan magac xumo loo soo jiidin”.\nXeerka Biri-ma-geydadu wuxuu Soomaalidii hore uga dhignaa digniin ku lammaan hormuudka beelaha dirirtu ka dhexayso, ku waas oo abbaanduulayaashooda kula dardaarmi jirey in aysan xeerka ka tillaabsan.\nTusaale waxaa noogu filan tuducdan soo socota oo Abwaan Jimcaale Jaamac Lugey oo noolaa qarnigii tagey uu sida muuqata kula dardaarmayo col duulaan u geyfan. Wuxuuna asagoo ciidanka garansiinaya habdhaqanka goobta dagaalka yiri:\nGuluf xoogle Xaashoow haddii, la isku soo xoomo\nXamarray fardood goor haddii, xawli lagu fuulo\nXogtaan qabo xusuus hore haddaan, xarafka kuu sheego\nXarrago lagama tago duul haddaad, xinif wadaagtaane\nInkastoo xumaantay faleen, xiisadda abuurtay\nQofkii xeerku kuu diido waa, laga xishoodaaye\nXidid yaan la dilin iyo ergada, xumaha duugaysa\nXaaskiyo cirroolaha ayaan, xumo la gaarsiinnin\nXarbi haddaad gaashaan maatidana, dib u xannaaneeya.\nXigashada Sawirka, Social\nSida ka muuqata gabayga Jimcaale Jaamac Lugey, ka sokow in aan la dilin biri-ma-geydada, waxaa xil gaar ah la iska saari jirey dadka maatida ah ee lagu dul dagaallamo.  Tusaale ahaan waxaana mamnuuc ahayd in awrta la rarto, lo’da iyo ariga la dhaco ama aqalka iyo agabka reerka la qaato.\nLaakiin maanta iska daa maato la xannaaneeyee, waaba lagu faanaa jarriimooyinka laga galo biri-ma-geydada. Waxaana la arkaa dhakhaatiir, macallimiin iyo samafaleyaal loo dilo aano qabiil, sidaasna ay bulsho dhan oo ku tiirsaneyd ay afka ugu dhacaan. Dad bandanna waxay is weydiinayaan waxa dhaqankii suubanaa dooriyey?\nAbuukar Sheekh Axmed Al-Badri oo ah qoraa u dhuundaloola sooyaalka dhaqanka Soomaalida, wuxuu tixgelin la’aanta xeerka Biri-ma-geydada u aaneynayaa jihawareerka siyaasadda dalka oo saameyn taban ku yeeshay hannaankii dhaqanka oo saldhig u xeerar dhaqameedka.\n“Dadku haddey hoggaan quman waayaan wey muunad beelaan. Waxayna lumiyaan waxyaabo badan oo aasaas u ahaa jiritaankooda ummadeed, sida dhaqanka, caadada, hanka iyo wax walba oo ay ku mideysnaayeen”, ayuu yiri Al-Badri oo intaas ku daray in dowladihii dalka soo maray ay ka gaabiyeen in ay Xeerka Biri-ma-geydada ku daraan sharuucda dalka.\n“Xeerka biri-ma-geydadu wuxuu ka soo unkamay miyaga, halkaas oo bulshadu ku dhaqan ay aqoon durugsan u lahaayeen sharuucda ay degsadeen.\nHaddaba markii magaalooyinka la yimid inta badan xeerarkii dhaqanka waa laga tagey. Waxaana kaalintoodi galay xeerar qalaad oo laga dhaxlay nidaamyadii gumeysiga, ku waas oo meesha ka saaray xeerarkii soo jireenka ahaa oo aan ka soo waaqsan kala-guurkii dhacay”.\nAbuukar Al-Badri oo wax laga weydiiyey sida loo caymin karo xeerarka dhaqanka oo bulshada qiime weyn ugu fadhiya, ayaa hoosta ka xarriiqay baahida loo qabo in xeerarka dhaqanka la dabaqo. Wuxuuna ku taliyey in dib-u-eegis lagu sameeyo hannaanka garsoorka dalka, si Xeerar Dhaqameedka loogu dhafo kuwa madaniga ah.\n“Xeerku wuxuu xeer ku yahay in la dhaqangeliyo oo dugsiyada lagu dhigto. Haddiise laga maarmo sida nagu dhacday, waxaa lumaya qiimaha uu bulshada ugu fadhiyo, illaa uu ugu dambeynta ka suuro xasuusta.  Si haddaba loo xaqiijiyo in aan lagu tuman xeerka, waxaa lamahuraan ah in dalka oo dhan laga dhaqangeliyo Xeer Soomaaliga, iyadoo lagu dhafayo sharuucda dalka”.\nIsku soo duuboo, inta badan dadka dilkooda la xarrimay ee ku xusan Xeerka Biri-ma-geydada waxay sidoo kale xasaanad buuxda ku leeyihiin sharuucda caalamiga ah ee la xeeriyo xilliyada dagaalka.\nTusaale ahaan Axdiga Geneva oo la qoray 1949-kii, waxaa ku jira qayb ka hadlaysa xeerka dagaalka ee la tixgeliyo xilliyada colaadaha, kaas lagu tilmaamay mid ka mid ah guulihii ugu waaweynaa ee la gaarey qarnigii la soo dhaafay.\nHaddaba in Soomaalidu leedahay xeer dammaanad qaadaya badbaadada dadka nugul iyo haldoorka bulshada xilliyada dagaalka, kaas oo beelaha Soomaaliyeed muddo dheer ku soo dhaqmayeen, waxay muujinayaa dhaqan suubban oo mudan in la joogteeyo.", "date": "2025-10-21", "scraped_at": "2025-10-29T17:18:29.656855+00:00", "category": "news", "text_hash": "c8a58f508e1b1716cc7f85add0fcd2a55eab7faef0e33dbc2f25fbdd0351ee0e", "minhash_signature": "15820797,1133190,3635423,1430746,1690632,6129436,3300432,4778124,5968805,3472447,1623230,926569,2350836,347627,6815272,1058296,854270,1243630,7577893,18289365,3218123,2510608,165294,3070577,716677,13665540,2895986,750008,7046838,2599393,2749934,5307650,41921,2505285,4929674,6837111,1433501,5411130,732381,11965572,9958245,3808726,4569335,1123859,3072059,271670,2775935,982580,3967856,5810656,16868659,4072188,473883,2561912,152358,3904984,986952,3344899,2134754,3962422,1598608,3115770,3435504,1379024,5125784,8209362,4109229,2614445,4783603,3151821,3336321,6459787,2457756,4132828,2225792,12913112,2765627,792164,5182844,147092,1071169,666690,4482665,6826621,870042,3935493,997942,7038,4852317,4759786,8768150,4586581,15474367,3453077,2428841,2913523,1993149,3150458,872890,5557542,417367,7103159,2001689,5670,1727021,630727,591463,1120177,5069770,2672926,1566004,730852,5609698,1028065,830370,4972025,211232,2149330,3777520,188075,6627779,3307760,5935017,1646438,9677013,656863,3571176,3006849"}
{"url": "https://www.bbc.com/somali/articles/cq8e311qdyzo", "title": "Sidee Ousmane Dembélé u muujiyey inuu istaahilo abaalmarinta Ballon d'Or", "text": "Xigashada Sawirka, Getty Images\nXiddiga kooxda Paris St-Germain ee Ousmane Dembele ayaa markii ugu horraysay ku guulaystay abaal marinta Ballon d'Or ka dib markii ay kooxdaas saddexda koob ee France ku guulaysatay ay sidoo kale cayaaryahanno dhowr ah oo ka mid ah ay heleen abaal marino dhawr ah xaflad ka dhacday magaalada Paris.\n28-sano jirkaan weerarka ka ciyaara ee reer France ayaa dhaliyay 35 gool, waxaana uu sameeyay 14 caawin 53 kulan oo uu u saftay PSG xilli ciyaareedkii hore isagoo kula guuleystay kooxda horyaalka Champions League, horyaalka faransiiska iyo Koobka French cup.\nWaxa uu ahaa gooldhaliyaha ugu sareeya horyaalka Ligue 1, isagoo dhaliyay 21 gool, waxaana loo magacaabay ciyaaryahanka ugu sarreeya horyaalka Faransiiska iyo Champions League.\nWaxa uu sidoo kale ka caawiyay PSG finalka koobka kooxaha adduunka oo ay guuldarro ka soo gaartay Chelsea, cayaar ka dhacday New Jersey.\nDembele, oo abaal-marintan uga guulaystay da'yarka Barcelona ee Lamine Yamal, ayaa ka qayb galay xafladda ka dhacday Paris, isagoo ilmeeyay markii uu masraxa taagnaa – inkastoo ay kooxdiisu ciyaareysay fiidnimadii Isniinta.\nEnd of Ugu akhris badan\nWeeraryahanka ayaa haatan dhaawac ku maqan, taasoo la micno ah inuu seegay guuldaradii 1-0 ee PSG ka soo gaartay Marseille kulan wax ka beddel lagu sameeyay duufaan dhacaysay darteed.\n\"Waxa aan hadda la kulmay waa wax aan caadi ahayn, wax eray ah uma hayo, waxa ku dhacay PSG\" ayuu yiri Dembele oo isagoo qiiroonaya ay hooyadiis kula soo biirtay masraxa.\n\"Waan yara walaacsanahay, ma fududa inaan ku guuleysto koobkaan, iyo in uu I gudoonsiiyo Ronaldinho oo ah halyeey kubada cagta ah, waa wax aan caadi aheyn.\n\"Waxaan rabaa inaan u mahadceliyo PSG oo ii timid 2023. Waa qoys cajiib ah, madaxweyne Nasser [Al-Khelaifi] wuxuu ii yahay aabe oo kale, waxaan sidoo kale rabaa inaan u mahadceliyo dhammaan shaqaalaha iyo tababaraha oo sidii aabbe oo kale ii ah - iyo dhammaan asxaabteyda kooxda.\n\"Waxaan si dhab ah ugu guulaysanay wax walba si wadajir ah, waxaad igu taageerteen wakhtiyadii fiicnaa iyo wakhtiyadii adkaa, koobkan shaqsiga ahi waa mid kooxda oo dhan u ah guul u soo hoyatay\".\nXigashada Sawirka, Getty Images\nDembele wuxuu ka mid noqday tiro cayaartoy Faransiis ah oo abaalmarintan hore ugu guulaysaty waxayna kala yihiin:\nRaymond Kopa – 1958\nMichel Platini – 1983, 1984, 1985\nJean-Pierre Papin – 1991\nZinedine Zidane – 1998\nKarim Benzema – 2022\nOusmane Dembele – 2025\n30ka cayaartoy ee ugu horreeyey tartanka abaalmarinta Ballon d'Or ayaa sidan u kala galay kaalimaha:\n30. Michael Olise\n29. Florian Wirtz\n28. Virgil van Dijk\n27. Declan Rice\n26. Erling Haaland\n25. Denzel Dumfries\n24. Fabian Ruiz\n23. Jude Bellingham\n22. Alexis Mac Allister\n21. Serhou Guirassy\n20. Lautaro Martinez\n19. Joao Neves, Paris Saint-Germain\n18. Scott McTominay, Napoli\n17. Robert Lewndowski, Barcelona\n16. Vinicius Jr, Real Madrid\n15. Viktor Gyokeres, Arsenal\n14. Desire Doue, Paris Saint-Germain\n13. Harry Kane, Bayern Munich\n12. Khvicha Kvaratskhelia, Paris Saint-Germain\n11. Pedri, Barcelona\n10. Nuno Mendes, Paris Saint-Germain\n9. Gianluigi Donnarumma,  Paris Saint-Germain\n8. Cole Palmer, Chelsea\n7. Kylian Mbappe, Real Madrid\n6. Achraf Hakimi, Paris Saint-Germain\n5. Raphinha, Barcelona\n4. Mohamed Salah, Liverpool\n3. Vitinha, Paris Saint-Germain\n2. Lamine Yamal, Barcelona\n1. Ousmane Dembele, Paris Saint-Germain\nMaamulaha PSG Luis Enrique – oo loo magacaabay tababaraha sanadka – ayaa u qalma in lagu amaano abaal marinta Dembele sababtoo ah taatiko uu bedelay bartamihii bishii Disembar.\nWaxa uu Dembele ka soo beddelay baalka midig isagoo keenay booska weerarka dhexe kulankii Lyon 15kii Diseembar, isagoo booskaas  ka dhaliyay kaliya shan gool. 30 gool ayuu u dhaliyay PSG taariikhdaas wixii ka dambeeyay.\nDembele ayaa ugu dambeyntii muujiyay tayo wanaagsan oo ku qancisay Barcelona inay bixiso 96.8 milyan ginni, taasoo laga yaabo inay kor ugu kacdo £135.5m, si ay ugala soo wareegto Borussia Dortmund 2017.\nSi kastaba ha ahaatee, PSG - oo loo magacaabay kooxda sannadka ee abaalmarinta Ballon d'Or 2025 - ayaa ahayd kooxdii cayaartoygaas heshiiska la gashay, iyagoo kula soo wareegay 43.5 milyan oo gini 2023.\nXigashada Sawirka, Getty Images\nDembele ayaa sidoo kale dhaliyay labo gool todobo kulan oo uu u saftay xulka Faransiiska xilli ciyaareedkii 2024-25.\nWaa ciyaaryahankii lixaad ee Faransiis ah ee ku guuleysta abaalmarinta iyo kii labaad ee qarniga 21aad ka dib guushii Karim Benzema ee 2022.\nLamine Yamal oo 18, ayaa ku dhameystay kaalinta labaad - wuxuuna sidoo kale ku guuleysatay abaalmarinta Kopa Trophy ee ciyaaryahankii ugu fiicnaa.\nShan ka mid ah 10-ka ciyaaryahan ee ugu sarreeya ayaa qeyb ka ahaa kooxda PSG xilli ciyaareedkii hore oo ay ku jiraan Vitinha (Saddexaad), Achraf Hakimi (Lixaad), Gianluigi Donnarumma (9) iyo Nuno Mendes (10aad).\nXiddiga Liverpool Mohamed Salah ayaa galay kaalinta 4-aad halka uu 8-aad galay xiddiga Chelsea iyo England ee Cole Palmer.\nKu guuleystihii sannadkii hore, khadka dhexe ee Manchester City iyo Spain, Rodri, ayaan markan soo gelin liiska musharraxiinta ka dib markii uu dhaawacmay.", "date": "2025-09-23", "scraped_at": "2025-10-29T17:19:29.063064+00:00", "category": "news", "text_hash": "9f9e62b518a8cc98f7efc035593d37a569acffc97867e8cb569dd27659e733d3", "minhash_signature": "786773,5309270,4088097,12974691,28839094,5673178,1442412,14060274,17643798,8728356,2436006,2718122,4324616,2799638,5015342,3439530,244852,14723,8326217,28303177,858909,8628754,1240066,4436629,8738433,10517608,7857235,25362080,4846913,7239742,11627372,5140507,3389300,80482,1103589,3959236,1968797,15562689,4811401,4429305,4035812,4139673,4470329,13035402,17392742,2309451,933265,7681210,2405333,3135855,17654290,2853243,5707416,271442,4345059,5493996,571024,7439006,274319,15160915,1972912,999105,14179625,2197575,4796474,208783,2467938,8161903,553330,8766025,16009737,11000648,14953688,15976363,3881345,2038450,1422262,1757173,511983,2609026,2297265,22087994,5535546,9871619,14333735,3024679,976229,8113737,3338034,3428736,6116518,3268456,2169682,3871143,10522374,13595930,14348535,12029936,1492760,356491,5263129,48574964,2458411,800394,1312472,2062015,10818069,6113787,7395801,12422714,3708468,5401405,5272110,530450,3146699,3186463,2155228,7958355,16209465,6902449,6341175,15310030,522826,1167934,1312809,8142710,7176875,10848015"}
{"url": "https://www.bbc.com/somali/articles/cly939n178xo", "title": "Waa kuma Raila Odinga, hoggaamiyihii mucaaradka Kenya ee geeriyooday?", "text": "Xigashada Sawirka, Reuters\nRa'iisul Wasaarihii hore ee Kenya Raila Odinga ayaa ku geeriyooday dalka Hindiya isaga oo ay da'diisu tahay 80 sano.\nRaila ayaa geeriyooday xilli lagu daweynayay isbitaal ku yaalla Hindiya, sida laga soo xigtay ilo qoys.\nOdinga, ayaa ifka kaga tagay xaas iyo saddex caruur ah.\nRaila Amolo Odinga (wuxuu dhashay 7 Janaayo 1945)\nRaila Odinga wuxuu ku dhashay Isbitaalka Maseno Church Missionary Society Hospital, ee Maseno, Degmada Kisumu, ee Gobolka Nyanza 7 Janaayo 1945. Sidoo kale taageerayaashiisu waxayu yaqaaniin Agwambo, waa siyaasi Kenyan caan ka ahaa muddo dheer.\nEnd of Ugu akhris badan\nRaila oo ahaa 80 jir ayaa lagu xasuusan doonaa doorkii uu ka qaatay dib u soo celinta dimuqraadiyadda xisbiyada badan iyo ilaalinta xuquuqda aadanaha ee Kenya.\nWuxuu ahaa Ra'iisul Wasaarihii ugu dambeeyay ee Kenya, Waxaa la doortay 2008, waxa uuna hogaaminayay dawlad wadaag ah 2008 ilaa 2013.\nXigashada Sawirka, AFP/GETTY\nRaila Odinga waxa uu ahaa nin aad uga soo dhex muuqday siyaasadda Kenya iyo Afrika, isaga oo dhiirri galiyay jiil dhan oo qaaradda ah.\nWaxaa uu dhawaan u tartamay xilka gudoomiyaha midowga Afrika oo markii dambe uu ku guuleystay Maxamuud Cali Yuusuf oo ah hadda ah gudoomiyaha midowga Afrika.\nOdinga ayaa shan jeer ku guul darreystay tartanka madaxwaynanimada  Kenya, waxaana ugu dambeysay doorashadii 2022-ka.\nRaila waxaa dhalay madaxweyne ku xigeenkii koobaad ee dalka Kenya, Jaramogi Oginga Odinga.\nIn ka badan 20 sano ayuu xildhibaan ka ahaa xaafadda isku raranta ah ee ugu wayn Afrika ee Kibera.\nMr Odinga waxa uu leeyahay dad aad u jecel, taageerayaashiisuna waxay ku naanaysi jireen \"Baba\" (Aabbaha), \"Agwambo\"  iyo \"Tinga\" (Cagaf) - oo laga soo minguuriyay astaantii xisbigiisa ee doorashadii 1997-kii.\nWaxa uu dib uga soo noqday dalka dibaddiisa ka dib markii ay dib u yagleeleen siyaasadda xisbiyada badan ka hor inta aan loo dooran xildhibaan. Waxa uu door muhiim ah ka ciyaaray soo afjaridda tobanaan sano oo xukunkii xisbiga Kanu ka dib markii uu taageeray Mwai Kibaki oo u tartamayey madaxtinimada 2002dii.\nMarkii ugu horraysay ee uu madaxweynenimo isku dayay waxay ahayd 1997-kii, markaas oo uu galay kaalinta saddexaad.\nOdinga iyo taaageereyaashiisu waxay rumaysan yihiin in laga boobay guushii uu gaaray 2007-dii, markaas oo uu hogaaminayay xisbiga ODM, isaga oo la tartamay Kibaki.\nDoorashadaas ayaana ahayd middii horseedday rabshadihii qabaa'ilka ku salaysnaa ee sababay in ay dhintaan 1,300 oo ruux, ayna ku baro kaceen 600,000.\nXigashada Sawirka, AFP\nWuxuu soo noqday ra'iisul wasaarihii ugu horreeyay ee Kenya, jagadaas oo la abuuray kaddib heshiiskii qaran ee lagu gaaray in la soo afjaro rabshadihii ka dhashay doorashadii 2007-2008, halkaasoo uu dowlad awood qeysi ah uu la dhistay madaxweyne Mwai Kibaki.\nMr Odinga ayaa ah siyaasi caan ku ah dhisidda isbahaysiyada siyaasadda.\nWaxa uu hore u ahaa maxbuus siyaasadeed, waxana uu haystaa rikoorka in uu yahay maxbuuskii ugu muddada dheeraa ee Kenya. Halgankii uu kaga soo horjeeday kalitalisnimada hal xisbi waxa la xiray laba jeer (laga bilaabo 1982 ilaa 1988 iyo 1989 ilaa 1991) intii lagu jiray xukunkii Daniel Arap Moi.\nKadib isku day afgambi oo dhacay kowdii Agoosto ee sanadkii 1982 dii, Raila Odinga waa la xiray waxaana ku dhacay xukunno kala duwan, oo ay ka mid tahay khaa'inul waddannimo oo ah tii loo xiray iyada oo an cadeyn loo hayn.\nGuddiga dib u heshiisiinta iyo cadaaladda dhabta ah ayaa loo sheegay sanadkii 2011 in Odinga uu xariir la lahaa maskaxdii ka dambeysay afgambiga. Odinga mar walba wuu iska diidaa in uu ku lug lahaa afgambiga.\nWaxa uu xirnaa lix sano ka dib markii lagu eedeeyay in uu ku lug lahaa isku daygii afgambi ee 1982-kii, ka dibna mar kale ayaa loo xiray in uu dabada ka riixayo dimoqraadiyad hoos timaada xukunka hal xisbi.", "date": "2025-10-15", "scraped_at": "2025-10-29T17:20:29.280625+00:00", "category": "news", "text_hash": "66cde8d3c82d9a8c20fc6df95f7aeaf727f67da092a226e42c4f449dd2e54009", "minhash_signature": "1601351,20639015,16512379,774370,2478618,14239041,2510378,9760737,3966871,4654051,2357238,637657,2472779,1527237,3494043,1100624,8612212,10774366,3779146,6320346,1991854,2201934,2623630,4565357,36868268,4165458,2960429,34767811,8611214,4839376,10180750,7793402,7414410,4288782,8921410,16276864,12333680,2820412,899403,3175453,6155751,38735864,8369690,10522375,118124,3938675,1406767,5800846,317203,23648615,464913,16683233,6518493,8237146,3364599,9587049,10786584,847300,10223313,5604777,4423078,4495839,25754987,17354743,1262907,1180061,1394607,5582603,778508,9111978,1696064,3089610,293361,16805314,17882958,7231659,6532334,14147160,3913645,3501303,966969,1454270,4450639,999969,9050703,12733841,12614222,4601132,2977499,1638173,2702250,528144,370661,194087,14309372,8116896,9935128,11662337,1227304,4247534,935821,580593,33375090,2787500,640641,2965879,24922192,4849185,1918524,8264880,444848,2231780,1604640,10000258,2260651,7622930,268885,1185210,5060406,15995563,2442449,36238,9093619,7267555,1941164,2646577,4280972,4657579"}
{"url": "https://www.bbc.com/somali/articles/crlzlleprdlo", "title": "Maxey salka ku haysaa booqashada ra'iisul wasaaraha Soomaaliya ee dalka Serbia?", "text": "Xigashada Sawirka, OPM Somalia\nWafdi ka socda dowladda Soomaaliya oo uu hoggaaminayo ra'iisul wasaaraha Soomaaliya Xamse Cabdo Barre ayaa ku sugan dalka Serbia halkaas oo kulan ay wafdigaasi kula yeesheen ra'iisul wasaaraha dalkaas Đuro Macut, iyaga oo ka wada hadlay arrimo dhowr oo ay ka mid yihiin, xoojinta xiriirka iyo iskaashiga labada dal, gaar ahaan dhinacyada ganacsiga, maalgashiga, iyo wada-shaqeynta amniga, waxbarashada iyo caafimaadka.\nWasiirka Arrimaha Dibadda iyo Gaashaandhigga, ayaa ka mid awafdig ara''siul wasarae Xamse.\nQoraal lagu baahiyay barta Facebook ee xafiiska ra'iisul wasaaraha Soomaaliya ayaa lagu yiri: \"Ra'iisul Wasaaruhu waxa uu ku casuumay dowladda iyo ganacsatada Serbia in ay booqdaan Soomaaliya, si loo sii ballaariyo iskaashiga labada dal, loona sahmiyo ilaha ku habboon ee ay maalgashi ku sameyn karaan\".\nLabada dhinac ayaa sheegay in xiriir wanaagsan uu ka dhaxeeyo Soomaaliya iyo Serbiya, isla markaana ay habboontahay in la sii xoojiyo.\nHaddaba booqashadaan iyo waxa ay salka ku hayso ayaan ka waraysanay Safiirka Soomaaliya ee dalkaas  Danjire Maxamed Cabdullaahi Axmed  oo isaga oo caasimadda Serbia ee Belgrade ku sugan khadka Taleefanka ugu warramay Cabdishukri Haybe.\nEnd of Ugu akhris badan", "date": "2025-09-03", "scraped_at": "2025-10-29T17:21:29.108984+00:00", "category": "news", "text_hash": "a3101ba13d7ad95fdc796e160b1f79e1a269ff4441f334c07697e5c583c41f6d", "minhash_signature": "8238805,3469491,24009947,5094570,22958085,88334866,29170214,37547278,6014291,7853452,32051435,2707097,14567205,3334917,883629,41126593,6888633,4159363,25899928,72696572,81970883,10050062,31192708,4094177,1644614,24582345,12770470,8483726,28668725,18267008,15172761,56291366,19687375,148055205,20179848,32991915,30566253,5597215,25614552,7431889,9149304,16353069,3191998,37924125,2221165,864190,12566604,543596,11669029,1114461,1450865,26389814,9320885,4418578,496513,32636580,21172702,20326758,23780047,29927694,8725494,1029914,21098333,16847613,1034137,39706677,11402887,9723213,40405123,63621,3109329,20070428,14953688,37624064,9254663,318632,2994126,25959407,32526720,10947794,7562111,1600170,24958733,13329990,9777982,57189788,3179659,10181609,33447837,15684198,52111798,34728925,7397534,18755866,68538100,18276479,24332982,6582396,6616643,103651953,28032470,410873,17121971,17874966,57026471,53795726,12922586,8960082,9525757,73113124,17429683,30071945,92116101,46573487,28368275,11111401,10098043,19662385,27352784,62543024,5258126,83422151,19216468,19987062,10078978,22696148,32389800,46024012"}
{"url": "https://www.bbc.com/somali/articles/cly937ngje5o", "title": "Maxaa u xal ah jilbo xanuunka?", "text": "Xigashada Sawirka, AFP via Getty Images\nMarka aad gaadho da'da soddomeeyada, waxaa laga yaabaa inaad bilowdo inaad dareento xanuun fudud oo jilbaha ah, si gaar ah marka cimiladu is beddesho, sidoo kale waxaad dareemi kartaa murqaha oo adkaada ama kala bixiddoodu yara dheeraato subaxdii markaad toosto. Mararka qaarkoodna waad ka labalabayn kartaa inaad foorarsato — dhammaan calaamadahan waxay muujinayaan in kala-goysyada jilbahaagu aysan ahay sida ay hore ahaan jireen.\nArrimo ay ka mid yihiin cayilka, difaac-jidhka oo hooseeya, iyo hidde-sidaha ayaa dedejin kara korodhka dhibaatooyinka jilbaha.\nXanuunka jilbaha waa mid ka mid ah dhibaatooyinka ugu badan ee dadka waaweyn la kulmaan, wuxuuna saameeyaa wax walba laga bilaabo socodka ilaa guud ahaan noloshaada.\nDr. Anikar Chhabra, oo ah dhakhtar qalliin lafaha ah oo ka tirsan Mayo Clinic ee magaalada Phoenix, Mareykanka, ayaa sheegay: \"Jilbuhu waa mid ka mid ah kala-goysyada ugu muhiimsan jidhka. Wuxuu xambaarsan yahay culays jidheed gaadhsiisan tallaaboyinka aan qaadayno.\"\nCilmi-baadhisyo ayaa muujinaya in ilaalinta xoogga murqaha ku wareegsan jilbaha ay yarayn karto cadaadiska kala-goysyada iyo xanuunka jilbaha.\nEnd of Ugu akhris badan\nDr. Alexis Colvin, oo ah borofisar ku takhasusay qalliin lafaha oo ka tirsan Icahn Clinic ee Mount Sinai, magaalada New York, ayaa sheegtay in jimicsigu uu hagaajin karo caafimaadka jilbaha.\n\"Jilbaha waxaa ku jira dareere u eg saliidda mishiinka,\" ayay tidhi Colvin. \"Jimicsigu wuxuu kiciyaa soo saarista dareerahaas, taas oo yaraysa qallafsanaanta iyo bararka. Waxa kale oo uu jilbahaaga ka dhigayaa kuwo si fiican u shaqaynaya.\"\nJimicsiga sida oo kale wuxuu xoojiyaa lafaha jilbaha laftiisa, isaga oo yaraynaya halista ah in lafuhu daciifaan ama khafiifaan.\nDr. Chhabra wuxuu sheegay in xoojinta jilbaha ay si gaar ah muhiim ugu tahay dadka waaweyn, sababtoo ah waxay siinaysaa xasilooni murqaha ah oo yaraysa khatarta lafo xanuunka.\nJimicsiyada jilbaha waxay leeyihiin faa'iidooyin kale oo la yaab leh—sida kor u qaadista fikirka, dareenka, iyo awoodda jirka ee lagu garto dhaqdhaqaaqyada iyo meeshay ay taagan yihiin xitaa adiga oon fiirin.\nDr. Colvin waxay sheegtay in ay kula talinayso dadka in ay bilaabaan jimicsiga marka ay gaadhaan soddomeeyada.\nDr. Chhabra wuxuu kugula talinayaa inaad maalin kasta 15 daqiiqo ku bixiso, saddex ilaa afar jeer toddobaadkii, adigoo samaynaya jimicsiyo kala duwan oo jilbaha ah—gaar ahaan kuwa lagu sameyn karo guriga adigoon qalab gaar ah u baahnayn.\nXigashada Sawirka, AFP via Getty Images\nSidoo kale wuxuu kugula talinayaa inaad la tashato tababare si aad u hubiso inaad si sax ah u samaynayso. Halkan waxaa ku yaal qaar ka mid ah jimicsiyada muhiimka ah ee lagu sameeyo guriga:\nBooditaanka raha (Jumping Frogs): Jimicsiyadani waxay xoojiyaan jilbaha, yareeyaan xanuunka, waxayna hagaajiyaan tayada nolosha dadka qaba xanuunka jilbaha.\nCilmi-baaris ayaa muujisay in haddii si sax ah loo sameeyo, aysan jirin halis dhaawac ah, hase yeeshee Dr. Chhabra wuxuu sheegay in haddii si khaldan loo sameeyo ay dhaawici karaan jilbaha.\nKor u qaadista Lugta (Leg Raises): Jimicsigan wuxuu ku lug leeyahay inaad jiifto, adigoo mid ka mid ah jilbaha laabayo, kan kalena toosinayo oo kor u qaadayo dhowr ilbidhiqsi, kadibna si tartiib ah u dhigayo.\nCilmi-baaris ayaa muujisay in kor u qaadista lugta keliya ay xoojiso murqaha jilbaha, isla markaana yareyso khatarta dhaawacyada la xiriira jimicsiga.\nDr. Chhabra wuxuu sidoo kale soo jeediyay jimicsi kale oo xoojinaya murqaha: \"Istaag faraha cagahaaga, si tartiib ah kor ugu qaad ciribta adigoo jilbaha toosinaya, hal ilbidhiqsi hayso, kadibna si tartiib ah u dhig.\"\nGuud ahaan, waqtiga aad ku bixiso jimicsiyada xoojinaya jilbaha waa maalgashi muhiim ah oo kor u qaadaya caafimaadkaaga mustaqbalka fog.", "date": "2025-10-15", "scraped_at": "2025-10-29T17:22:29.226968+00:00", "category": "news", "text_hash": "dfedcf06291de4069573007860c25a81933ec32766a921b85fc476ceb025d4cb", "minhash_signature": "3106805,645683,1271515,30655,336952,4673109,33006893,5798464,10539802,5453817,6787455,60070,7558929,17236049,11104018,1514375,11765614,6892689,9118229,668424,2954848,1807197,9361831,33595775,1307865,74098,29720247,5701741,1606462,15013532,9212808,1646094,26995450,7503232,13328097,5567651,3033890,2307610,24164158,1449679,1781467,16604256,23726744,5110286,4170454,22387603,877897,6352729,2396153,8137573,12726992,3619519,1096875,1390814,5440680,19204094,7476676,4621872,6268265,3818188,2735060,9597218,34965670,548307,3208332,279189,2275386,15733091,1276833,11297775,16233174,875712,7158381,4940669,10327273,19163531,2342640,25221060,3867845,1516896,6874812,14531174,2802426,2475480,4812791,17547878,4823880,6740993,492241,13944914,1922415,9100168,2884469,16603524,5121682,6439796,3227675,11012637,292484,6602139,9766998,12342115,5092415,7068430,18833699,2490793,6840376,3841072,7399531,6438481,12408374,243380,4963386,13854155,21476428,3525398,263292,8558591,13321518,5328560,10803235,574293,2221315,1580644,24612813,8170968,2314311,3062348"}
{"url": "https://www.bbc.com/somali/articles/cwypnyjk9zro", "title": "Yaa ku guuleystay El Clásico-dii la ciyaaray 123 sano ka hor, maxaase caawa laga filayaa?", "text": "Xigashada Sawirka, FC Barcelona\nWaa mid ka mida kulamada loogu daawasho badan yahay caalamka iyo ciyaar u dhaxaysa laba kooxood oo xifaaltan dheer u dhaxeeyo Real Mardid iyo Barcelona.\nCaawa ayaa la filayaa in fiidkii hore ay kooxda Real Madrid garoonka ku soo dhaweysay kooxda Barcelona ciyaar ka tirsan horyaalka Laliga ee dalka Spain.\nWaxaanse dib u eegaynaa taariikha kulankan gaar ah ee aadka loo jecelyahay.\n13-kii Maajo, 1902, kooxda FC Barcelona — oo la aasaasay laba sano iyo bar ka hor — ayaa markii ugu horreysay tagtay caasimadda Madrid, si ay kulan ula ciyaarto koox maxalli ah oo cusub oo la aasaasay laba bilood ka hor, FC Madrid.\nMaalintaas cidna ma ogeyn in ciyaartaas ay noqon doonto bilowgii waxa markii dambe isu beddelay xafiiltankii ugu weynaa taariikhda kubadda cagta adduunka.\nEnd of Ugu akhris badan\nKooxda Catalonia, tani waxay u ahayd kaliya ciyaar \"caadi ah oo fudud\" oo ka tirsan tartanka, iyaga oo ku socda dhinaca finalkii aan laga maarmi karin ee ay la ciyaari lahaayeen Athletic Bilbao, oo markaas loo tixgelin jiray kooxda kubadda cagta ee ugu fiican Spain.\nBooqashadan waxay timid xilli semi-final-ka Koobka Coronation Cup, kaasoo lagu qabtay si loogu dabaaldego Boqor Alfonso XIII kadib markii uu gaaray da'da lix iyo toban jirka, oo markaas loo aqoonsanaa \"da'da qaangaarka,\" isla markaana si rasmi ah u qabtay waajibaadkiisii boqornimo ee Boqortooyada Spain.\nTartankan wuxuu ahaa tartankii kubadda cagta ee ugu horreeyay ee ay ka qeyb galaan kooxo ka kala yimid guud ahaan Spain.\nFC Barcelona waxaa aasaasay 1899-kii koox dhalinyaro ajnabi ah oo deggan magaalada, taasoo ka dhalatay caannimada kubadda cagta iyo ciyaaraha kale ee Ingiriiska ee guud ahaan Yurub.\nKahor kulanka ay la ciyaareysay Madrid, Barcelona waxay laheyd labo sano oo waayo aragnimo ah oo kubada cagta ah iyadoo ka qeybqaadatay Copa Macaya, tartan u dhexeeyay naadiyada Catalan oo socday 1900 ilaa 1903.\nKooxda kubadda cagta ee Madrid waxaa aasaasay injineerka Isbaanishka ah Julián Palacios, oo loo aqoonsaday madaxweynihii ugu horreeyay ee Real Madrid xilligaas  ay weli ahayd koox aan rasmi ahayn intii u dhaxaysay 1900 iyo 1902. Lixdii Maarso, 1902, Palacios wuxuu xilalkii u wareejiyay Juan Padrós, ninka si rasmi ah u aasaasay naadiga.\nMarkii Clásico-dii  ugu horreeyay ee labada koox  dhexmartay ay dhacday, kooxda Catalonia waxaaa u ciyaarayey laba ciyaartoy  oo Swiss ah, hal ciyaartoy oo Jarmal ah, iyo saddex ciyaartoy Ingiriis ah, halka Madrid — oo markii dambe noqotay Real Madrid sanadkii 1920, uu ciyaaray hal ciyaartoy oo ajaanib ah.\nKooxda Madrid ayaa sidoo kale lahayd khibrad tartan oo xadidan, iyagoo dhawr kulan oo saaxiibtinimo la ciyaartay kooxaha kale ee caasimadda.\nCiyaartoyga ajaanibka ah ee kaliya ee Los Blancos  — kuwaas oo tan iyo maanta xirta dharka cad — Arthur Johnson, ayaa dhaliyay goolka ugu horreeya ee ciyaarta, isaga oo noqday ciyaartoygii ugu horreeyay ee taariikhda El Clásico gool ka dhaliya. Laakiin ciyaartu waxay ku dhamaatay Barcelona oo ku guuleysatay 3-1.\nGuushan awgeed, kooxda Catalonia waxay u soo baxday finalka tartanka, halkaas oo ay la ciyaari lahaayeen kooxda Basque-ka ah, Athletic Bilbao, oo ugu dambeyn ku guuleystay horyaalka. Tartankani sidoo kale wuxuu calaamadeeyay koobka ugu horreysay ee waxa hadda loo yaqaan Copa del Rey.\nXigashada Sawirka, Getty Images\nIsku dhacyadii u dhexeeyay dhammaan kooxaha Isbaanishka ayaa sii socday sannadihii xigay. Intii u dhaxaysay 1902 ilaa 1916, Madrid iyo Barcelona waxay kulmeen toddobo jeer, iyadoo Barcelona ku guuleysatay shan kulan, halka labo kulan ay ku dhamaadeen barbaro.\nSi kastaba ha ahaatee, \"khilaafkii\" dhabta ahaa ee u dhexeeyay labada kooxood ee Real Madrid iyo Barcelona wuxuu bilaabmay markii ugu horreysay ee muran garsoor uu ka dhashay kulankoodii sideedaad.\nLabada kooxood ayaa ku ballansanaa inay ku kulmaan is arag oo labada guri ah oo laba lug ah. Barcelona ayaa lugtii hore gurigeeda ku badisay laba iyo hal bishii Maarso sanadkii 1916-kii halka Real Madrid iyaduna lugta labaad ku badisay todobaad ka dib, 4-1.\nMaadaama qaabka tartanka waqtigaas uusan ku salaysnayn farqiga goolasha, ciyaar dheeri ah ayaa loo qorsheeyay 13-kii Abriil, taasoo noqotay mid ka mid ah khilaafaadyadii ugu da'da weynaa ee labada naadi loo diiwaangeliyay.\nGaroonka Campo de O'Donnell ee Madrid ayaa loo xushay inuu martigeliyo ciyaarta, waxaana garsoore loo magacaabay José Ángel Berraondo, oo ahaa ciyaaryahan hore oo Real Madrid ah.\nIntii ay ciyaartu socotay Berraundo waxa uu saddex rigoore u dhigay kooxdiisii hore ee Madrid,waxana uu u diiday gool ay la timid Barcelona.\nGoolhayaha Barcelona ayaa labo rigoore ka badbaadiyay, laakiin ciyaaryahankii Santiago Bernabéu oo markii dambe loogu  magac daray  garoonka Real Madrid ayaa dhaliyay goolkii seddexaad daqiiqadii 118aad. wuxuuna ciyaarta ka dhigay 6-6.\nMadrid ayaa u soo baxday finalka ay la ciyaari lahayd Athletic Bilbao, kaasoo lagu qabtay garoonka Barcelona, halkaasoo qaar ka mid ah taageerayaasha ay wateen boorar cambaareynaya garsoorka Berraondo.\nKooxda Madrid ayaa finalka ku guuldarreysatay iyadoo kulankaasi ku dhamaaday  0-4, waxaana qaar ka mid ah taariikhyahannada kubadda cagta Isbaanishka ee xilligaas sheegay in ciyaartoyda Madrid lagu tuuray dhagaxyo iyagoo ka baxay garoonka.\nXigashada Sawirka, Getty Images\nHoryaalka Isbaanishka ee aan maanta u naqaano La Liga ayaa la aasaasay sanadkii 1929, waxaana kulamada u dhexeeya labada koox noqdeen kuwo joogto ah.\nSanadihii 1950-meeyadii iyo 1960-meeyadii, Real Madrid waxay xoojisay booskeeda xooggan, iyadoo ku guuleysatay shantii koob ee ugu horeysay ee Yurub ee isku xigta, laga soo bilaabo 1956, iyadoo ay ugu mahadcelineyso ciyaartoydii loo tixgeliyey halyeeyo sida Alfredo Di Stéfano oo Argentine-Isbaanish ahaa  iyo Ferenc Puskás, oo Hungarian ahaa.\nXafiiltanka u dhexeeya Real Madrid iyo Barcelona ayaa sidoo kale bilaabay inuu qaato wajiyo cusub, iyadoo xidiga u dashay Holland Johan Cruyff uu hogaaminayay kooxda Catalonia bartamihii 1970-meeyadii, halka ciyaaryahanka Jarmalka Paul Breitner uu ku jiray safka Real Madrid, oo ay garab joogeen ciyaaryahanada Spanishka ahaa Spain Vicente del Bosque iyo Goyo Benito.\nSanadihii xigay, labada koox waxay sii wateen inay safafkooda ku soo kala daraan xidigaha ka soo jeeda dalalka kale ee Yurub iyo wadamada Latin America sida Argentina iyo Brazil.\nReal Madrid waxay soo maratay waqtigii loo yaqaanay \"Galacticos\"  oo ahayd intii u dhaxaysay sanadihii  2000 iyo 2006, xilligaasoo ay kooxda ay ku soo biireeen xidigo waaweyn oo ka yimid dibadda Spain, oo ay ku jiraan Luis Figo oo ka yimid Portugal, Zinedine Zidane oo Faransiis ah, Ronaldo oo Brazil ah, iyo David Beckham oo Ingiriis ah.\nSidaas oo kale Bareceona waxay la timid magacyo caan ah sida Ronaldinho oo Brazil ah, Samuel Eto'o oo Cameroon ka soo jeeda, Thierry Henry oo Faransiis ah, iyo Yaya Touré oo Ivory Coast ah\nLabada xiddig ee shiday El-Clásico isla markaana kaalinta kowaad ka galay tartamada kubbada cagta aduunka ayaa kala ahaa Cristiano Ronaldo oo Portugal u dhashay iyo Lionel Messi oo Argentina u dhashay, kuwaas oo ku kala guulaystay abaal marinta Ballon d'Or wakhtigoodii Real Madrid iyo Barcelona., taasoo ka qayb qaadatay ballaarinta xiisaha caalamiga ah ee lagu daawado labada koox.\nCiyaartoyda kale ee sidoo kale  ee shiday iyagu waxaa ka mid ahaa Xavi Hernandez, Andres Iniesta, Gerard Pique, Sergio Ramos, Lukas Modric, iyo Karim Benzema.\nXigashada Sawirka, Getty Images\nCiyaartii El Clásico ee ugu daawashada badnayd ayaa la rumeysan yahay inay dhacday 23-kii Abriil, 2017, iyadoo laga baahiyay in ka badan 185 wadan iyada oo ay adeegsadeen in ka badan 50 idaacado caalami ah oo xuquuqda ka haysta Horyaalka Kubadda Cagta Spain (La Liga), taasoo gaartay qiyaastii 650 milyan oo qof.\nLabada kooxood ayaa ciyaaray 261 kulan oo El Clasico tartamada oo dhan ah tan iyo markii la aasaasay horyaalka La Liga, iyadoo Real Madrid ay badisay 105 ka mid ah, Barcelona 104, iyo 52 barbaro.\nGuushii ugu weyneyd ee taariikhda El Clásico waa guushii Real Madrid ay 11-1 kaga badisay Barcelona bishii June 13, 1943, magaalada Madrid. Si kastaba ha ahaatee, natiijadii ciyaartan ayaa weli ah mid muran siyaasadeed oo aad u weyni ka taagan tahay, iyadoo lagu eedeeyay faragalin siyaasadeed kaligii taliyihii Francisco Franco oo xilligaasi xukumayay Spain, kaddib markii uu afgambi milateri ku qaaday dowladdii bidixda ee la doortay, si uu u xaqiijiyo in ciyaartu ay sidaas ku dhammaato.\nSi aan u diiwaan geliyo wixii dhacay maalintaas, qoraaga British-ka ah ee Sid Lowe ayaa ka wareystay Fernando Argilla, oo ahaa ciyaaryahankii ugu dambeeyay ee nool ee ka qaybqaata ciyaarta, buug uu daabacay 2012. Argilla ayaa u sheegay inuu ciyaarta ka daawaday kursiga keydka, maadaama uu ahaa goolhayaha Barcelona ee bedelka ku soo galay.\nWaxa uu intaa ku daray inuu xasuusto sarkaal ka tirsan dawladda oo booqday qolka labiska ka hor ciyaarta: \"Nin booliis ah, gaashaanle, ma aqaano, laga yaabee inay ka tirsan yihiin Ilaalada Madaniga ah.\"\nHadda El Clásico, waxaa mar kale xiiso u yeellay xiddiga kooxda Real Madrid kaga soo biiray Paris Saint-Germain Kylian Mbappé iyo mar la raga kooxda Barcelona ka soo baxay Lamine Yamal.\nLabadooda Lamine Yamal iyo Kylian Mbappé, ayaa iska horyimid siddeed jeer oo laba ka mid ah ay yihiin Qaramada.", "date": "2025-10-26", "scraped_at": "2025-10-29T17:24:29.260081+00:00", "category": "news", "text_hash": "a044e39987761fe4608c5ad675101287ee40be5d5e411e2ca473dd6367a743fa", "minhash_signature": "3672788,5933174,2248260,2847576,1104654,2888108,1566923,2736826,4635963,2027362,335614,4112403,4514682,2628906,138677,955982,1427506,2015818,251203,2522725,4243399,13633845,1309576,4436629,249669,178387,749943,817603,201707,239088,3894985,59833,4867189,3940271,2089356,4795222,5621881,2245262,1911687,16924825,4371445,2615022,8404151,6961142,1246929,2854754,5397110,3146122,2332788,2561477,2339798,5173931,1656545,4279575,1185339,2982119,6180808,8126144,2749514,2080122,751672,6409478,2379917,4579807,3041905,924892,5776484,5198897,932092,3543897,351853,218856,1134269,7135005,9122723,102557,1465831,294440,5262663,1670226,2999408,51260,1710570,687866,5783808,1037332,4762764,3629260,7817399,922823,13798169,10878004,918295,609703,8661899,183642,922969,1567773,1227304,2141439,1704405,1345222,937231,11518269,6438007,6986234,431328,399894,1046956,2236948,1764272,4356571,1270931,3960356,759821,5475029,4003611,6206801,1808103,690352,936838,4987778,613471,1452198,2468590,1359995,19734990,796157"}
{"url": "https://www.bbc.com/somali/articles/crg1w3dzknro", "title": "Daawo: \"Waan diidnay in nala xidid siibo\" dareenka dadka Gaza ee guryahooda la duqeeyay", "text": "Muuqaalkan ayaa muujinaya nin Falastiini ah oo lagu magacaabo Saabir Abu Hilaal, oo eegaya waxyeellada gaartay gurigiisa oo ku burburay duqeymaha Israa'iil.", "date": "2023-10-09", "scraped_at": "2025-10-29T17:25:29.206888+00:00", "category": "news", "text_hash": "19634dde9f8c8c0dcd75af357212ba0e0a670f6f6d26c38a1b885dcbb7ddd131", "minhash_signature": "612740835,64698440,322427817,506838486,147588410,40679848,147100551,74359266,12870270,129372044,153626744,522812180,17829574,6294863,464059697,183225345,33900949,130840146,446096293,279620754,201996303,80072681,36082365,201837388,364191547,118692614,36468807,36483408,293057642,150014831,42759541,338724165,22493218,95622188,105995271,96017409,311382973,13434064,41794845,205719275,61727961,297029420,233753211,2488890,64950464,295315714,247828287,71547785,441356509,23148740,429917974,31298490,39003542,41538715,225952895,81801902,302744937,393646028,109537630,115513944,256556214,373768647,35858900,1405677512,34000858,249733084,348296424,113902403,155059296,485887107,189299506,101931107,417932134,247520100,3413534,111765876,686158486,36532781,197321450,57659561,6847792,25737362,371849084,110647804,266668000,73162824,92476606,612041895,208588542,124605846,533121276,6366165,22856856,791542874,374687368,705651395,206071675,273024095,530196649,107378003,250201158,105719573,139021799,192708029,207971118,146225658,193125900,129411720,50395883,6801447,523770038,907512775,89750946,116411185,489627197,40556444,14491233,86118176,218518241,753537710,58021670,2870158,251799888,19667945,6783615,84194826,394611079,527991590"}
{"url": "https://www.bbc.com/somali/articles/cm2zyjl12ezo", "title": "Waa kuma wiilka Soomaaliga ee mar kale taariikhda ka dhigay kubadda cagta adduunka?", "text": "Xigashada Sawirka, Cumar Cartan\nGarsooraha Soomaaliga ah ee kubadda cagta Cumar Cabdiqaadir Cartan ayaa dhigay taariikh cusub oo aysan horay u samayn garsoorayaal badan oo Soomaaliyeed tan iyo xorriyadii Soomaaliya.\nCumar oo horrey usoo dhigay rikooro sare oo uu ka gaaray garsooranimada kubada cagta ee Qaarada Afrika ayaa hadda ka mid noqday garasoorayaal loo doortay tartanka koobka adduunka ee FIFA.\nWaxa uu ka mid yahay saddex garsoore dhexe oo laga soo doortay Afrika iyo wakiilka kaliya ee ka socda dalalka  Afrikada ee Saxaraha ka hooseeya si uu u dhexdhexaadiyo koobka adduunka ee ciyaartooyda da'adoodu ka yartahay labaatan sanno jir ee loo qayaan FIFA U-20 World Cup 2025.\nCiyaarahaas kubbadda cagta adduunka ayaa la qorsheeyay inay ka dhacaan dalka Chile inta u dhaxaysa dhammaadka bisha Sebtember ilaa bartamaha bisha Oktoobar.\nGarsoore Cumar Cabdiqaadir Cartan waxa uu ku biirayaa Jalal Jayed ee Morocco iyo Youcef Gamouh ee Algeria oo ah garsoorayaasha ugu waaweyn qaaradda.\nEnd of Ugu akhris badan\nCartan ayaa mar sii horreysay noqday garsoorihii ugu horreeyay ee Soomaaliya ka socda ee qabta ciyaartii wareega afarad dhamaadka ee koobka kooxaha qaarada Afrika isagoo dhexdhexaadiyey kooxaha Pyramids FC ee reer Masar oo ka badisay kooxda Mamelodi Sundowns  Koonfur Afrika ciyaar ka dhacday Qaahira. Sidoo kale waxa uu dhexdhexaadiye ka noqday tartanka qaramada Afrika ee AFCON.\nCaawiyeyaasha kale ee laga soo xulay Afrika waxaa ka mid ah Gilbert Cheruiyot oo ka socda dalka Kenya, Abelmiro Montenegro oo ka socda, São Tomé and Príncipe, Khalil Hassani oo ka socda Tunisia, Eric Ayimavo, ka socda Benin, Lahsen Azgaou, Morocco, iyo Mostafa Akarkad oo isna ka socda dalka Morocco.\nMaxamed Axmed Deysane oo ah ciyaaryahan horey usoo matalay xulka Soomaaliya sanadihii 1980-meeyadii sidaas oo kale ka mida kooxdii heerka kowaad ee Naadiga Batroolka isla markaana ah fallanqeeye ciyaaraha ayaa BBC-da u sheegay in Cumar uu sharaf u soo hoyiyey garsoorka kubada cagta ee Soomaliya\n\"Taas waxay dhiirigelin u tahay dhalinyada kale ee Somaaliyeed, Cumarna wuxuu taas u gaaray dadaal dheeri ah oo uu sameeyey taas oo magaca Soomaalida kor soo qaaday, xiiligaygii ma jirin garsoore Soomaaliyeed oo heerkan gaaray iyagoo haystay fursad dalku uu ahaa nabad ciyaaruhuna heleyeen taageero dowladdeed iyo mid shacbiba,\"ayuu yiri Deysane.\nXigashada Sawirka, Cumar Cartan\nCumar hadda waa garsoore heer caalami ah oo u diiwaan gashan xirirka kubada cagta ee Afrika ee CAF iyo xiriirka kubada cagta ee adduunka ee FIFA.\nWuxuu sheegay in nidaamyo ay leeyihiin dhamaan xiriirrada caalamigaa ee dunida ka jira kuwaas oo hoos taga xiriirka kubadda cagta aduunka ee FIFA, sidaas darteedna isagu uu ka mid yahay garsoorayaasha u diiwan gashan xiriirka kubada cagta qaarada Afrika ee CAF.\nWuxuu sidoo kale Cumar ka qayb galay tababarro xirfadaha garsooraha oo caalami ah oo in ka badan labaatan garsoore oo Qaaradda Afrika ka socda loogu qabtay dalka Masar.\nTartamadii ugu waaweyntaa ee Cumar Cabdiqaadir Cartan uu ka mid ahaa garsoorayaashi qabtay waxaa ka mid ahaa tartankii CAF Under20 iyo CAF under 23 ee Qaarada Afrika.\nCartan wuxuu kale oo uu garsoore ka ahaa ciyaartii finalka ee CAF under 23 oo sanadkan ka dhacday dalka Marooko una dhaxaysay dalka Masar iyo Marooko.\nSidoo kale Cumar wuxuu garsoore ka ahaa ciyaaraha Champion league ee Qaarada Afrika gaar ahan wuxuu si la yaab leh u dhexdhexaadiyey ciyaartii afar dhamaadka Koobkaas ee u dhaxay kooxaha Al-Ahli ee dalka Masar iyo Esperance ee dalka Tuniisiya.\nCiyaarihii is reebreebka koobka aduunka ee ka dhacay dalka Qadar ayuu garsoore Cumar dhexdhexaadiyey saddex ciyaarood oo ka tirsanaa kuwii loogu soo baxay koobkaas sanadkii 2021-kii oo ay ciyaareen dalalka Togo iyo Namibia, Tansania iyo Benin.\nXigashada Sawirka, Cumar Cartan\nDhanka kale Cumar ayaa sanadkii 2023-ka dhexdhexaadiyey ciyaar ka tirsan isreeb reebka koobka adduunka ee sanadka 2026-da lagu qabayo dalalka Maryakanka, Mexico iyo Canada taas oo ka dhacday dalka Koonfur Afrika una dhaxaysay Eswatini iyo Liibiya.\nXirirka kubada cagta ee Qaarada Afrika ayaa Cumar Cabdiqaadir Cartan u xushay liiska garsoorayaal qabanaya ciyaaraha Koobka Qaramada Qaarada Afrika oo ka socda dalka Ivory Coast\nKoobka kubadda cagta ee Qaaradda Afrika ayaa la qorsheynayey in sanadkii 2023 la qabto hase yeeshee dib u dhac ayaa ku yimid wuxuuna qabsoomay 13-bisha Janaayo isagoo socon doona ilaa 11 Febraayo sanadka 2024-ta.\nCumar wuxuu sheegay inuu bixiyey kaadhka cas ilaa labo jeer dhammaan tartamada caalamiga kubadda cagta ee uu ka qabtay Qaaradda Afrika.\nArrinta cajiibka ah ayaa ah in sidoo kale Cumar Cartan uu yahay garsooraha kaliya ee Soomaaliyeed ee u tababaran in uu isticmaalo VAR, wuxuuna ku qabtay habkan tartamo ka dhacay Afrika, isagoo haysta shahaadada aqooneed ee garsoorenimada VAR.\nCumar Cabdiqaadir Cartan wuxuu sanadkii 1995-tii uu ku dhashay xaafadda Buulo-xuubeey ee degmada Wadajir ee magaalada Muqdisho.\nHeerkiisa waxbarashada hoose, dhexe iyo sare ayuu ku qaatay isla Muqdisho isagoo heerka kowaad ee jaamacada ku qaatay daraasaadka horumarinta.\nWuxuu BBC-da u sheegay inuu heerka uu gaaray arsoorka kubadda cagta ee Qaarada Afrika ay ugu suurto gashay dadaal shakhsi ahaaneed oo muujiyey iyo kordhinta aqoontisa.\nWuxuu sidoo kale sheegay inuu rajaynayo inuu qaban doono kulamo waaweyn oo ka tirsan koobka aduunka.", "date": "2025-09-06", "scraped_at": "2025-10-29T17:26:29.423326+00:00", "category": "news", "text_hash": "8a4f2942c75a9b56993d6bb23019168cb2c689524fa0c2ef7d8de0bada880b0a", "minhash_signature": "415410,3041717,8492,9777712,299569,4186439,196904,36207120,1830183,151672,2296463,6009222,247773,4675264,3587242,11125630,49042,10774366,428193,14670453,4456838,334994,10491980,13089436,7298897,4057053,1903285,1316690,7506866,38322,3973279,1121430,21651858,2535775,2601874,19258483,7653585,3504470,1453,4158147,5389233,4213510,4270928,452570,8382167,1423885,633491,14761715,14714578,3411788,5655570,26723598,2293974,3301212,1146603,1371485,1251785,14801694,1622349,3330581,4069755,827764,6782017,7966806,3418224,828447,13526095,6823669,17919694,5729432,4689543,5978883,7930077,208040,972225,5210740,56899,1751761,4479167,6942601,2412868,8847795,29373660,17354404,4169222,4313272,7815715,1872297,8094193,9763528,17312741,1981739,233164,1266774,3293237,915564,12199929,2980224,1227304,9451146,3884846,374458,19729801,408791,4120098,1540224,8376910,813288,708045,22008673,4222514,6164848,75301,419989,278508,1721326,4129859,2333317,580268,9327280,620989,578145,3292105,1732486,14517997,7734560,1069102,6065427"}
{"url": "https://www.bbc.com/somali/articles/cx2p3yy501do", "title": "Gabadha ka shaqayn jirtay xayaysiiska iyi aflaanta ee gacanta u gashay Xuutiyiinta Yemen", "text": "Xigashada Sawirka, INTISAR AL-HAMMADI\nXuutiyiinta Yemen ayaa sii daayay haweeney dharka xayeyesiisa oo lagu magacaabo Entisar al-Hammadi.\nEntisar ayaa xabsiga ku jirtay ku dhawaad ​​shan sano, waxaa sisaasi u sheegay wakaalada wararka ee AFP qareenkeeda iyo ilo amni  Axadii.\nEntisar Waxaa dhashay hooyo Itoobiyaan ah iyo aabbe Yemeni ah, waxaa lagu xiray bishii Febraayo 2021 magaalada Sanca iyada oo xilligaasi ku guda jirtay howlo sawir qaadid ah.\nWaxaa lagu xukumay shan sano oo xarig ah iyadoo lagu eedeeyay inay jirkeeda ka ganacsanaysay, adeegsiga daroogo iyo in ay macaasi ku kacday.\nEedeymahan ayaa qareenkeeda iyo kooxaha xuquuqul insaanka waxay ku tilmaameen kuwo been abuur ah oo lagu bartilmaameedsanayo xorriyadda haweenka.\nEnd of Ugu akhris badan\n\"Entisar al-Hammadi waxaa la sii daayay fiidnimadii shalay, waxayna hadda ku sugan tahay gurigeeda,\" waxaa sidaasi wakaalada wararka ee AFP u sheegay qareenkeeda, Khaled al-Kamal.\nQareenkeeda ayaa intaa ku daray in iyada iyo saddex qof oo kale lagu qabtay gaari magaalada Sanca , markaasi oo ay gacanta ku dhigeen  Xuutiyiinta\n\"Entisar waxa ay la soo darsay xanuuno kala duwan, xaaladeedana waa ay ka sii dartay, taas oo ka dhalatay cadaalad darada lagula kacay,\" ayuu intaa raaciyay.\nBishii March, Ms Hammadi waxaa loo gudbiyay xabsiga dhexe ee Sanca, halkaas oo ilaalada ay ugu yeereen \" dhillo\" iyo \"addoon\", sababtoo ah maqaarkeeda madow iyo asalkeeda Itoobiya, ayuu yiri qareenkeeda.\nHammadi waxa ay isku dayday in ay is disho 2021-ka, waxaa sidaasi xilligaasi sheegay kooxaha xuquuqul insaanka.\nBishii March, Ms Hammadi waxaa loo gudbiyay xabsiga dhexe ee Sanca, halkaas oo ilaalada ay ugu yeereen \" dhillo\" iyo \"addoon\", sababtoo ah maqaarkeeda madow iyo asalkeeda Itoobiya, ayuu yiri qareenkeeda.\nWaxaa dhalay hooyo Itoobiyaan ah iyo aabbe Yemeni ah, Xammadi waxay internetka soo galisay tobonnaan sawiro ah  iyada oo ku labisan dharka hidaha iyo dhaqanka, Jiinis ama jaakad maqaar ka sameysan, mar ay xiran tahay Xijaab iyo mar aysan xirneen-ba.\nWaxay ku leedahay kumanaan taageerayaal ah baraha Instagram iyo Facebook.\nSida laga soo xigtay hay'adda xuquuqul insaanka ee Human Rights Watch , Hammadi waxay  ka shaqaynaysay muddo afar sano shaqada modelka waxayna ka qeyb qaadatay jillinka filim taxani ah oo telefishin ku yaalla dalka Yemen ka baxi jiray.\nAmnesty International waxa ay sheegtay in markii la xiray Xammadi \"la waraystay iyada oo indhaha laga xiray, dhibaato jireed loo geystay, lagula-na  kacay aflagaado cunsuriyad ah laguna qasbay in ay ' qirto' dambiyo dhawr ah – oo ay ku jiraan inay haysato maandooriye iyo dhillaysi\".\nTacadiyada ka dhanka ah haweenka gaar ahaan deegaanada Xuutiyiinta ay maamulaan ayaa sare u kacday kadib markii dalka Yemen uu sanadkii 2014-kii ka dhacay dagaal sokeeye oo ay Qaramada Midoobay sheegtay in ay abuurtay xaalad bini'aadantinimo tii ugu darneyd.\nXarigeeda iyo maxkamadeynteeda waxay soo bandhigtay cadaadiska Xuutiyiinta ee haweenka iyo tacadiyada lagaula kaco .\nXuutiyiinta ayaa tan iyo markii ay dhacday dowladdii dhexe ee Yemen waxay dagaal kula jireen dowladda caalamku aqoonsan yahay\nIsbaheysiga Sacuudiga uu hoggaamiyo oo ay ku jiraan Imaaraadka Carabta ayaa sanadkii xigay galay dagaalka Yemen iyagoo isku dayaya inay soo celiyaan dowladda.\nDagaalkan ayaa ahaa mid sanadadii u dambeeyay la isku mari la'aa,, waxayna  Xuutiyiinta heshiis la galeen Sucuudiga oo joojiyay weeraradii ay ku hayeeny Xuutiyiinta .", "date": "2025-10-27", "scraped_at": "2025-10-29T17:27:29.208986+00:00", "category": "news", "text_hash": "45effb4ee85619acf5395d81dc24527c937d04b8586d5b18a62bc110b6a0323b", "minhash_signature": "8892383,6468740,15017927,8919639,3500406,22946524,4029410,6997095,5218208,1218365,9505638,782219,16459807,1843734,44007770,158568,8884993,1974660,11675994,16032897,819244,4495846,1944642,1523057,1405161,1535496,13464076,11561949,4193588,10642074,7190134,13791330,3280475,1286020,156161,5760445,306188,1253175,12925539,16583779,9319695,5721393,2332805,6226799,24452605,5562875,29152418,6195641,317203,4965499,4767507,5926718,6828749,4923620,18114453,24814058,748062,11813461,7482901,4397095,11649997,25336845,2779949,10245216,5859545,1867648,5613821,4426578,7572954,5941259,4671750,4186021,14953688,18993158,3650633,4174485,12103702,19745258,16425217,24825983,6847792,6720464,4451499,237804,14877559,14904515,8580943,2555974,1424334,15405922,7914604,1636521,6455148,4279956,24534487,81233,3322621,4891451,2500743,11445539,88795,31788400,14850236,9402840,9137980,2055493,18049111,7801212,1175530,618551,6359861,14112551,11653990,3069491,9751277,13470721,2250374,1969058,26289130,1910955,582261,2870158,7173002,2792724,14736946,4098881,10363655,23066415"}
{"url": "https://www.bbc.com/somali/articles/c80jpldjxzko", "title": "Sakariye Xaaji: Markii ay gabadhiisu ku tiri 'Waan ku jeclahay'", "text": "Sakariye Maxamuud Xaaji Cabdi waa mid ka mid ah siyaasiyiinta ugu caansan Soomaalida.\nWaa Wasiir hore, muddo dheer na ahaa xildhibaan af adag. Marar kale na u tartamay xilka madaxweynenimada Soomaaliya.\nMaanta na, waa isaga oo kaftamaya, heesaya oo carruurninadiisa iyo jaceyl ka sheekeynaya. Waxa uu waramay Weriye Faduma Taxadar Yusuf.", "date": "2023-10-05", "scraped_at": "2025-10-29T17:28:30.724708+00:00", "category": "news", "text_hash": "b341513f072110525443a2f02521b78f497b77ab786586271a1498c7d4b78c3f", "minhash_signature": "21515906,73189097,68044335,13731101,4612759,73375562,173038134,32245793,71993963,99809213,51632860,6283743,27473035,133769003,73488203,77263179,49631104,67694394,205340432,211195324,26436421,7690703,72816877,8013845,301754471,24401657,94844703,109349153,58148697,13490891,25376413,169768471,1960039,82497347,28187887,85573694,17511765,677980,79758234,23958966,236202810,77941343,73967009,42665585,92770895,45020672,63515818,58826071,252143958,262360556,95787154,115575214,10340000,39302760,158534481,9587049,92126107,36780400,48937687,120206868,38470403,7030461,12389258,74640457,7486540,2166854,333117475,22337753,56890881,102048761,254072333,42205218,103145775,119349025,99331044,40510031,24332744,12189217,424609169,73167339,45470603,13203489,84563422,28351839,128703331,217193326,93435411,117437682,8971935,118862281,4643415,130390795,86079273,125035689,163368790,9742061,10809014,65437520,1492760,17466014,183078939,140096224,14278395,8697391,656606965,233680633,10451493,129534596,37296044,46652755,114553521,12209474,13602622,45543111,85121678,48022376,65423718,11004445,300754747,2322095,170520694,50675166,32831698,6460440,39615759,5352762,52572461,73585655"}
{"url": "https://www.bbc.com/somali/articles/cp3dnp3jgdgo", "title": "Boqorkii Sacuudiga ee uu dilay wiil uu adeer u yahay 50 sano ka hor", "text": "Xigashada Sawirka, C Maher/Daily Express/Hulton Archive/Getty Images\n25-kii March 1975-kii, waxaa caasimadda Riyaad lagu dilay Boqor Sacuudiga Faysal. Waxa toogtay wiil uu adeer u yahay ooku dhex-toogtay gudaha qasriga boqortooyada.\nMarkii rasaasta la ridayay waxaa ag taagnaa wasiirkiisa shidaalka Axmed Zaki Yamani.\nSannadkii 2017, Dr Mai Yamani, oo ah gabadh uu dhalay wasiirkii hore ee Shidaalka scauudiga  ayaa la hadashay BBC.\n\"Weligay ma hilmami doono maalintaas, xanuunkaas jirkeyga ayuu saaqay, wali waan xasuustaa, aabbahay. Bal qiyaas qof bini'aadam ah oo ag taagan lataliyihiisii, sayidkiisii, saaxiibkii, oo xabbad af-saar looga dhigay.\"\nBoqor Faysal ayaa saddex xabbadood oo is xig xiga lagu dhuftay, ka dib markii uu foorarsaday si uu u dhunkado gacanta wiil uu adeer u yahay oo salaamay.\nEnd of Ugu akhris badan\nAabaha Dr Yamani oo muddo15 sano ah ahaa wasiirka daacadda u ah Boqor Faysal ayaa warbixin siinayey boqorka, waana sababta uu dhinaciisa ugu u taagnaa.\nBoqor Faysal oo ahaa boqorkii saddexaad ee boqortooyada sacuudiga  ee qaniga ku ah shidaalka , waxa uuna ahaa wiil saddexaad.\nMarkii la toogtay boqorka waxaa  loola cararay Isbitaal, balse wax yar ka dib wuu dhintay.\nXigashada Sawirka, Claude Salhani/Sygma/Getty Images\nDhowr mayl meel magalada u jirta maalintaas, Mai Yamani oo 18 jir ah ayaa ku sugaysay aabaheed.\n\"Waxaan fadhiyay gurigii aabbahay oo ay ku wareegsan yihiin buugaagtiisa. Wuu soo galay, isaga oo ay ka muuqato wajigiisa xanuun iyo murugo iyo a xanuun badan. Wuxuu si toos ah ugu gudbay qolka cuntada oo waxaa uuna dhawaaqay afka labadiisa isaga hal kelmad oo ahayd - 'Balaayo'.\"\nKani ma ahayn ninkii ana naqaana oo ahaa  nin ku caan baxay degenaan iyo aamusanaan, ka dibna wuxuu u sheegay inantiisii ​​wixii dhacay.\n\"Waxa ahayd10-kii subaxnimo wefti Kuwait ah oo arrimaha shidaalka ah ayaa joogay, waxayna doonayeen inay la kulmaan boqor Faysal oo jooga qasriga, aabbahay oo ahaa wasiirka shidaalka ayaa u soo galay inuu boqorka warbixin siiyo,\" ayay tiri.\n\"Amiirkaas oo ahaa mid la yaab leh oo ay isku magac yihiin, Faysal [Ibu Musaed] oo boqorku adeer u yahay, ayaa weftiga ku dhex milmay wasiirkii shidaalka ee Kuwait, ka dibna wuu i isku duubay wiilka uu adeerka u yahay si uu u salaamo.\n\"Wiilkii adeerka uu u ahaa ayaa bistoolad yar jeebka kala soo baxay oo ku toogtay boqorka, saddex xabbadoodna madaxa ayuu kaga dhuftay, aabbahayna meel aad ugu dhow ayuu taagan yahay.\"\nSida ay sheegayaan wararka qaar wakhtigaas, gacankudhiiglaha ayaa sida muuqata u sheegay booliiska in Yamani uu u taagan yahay meel aad ugu dhow uuna u maleeyay inuu isagana uu dili doono.\nYamani waxa uu isbitaalka u qaaday boqor Faysal, halkaas oo la  xaqiijiyay geerida boqorka.\n\"Intaas ka dib, wax walba waa ay aamuseen, waddooyinka Riyadh waxay ahaayeen kuwo faaruq ah, [waxaa jiray] aamusnaan.\"\nFaysal waxa uu boqor ka noqday Sucuudiga sannadkii 1964-tii, isaga oo xukumayay \" Saxare le'eg Galbeedka Yurub \", waxaana Ingiriisku uu ku ammaanay inuu yahay\"saaxiibka cusub ee Carbeed\", shaqadiisa waxay ahayd \"inuu casriyeeyo mid ka mid ah dalalka ugu dib-u-dhacsan Bariga Dhexe\", sida uu weriyaha BBC-da David Dimbleby u sheegay xilligaas - laakiin ma sameyn karaa isaga oo aan lumin kursigiisa?\nMid ka mid ah wiilasha gaar ahaan curadka Cabdulcasiis Al Sacuud, Faysal waxa uu u halgamay ololihii aabbihii ee ahaa in la mideeyo jasiiradda Carabta taas oo horseedday in la aasaaso boqortooyada magaceedu yahay Sucuudiga, 30 sano ka hor xilligaasi.\nCabdulcasiis Al Sacuud, Faysal markii dambe waxa uu ra'iisal wasaare ka noqday walaalkii ka weyn oo boqor noqday markii aabbahood dhintay.\nMarkii uu Faysal laftiisu boqor noqday, waxa uu caan ku ahaa siyaasi caqli badan, cibaado badan, hawlkar ah iyo isbedel-doon, waxa uu ahaa nin ka hawlgeli jiray caasimadaha dibadda ee adduunka oo dhan.\nWaxa kale oo loo arkayey in uu yahay masuul doonaya in uu u isticmaalo shidaalka cusub ee la helay si uu u Sacuudiga uga hirgaliyo dawladnimada casriga ah, waxbarashada, caafimaadka iyo nidaamka garsoorka dalka Sucuudiga uu sibadal ku sameeyo.\nLaakiin dib-u-habaynta boqor Faysal ayaan mar walba ka farxin dadka muxaafidka ah ee ku jira mad-habta adag ee Islaamka ee qoyskiisu ay isbahaystaan.\nMarkii bartamihii 60-aadkii uu Faysal furay telefishinkii ugu horreeyay ee Sacuudi Carabiya, ayaa weerar hubeysan lagu qaaday dhismaha, kaasoo uu hoggaaminayay wiil wlaal la ahaa  ninkii markii dambe dilay.\nBoqor Faysal waxa uu sidoo kale hirgaliyay waxbarashada gabdhaha.\nDr Yamani ayaa yiri: \"Boqoradda Iffat [xaaskiisa labaad] waxa ay waxbarashada gabdhaha ka bilowday boqortooyada Sacuudiga.\n\"Aad baan ugu hanweynahay inaan ka mid ahaa 9-kii hablood ee ugu horeeyay ee wax ka barata dugsigeedii, boqor Faysal waxa uu ku qanciyay hay'adaha diinta in aad haweenka wax barataan oo ay noqdaan hooyooyin wanaagsan, waxaana la oran jiray Daar Al Xanan oo ah dugsigii jilicsanaanta.\nXigashada Sawirka, Bettmann Archive/Getty Images\nYamani waxa uu bilaabay in uu u shaqeeyo boqor Faysal 1960. Tani waxay ahayd mid aan caadi ahayn maadaama uu ahaa nin aqoon sare iyo qareen, balse aan ka tirsanayn qoyska boqortooyada Sucuudiga.\nBoqor Faysal ayaa akhriyey maqaallo uu qoray kuwaas oo indhihiisu qabteen oo soo jiitay.\n\"Aabahay waxa uu furay xafiiskii ugu horeeyay ee sharciga ka dibna waxa uu bilaabay in uu qoro maqaaladii ugu kicinta badnaa ee uu ku dalbanayo dimoqraadiyad iyo dawlad wanaag, waxa u saxeexay qof la yidhaahdo Abu Mai, oo ah aabbe gabadh la yidhaahdo Mai, sababtoo ah anigu waxa aan ahaa curadkiisii, markaa Faysal oo markaas boqorka ahaa ayaa yiri waa ayo ninkani? Sababtoo ah wuxuu raadinayey lataliye sharci.\"\nBoqor Faysal waxa uu markii dambe Axmed Zaki, ama Sheekh Yamani sidii uu ku caan baxay ka dhigay wasiirka shidaalka.\nWaxa ay si wada jir ah boqorka iyo dadkii la shaqeynayay ​​u dejiyeen siyaasad ay markii ugu horreysay si buuxda u siisay Sucuudigu in uu si buuxda u maamulo hantida faraha badan ee uu ku helay shidaalka, kana dhigo mid awood u leh oo lagula xisaabtamo dunida Carabta iyo caalamkaba.\nSannadkii 1973-dii, ka dib dagaalkii u dhexeeyay Israa'iil iyo dalalka Carabta ee ay deriska yihiin, Sucuudigu, oo hadda ah dalka ugu badan ee soo saara shidaalka  adduunka, ayaa horseeday ololihii shidaalka loogu adeegsaday markii ugu horreysay  sida hub siyaasadeed oo kale.\nShidaalka la geeyo wadamada taageera Israel waa la dhimay, taasoo oo ka dhigtay qiimaha Shidaalka mid sareeya  adduunka. Waxaa uu ahaa Sheekh Yamani qofka loo soo dhiibay oo baahiyay.\n\"Waxa aan rabno waa ka bixitaanka ciidamada Israa'iil gebi ahaanba dhulka Carabta ee la haysto. Ka dibna waxaad heli doontaa shidaalka heer la mid ah, wxaa uu halkaas jeediyay Sebtembar 1973.\"\nWaxa uu qiray in kororka baaxadda leh ee ku yimid qiimaha shidaalka ay ka dhigan tahay isbeddel ku yimaada isu-dheelitirka awoodda adduunka ee u dhexeeya waddamada soo koraya, kuwa wax soo saara iyo waddamada horumaray ee warshadaha leh.\nIsbeddelkaas ku yimid miisaanka awoodda waxa la aqoonsaday markii, 1974-kii (sanad ka hor intaan la dilin), Boqor Faysal wxaa loo aqoonsaday ninka sannadka ugu saameynta badan ee majaladda Time.\nDr Yamani ayaa tiri: \"Ma garanayno sababta dhabta ah ee loo dilay boqorka, marka laga reebo in gacan ku dhiiglaha uu ahaa nin dhibsaday, aniga oo 18 jir ah xilligaas, waxaan dareemay xanuunka aabbahay, weli waan xasuustaa.\"\nSheikh Yamani ayaa 11 sano oo kale ahaa wasiirka shidaalka ee Sucuudiga, ilaa 1986-dii.\nDr Yamani waxa ay u sii gudubtay jaamacad ku taalla dalka Maraykanka, waxayna noqotay haweenaydii ugu horreysay ee ka soo jeedda Sucuudiga ee PhD ka qaadata Oxford.\nWaxay qortay buugaag badan oo ku saabsan aqoonsiga Carabta waxayna sidoo kale la taliye u noqotay bangiyada sida Goldman Sachs iyo shirkadaha shidaalka sida Shell.", "date": "2025-10-17", "scraped_at": "2025-10-29T17:29:29.671247+00:00", "category": "news", "text_hash": "7d845258f39e19facb610bc63406b38980d552a3025752c45b3c366b5dbb8402", "minhash_signature": "3273954,326403,427176,13411730,758347,1610317,876964,2930933,4266885,1087221,435048,702095,306341,318763,9000988,157413,7931555,5388887,3527905,303314,5440322,4250698,737103,5430019,3412188,3327435,3566180,3575606,1094060,3115697,5992410,9047085,38984,2011482,1882829,5122444,634355,7269220,4905659,6950974,805258,276833,46621,2957978,4970266,1386249,9862535,282330,3123243,3525984,2175283,3326261,2715671,2958550,761523,756850,4945686,391765,1718492,170734,8523986,1895227,2628939,2736766,3183686,2525003,2493089,657010,2131651,576338,827239,9301586,5267856,872345,2956709,206006,1627527,13692141,1739408,2708673,4127004,441541,1336348,4088799,1595163,6899998,1007441,2084049,2329198,7615159,1294765,5477997,799145,2879173,659758,356890,1412156,2022488,1118325,3349502,5913569,2599733,3927538,5093839,797460,5304025,14909764,9087071,7564552,4396102,1497776,1192921,2041391,13316183,1413606,2708734,2407718,3311558,1917737,3222704,192050,3453828,5968211,6403121,3698090,317105,2095137,1190519"}
{"url": "https://www.bbc.com/somali/articles/cqjejvlv1klo", "title": "Waa tuma Fartuun Cumar, fannaanaddii hore ee Mareykanka ku geeriyootay?", "text": "Xigashada Sawirka, SOCIAL\nAlle ha u naxariistee waxaa dalka Mareykanka ku geeriyootay fannaanad hore Fartuun Cumar.\nFartuun ayaa muddooyinkii dambe ku xanuunsaneed dalkaas, halkaas oo ay xalay ku geeriyootay, sida ay shaaciyeen ehelkeeda iyo fannaaniinta ku nool Mareykanka oo in dhoweyd la socday xaaladdeeda caafimaad.\nFartuun oo hore u shaacisay inay fanka ka baxday ayaa mar uu dhowaan wareysi uu ka qaadayay mid ka mid ah telefishannada Soomaalida waxa ay sheegtay iny ku dhalatay magaalada Muqdisho ee caasimadda Soomaaliya.\nFartuun Cumar noolasheeda inta badan waxay ku qaadatay dalka Mareykanka oo ay ku kortay.\n\"Fartuun waxay ku dhalatay Soomaaliya gaar ahaan magaalada Mudisho noolasheyda inta badan waxaan ku koray dalka Mareykanka,\" ayay ku sheegtay wareysigaasi horey loogu qaaday.\nEnd of Ugu akhris badan\nHeesaha ay horey u qaadday waxaa ka mid ahaa\nFartuun kama soo jeeddo qoys faneed sida ay sheegtay, balse tan iyo yaraanteedii waxay jecleyd fanka oo ay aad u daneyn jirtay.\n\"Fankeyga waxaan soo galay ilaa 2005-tii ilaa 2006-dii, fankeygu qurbaha ayuu ku bilaabmay, qoyskeyga taariikh uma laha fanka oo qof fannaan ah nagama dhalan laakiin aniga ayaa ilaa carruurnimadii fanka aad u jeclaa,\" ayay intaa ku dartay.\nSida ay sheegtay waxa ay fankeeda ka billowday gobolka Ohio ee dalka Mareykanka.\n\"Fanka waxaan ku soo galay waxaan soo dagay magaalo Ohio la yiraahdo oo ay Soomaalida ku badan tahay, waxaan ka soo guuray magaalo Soomaalida ku yar tahay halkaasi oo aan fanka ka billaabay\" ayay intaa ku dartay.\nHeestii ugu horeysay oo ay iyadu leedahay ee ay qaaddo ayaa waxay ahayd heesta Samir oo ay wda qaadaan fanaanka Guuleed taasi oo soo baxday 2008-dii, waana mid ka mid ah heesaha ay caanka ku ahayd.\n\"Heestii iigu horreysay waxay ahayd heesta Samir oo ahayd hees muuqaalkeeda ay ilaa hadda dadka aad u wada jecel yihiin aniga iyo Guuleed, waxaana noo dhiibay abwaan Axmed Heykal,\" ayay tiri Fartuun.\nFartuun ayaa wareysi ay horey u bixisay waxa ay sidoo kale ku sheegtay in qoyskeeda markii ay fanka ku soo biireysay aysan ku faraxsaneyn, balse  aysan caqabad ku noqon fankeeda.\n\"Allxamdulilah wax dhib ah kalama kulmin qoyska oo sida qoysaska qaar ma dhihin waan ku deyrinnay iyo ha nugu soo noqonin laakiin ilaa hadda raali kama aha,\" ayay hpre u tiri Fartuun.\nXigashada Sawirka, Baraha bulshada\nAlle haa u naxariistee Fartuun Cumar ayaa sanadkii 2016-kii shaacisay inay ka baxday fanka isla markana wixii xilligaa ka dambeeyay waxay ka fariisatay fanka.\nWaxay xilligaasi ay fanka ka baxaysay ka mid ahayd fanaaniinta aadka loo jecel yahay heesaheeda, balse waxay sheegtay inay go'aansatay inay fanka ka \"towbad keentay\".\n\"Waxaan rabaa inaan maanta idinla wadaago go'aan aan qaatay oo ah inaan fanka gabi ahaantiiba isaga haray alxamdulillah, aniga oo Alle u towbad keenay iyo anigii oo qoys noqday.\" Ayay ku tiri muuqaal kooban oo ay baraha bulshada soo galisay.\nWixii intaa ka dambeeyay, fanaannada ayaan inta badan lagu arkin fagaaraha, iyadoo sanadihii ugu dambeeyay la sheegay inay xanuunsaneyd.", "date": "2025-10-11", "scraped_at": "2025-10-29T17:30:29.523596+00:00", "category": "news", "text_hash": "516e7cd085c65b7de3dd975fb1828a7c828e6d3097ac897a23328d6b145bf3a7", "minhash_signature": "4572062,317662,9392738,3267484,25996911,7484274,7877394,2045612,4057860,15081646,9509280,1281067,947679,31175836,9606389,15806757,22574761,10774366,7757046,105404,122773,5724808,8144269,92160,5947851,4901709,587410,7923410,11525126,10244325,2572275,2766025,2774422,11665302,7048641,4653198,8539788,5743222,4296917,9715341,3171558,11113035,5022522,2041384,10189587,368659,2430363,4852437,4848575,1808654,18208278,6423737,10838596,4802319,8643845,9888046,1772093,780814,4356103,11959823,1715360,14608727,1291917,1453230,1595423,292269,7336916,26791467,27544456,20443124,9125275,10642666,14147240,449905,2328726,27698452,5828577,17666123,15391213,2435125,1552855,4947461,3539725,13300359,19058658,2450155,13927463,2880616,9541098,1070399,1452480,5775098,7408729,17781098,4511944,16588687,5370107,15063159,1492760,6979091,563699,1946766,2058810,5822629,10775265,27446590,30231889,29569268,4143950,40075927,6565682,3407386,8901641,20221453,13553104,1231044,2203416,9092007,1952496,746668,1342093,708141,6562767,21875,1507506,33570540,4163284,3819597"}
{"url": "https://www.bbc.com/somali/articles/cy0pl10rzp8o", "title": "Muxuu yahay isu imaatinka bani'aadannimo ee ugu weyn adduunka ee ka dhacaya Hindiya?", "text": "Xigashada Sawirka, Ankit Srinivas\nMalaayiin qof ayaa isugu tegay magaalada waqooyiga Hindiya ku taalla ee Prayagraj ee gobolka Uttar Pradesh, si ay uga qeyb qaataan isu-imaatin-la bani'aadannimo ee ugu weyn adduunka.\nRag dambas soo marsaday oo qaarkood qaawan, dhanka diinta Hinduudana laga barakeysto, ayaa ka qeyb galaya munaasabadda Kumbh Mela, iyagoo isugu tegay webiga ay barakeystaan ee Ganges, si ay ugu qubeystaan.\nDadka oo sita boorar lagu xardhay erayo diimeed, iyo sanamyada Hinduuga ayaa isku tuurayay biyaha barafka ah.\nMarka ay kasoo baxaan biyaha, qaar ayaa gacmaha kusoo qaata carrada midabka qalinka leh iyagoo marsanaya jirka.\nKuwo badan ayaa sidoo kale sitay seefaf.\nEnd of Ugu akhris badan\nRaggaas la barakeysto – oo loo yaqaanno Naga sadhus – waxaa la socda malaayiin reer Hindiya ah oo adduunka isaga kala yimid kuwaasoo ku sugan Prayagraj si ay uga qeyb galaan munaasabaddan loogu magac daray isu imaatinka bani'aadannimo ee ugu weyn adduunka.\nMaanta oo u ah maalinta qubeyska waa maalinta labaad ee munaasabadda Kumbh Mela oo 12-kii sanoba mar la qabto. Galabta xilliga dalkaas, ilaa 16 milyan ayaa galaya webiga si ay ugu qubeystaan. Saraakiisha ayaa sheegay shalay oo maalinta koowaad ahayd, in  16.5 milyan oo qof ay webiga ku qubeysteen.\nIn ka badan 20 milyan oo qof ayaa la filayaa inay maanta ka qeybqaataan caado-diimeedyada halkaasi laga sameynayo iyadoo ilaa 400 oo milyan oo qofna ay ka qeybgeli doonaan 45-ta maalmood ee soo socota, sida ay sheegee saraakiisha dalkaas.\nDadka Hinduuga ayaa aaminsan in caado-diimeedkan ay ka dhaqi doonto dembiyada ayna naftoodana nadiifin doonto.\nXigashada Sawirka, Ankit Srinivas\nBooliiska ayaa la daalaa-dhacaya xakameynta dadka tirada badan ee maanta isugu tegay halkaas iyadoo kumannaan ay u suurto-gashay inay isugu tagaan meelo loogu talo-galay dad gaar ah.\nMahant Prayag Puri Ji oo kasoo jeeda deegaanka Juna Akhara ayaa maamulka ku eedeeyay jileec iyo inay xakameyn waayeen qulqulka dadka.\n\"Waa nala riixay oo nalaga saaray marka aan dooneynay inaan qubeysanno,\" ayuu yiri. \"Aad ayaa loo buuxiyay dadkuna anshax ma lahayn. Waan dhacay lugaha ayaana dhaawac iga gaaray. Inaan halkaas ka cararo ayay noqotay oo aan nafetyda badbaadsado.\"\nCaado-diimeedka maanta ee qubeyska, oo lagu magacaabo Shahi Snan – ama qubeyska boqortooyada – ayaa waxaa yimaada rag dadka siinaya talooyinka iyo waxa laga doonayo.\nImaatinkooda waxay wax weyn u tahay dadka ku nool gudaha Hindiya iyo adduunkaba kuwaasoo u yimaada inay ka barakeystaan.\nJoogitaankooda ayaa sidoo kale ahmiyad gaar ah u leh dadka tirada badan ee aaminsan in biyaha webiga ay ka dhaqayaan dembiyada.\nXigashada Sawirka, Uttar Pradesh government\nWaxaa jira lix maalmood oo la jecel yahay in la qubeysto, sida ay go'aamiyeen ragga laga barakeysto, waxaana lagu saleeyaa meerayaal gaar ah. Waxayna kala yihiin:\n13 January: Paush Purnima\n14 January: Makar Sankranti\n29 January: Mauni Amavasya\n3 February: Basant Panchami\n12 February: Magh Purnima\n26 February: Maha Shivaratri\nXigashada Sawirka, Ankit Srinivas\nSaddex ka mid ah kuwan – waa 14 iyo 29 January, iyo 3 February – waxaa loo asteeyay maalmaha loo yaqaanno Shahi Snan waana maalmaha ay qubeystaan raggan laga barakeysto.\nIsu imaatinka ugu weyn ayaa la filayaa inuu dhaco 29 January markaas oo 50 ilaa 60 milyan oo dad cibaadeysanaya la filayo inay biyaha galaan.\nXigashada Sawirka, Ankit Srinivas\nMaamulka gobolka ayaa magaalo weyn oo teendhooyin lagu xardhay ka sameeyay qarka webiga taasoo dherersan ilaa 4,000 hiktar si ay hoy ugu noqoto ragga laga barakeysto, dadka kale iyo weliba dalxiisayaasha booqashada u tegay.\nAsal ahaan xafladda ayaa salka ku haysa sheekada khuraafaadka ah ee ku saabsan dagaal u dhexeeyay sanamyada iyo shayaadiinta ee Kumbh (dheri) dareere macaan uu ku jiro kaas oo soo baxay intii laga goobayay bad-weynta.\nXigashada Sawirka, Ankit Srinivas\nMarkii ay labada dhinac ku dagaallameen dareeraha ku jiray dheriga, dhowr dhibcood ayaa soo daatay oo ku dhacay afar magaalo - Prayagraj, Haridwar, Ujjain iyo Nasik.\nKumbh mela waxaa laga abaabulaa dhammaan afarta magaalo, balse xafladaha ugu weyn ayaa had iyo jeer lagu qabtaa Prayagraj.", "date": "2025-01-14", "scraped_at": "2025-10-29T17:31:29.416480+00:00", "category": "news", "text_hash": "6cb0d3819607c959f915f356e67c9369fa43020e9dc03feb679a0f883dcf1ed4", "minhash_signature": "98350,15505614,1162197,2415140,5843677,5709428,12828286,5063557,463782,1841859,1843640,681851,1151866,3820165,2693228,1046180,948960,1820327,6885120,2176808,2176434,5327550,4857836,13192138,6271955,4062751,1775773,28995776,19986865,5382590,7196890,13846784,6121465,761439,3164804,24129788,6668254,8599894,8678369,6424421,1437476,26125215,5433898,7288781,4320818,3227847,1460132,6927090,1180055,4849204,4122578,2279365,16435473,4619164,3063150,1542430,5780400,1402280,4795734,15860310,3023916,2515453,23978,927122,2037741,20386485,8710020,9400825,4043809,5138872,1101825,24483616,4885536,9605229,11917560,194134,2732652,8319345,14123512,8470072,1733051,8555804,3235068,1444135,5699009,98145,3102562,2286305,1961622,1393287,1770063,1115508,9678345,8382100,7591056,11919622,2086166,2801394,1492760,8259742,7825447,2182689,3890641,339610,19778565,7492946,804124,2875755,1525639,5345713,14367154,610182,448018,2199905,1803189,10147496,9073896,5026110,3870698,4771502,5406883,2870158,14585027,9277044,1973906,3837552,8223129,4470467"}
{"url": "https://www.bbc.com/somali/articles/c14per1763no?at_medium=RSS&at_campaign=rss", "title": "Maxay yihiin tallaabooyinka ay Somaliland xalka ugu raadinayso nidaamka E-Visa ee 'saameynta ku yeeshay'?", "text": "Xigashada Sawirka, Getty Images\nSomaliland ayaa sheegtay in ay weli ku hawlan tahay xal u raadinta cabasho muddooyinkii u dambeeyey ay muujinayeen qaar ka mid ah dadka reer Somaliland ee sita baasaaboorada ajaanibka ah ee ka soo noqonaya qurbaha, kuwaas oo nidaamka E-visaha ee Soomaaliya uu saameeyey.\nDiyaaradha ayaa shuruud uga dhigay u safraya Somaliland in ay haystaan dalku galka Soomaaliya, taas oo dadka qaar ay cabasho ka muujiyeen.\nWasiirka Wasaaradda Duulista Hawada iyo Horumarinta Madaaradda ee Somaliland Fu'aad Axmed Nuux oo shalay ay u yeedheen guddi hoosaadka arrimaha dibedda u qaabilsan Golaha Guurtrida ee Somaliland, si wax looga weydiiyo caqabad dhinaca socdaalka ee soo wajahay dadka reer Somaliland ee dibeddaha ka soo noqonaya, ayaa sheegay in Xukuumaddu wado dedaallo iyo qorsheyaal xal loogu raadinayo caqabadaha dhinaca Somaliland ah ee taagan.\nFu'aad Axmed Nuux, oo weriyeyaasha la hadlay kulankaas ka dib, ayaa sheegay in ay dhibaatada ka taagan socdaalka ay tahay mid culeys ku haysa maamulka hawada.\n\"Nasiib darro wada hadalladii Somaliland la furtay Soomaaliya ayaa keenay in hawadii ay Qaramada Midoobay maamulaysay in lagu soo celiyo gacanta Soomaalida\", ayuu yiri wasiir Fu'aad.\nEnd of Ugu akhris badan\nSomaliland ayaa u muuqata in aysan ku qanacsanayn in dadka u safraya dhulkooda la waydiiyo dalku galka E-visa.\nWasiirka Duulista hawadu waxa uu sheegay in ay qaadeen taalaabooyin ay xal ugu raadinayaan cabashada ka timid dadka safraya qaarkood.\n\"Waxaanu warqado aanu mowqifkayga ku cadaynayno u dirnay Qaramada Midoobay, ICAO, Mareykanka, Taiwan, Itoobiya, midowga Yurub iyo Midowga Afrika. Waxa kale oo noo socda arrimo sharci oo aan ku doonayno in aan kaga baxno wada hadallada hore ee Soomaaliya lala furay,\" ayuu yiri wasiirku.\nWaxa uu ilduuf ku tilmaamay heshiiskii lagu soo wareejiyay hawada Soomaaliya.\n\"Dadka reer Somaliland waxaan u sheegaynaa marka arrimaha noocan oo kale ahi socdaan, waa arrimo farsamo oo u baahan shuruuc iyo nidaam sharci oo la maro, taxadirkoodana u baahan,\" ayuu u sheegay warbaahinta.\nXigashada Sawirka, Somaliland\nDhinaca kale war-saxaafaddeed Wasaaradda Duulista Hawada ay soo saartay toddobaadkii hore ayey ku sheegtay in ay diyaaraddaha yimaada Somaliland waayi doonaan ogolaansha Isticmaalka madaaradda Somaliland ay hadii ay u hugaansami waayaan awaamiirtooda.\n\"Wasaaraddu iyada oo gudanaysa waajibaadkeeda dastuuriga ah ayay qaaday dhammaan tallaabooyinkii loo baahnaa, isla markaaan diyaaradaha ka hawl-gala madaaradda Somaliland iyo kuwa isticmaala xuduud-haweedka Somaliland ay si dhammaystiran u raaci doonaan shuruucda duulimaadyada iyo Socdaalka ee Somalialnd, ciddii u hoggaansami waydaana ay luminayso oggolaanshaha isticmaalka madaaradda iyo hawada sare ee Somaliland\", ayaa lagu yir warsaxaafadeedka.\nWaxaa xusid mudan in Soomaaliya iyo Somaliland uu dhexmaray muran ku salaysan maamulka hawada sanadkii 2024 ka. Murankaas ayaa ka dhashay kadib markii diyaaradda Itoobiya ay u hoggaansami waysay amar ka soo baxay dowladda Soomaaliya. Intaas ka dib ayaa waxaa xigay diyaarado laga celiyay hawada Soomaaliya.", "date": "2025-10-27", "scraped_at": "2025-10-29T17:32:29.383145+00:00", "category": "news", "text_hash": "04ca0871b45372ccaf17676e283e21d9b6ac9bb175bd43a930258ca89ac39da3", "minhash_signature": "1123128,3286680,412105,26482766,9109688,2556229,10816072,1282661,3649674,11872815,8417600,4652693,9243839,43154,23612472,5598541,7344957,10774366,22703454,9119295,13826897,995764,19909306,4436629,3925867,14136643,8762677,892653,7139210,14497063,12968637,19116303,3956762,1204182,10053046,8390597,27801110,4936731,22736837,3437655,17984503,14916674,13022857,16139116,23756536,3115655,10276694,61789544,6446765,17680590,10701523,15852564,17313419,1134566,1657095,292347,10304810,3382399,8604736,1053916,8978141,16703681,43472372,2880758,10961520,8957280,20305767,3790242,618034,1888443,5238017,566156,5588889,7089375,8641409,7342376,2994126,6927443,9925168,13624669,8427919,22187891,1577435,4383264,3536131,15711498,7106770,8111782,7374819,4347730,2388294,3140059,59115885,8430666,19865747,2669788,6750294,5557091,796085,2873784,3355743,8830523,8948419,5566865,14829853,3856038,9623125,4721378,12073916,18847403,2897716,9871797,3834582,17067371,15102848,2177534,2304923,10248407,13392788,2718892,2086776,2606507,28615373,16950705,22071464,2599779,3766242,5208372"}
{"url": "https://www.bbc.com/somali/articles/cx2x1dlvvkyo", "title": "Taariikh cusub oo qorantay: saddex dumar ah oo markii ugu horeysay u taagan madaxtinimada Tanzania", "text": "Markii ugu horreysay taariikhda siyaasadda xisbiyada badan ee Tanzania, haweenka u tartamaya xilka madaxweynenimo ayaa soo muuqday iyagoo tiro badan leh iyo heer siyaasadeed oo aad uga sareeya sidii hore weligeed la arki jiray.\nDoorashada guud ee 2025 waxay noqon doontaa mid uu madaxweyne dumar ah difaacanayso kursigeeda, iyadoo ay jiraan laba dumar ah oo kale oo wata calamada xisbiyada mucaaradka.\nWaa doorasho leh saddex dumar ah oo u taagan madaxweynenimo, taasoo muujinaysa isbeddel weyn oo dhanka siyaasadda iyo bulshada ah.\nFalanqeeyayaashu waxay leeyihiin xaaladdani ma aha oo keliya natiijada siyaasadda xisbiyada gaar-gaar ah. Waa calaamad muujinaysa in bulshada reer Tanzania, iyada oo loo marayo doodda dadweynaha iyo waaya-aragnimadii sannadihii la soo dhaafay, ay bilaabeen inay aqbalaan hoggaanka haweenka ee jagooyinka sare.\nHalka doorashooyinkii hore lagu tirin jiray haweenka faro ku tiris, hadda 2025 wuxuu isu beddelayaa sanad taariikhi ah oo joogitaankooda ay miisaan cusub ku yeelatay doodaha siyaasadeed.\nEnd of Ugu akhris badan\nMarkii ugu horreysay ee magac dumar ah lagu arkay warqadda codbixinta madaxweynaha waxay ahayd 2005, markaas oo Anna Senkoro ay u tartantay madaxweynenimada iyada oo matalaysa xisbiga PPT Maendeleo.\nInkasta oo ay kaalinta siddeedaad ka gashay tartanka toban musharrax, haddana tallaabadeedu waxay furtay waddo ay haween kale ku dhiirradaan. Doorashooyinkii ugu horreeyay ee xisbiyada badan ee 1995 iyo kuwii xigay ee 2000 kama aysan qaybgalin wax musharrax dumar ah.\nTobban sano kadib, Anna Mghwira oo ka socotay xisbiga ACT waxay kaalinta saddexaad ka gashay doorashadii 2015, taas oo calaamad u noqotay bilowga muuqashada haweenka ee jagada ugu sarreysa ee dalka. Si kastaba ha ahaatee, doorashooyinkii 2015 iyo 2020, matalaadda haweenku way koobnayd. Cecilia Mwanga (Demokrasia Makini) iyo Queen Sendiga (ADC) ayaa u tartamay 2020, balse waxay ku dhammeysteen meelo hoose.\nTallaabadii ugu weynayd waxay timid 2021, markaas oo Samia Suluhu Hassan, ahayd ku-xigeenkii Madaxweyne John Magufuli doorashooyinkii 2015 iyo 2020, loo dhaariyay madaxweyne kaddib geeridii Magufuli.\nMarkii ugu horreysay taariikhda Tanzania iyo Bariga Afrika, waddan waxaa hogaaminayay madaxweyne dumar ah. Dhacdadan waxay u muuqataa inay noqotay dhiirrigelin siyaasadeed oo isbeddel horseeday. Tan iyo markaas, doodda ku saabsan kaalinta haweenka ee hoggaanka waxay yeelatay xoog cusub.\nSanadka 2025 wuxuu noqonayaa rikoodh cusub oo dhinaca haweenka ah.\nXigashada Sawirka, TBC\nSanadkan, taariikh cusub ayaa ka qorantay dalka Tanzania. Waa markii ugu horreysay oo saddex haween ah ay si rasmi ah ugu tartamayaan xilka madaxtinimada dalka.\nSamia Suluhu Hassan oo ka socota xisbiga CCM, ayaa u tartameysa muddo-xileedkeedii ugu horreeyay iyadoo hore xilka u heshay kaddib geeridii madaxweynihii hore, John Magufuli. Sida dastuurka dhigayo, haddii ay doorashada ku guuleysato, tani waxay noqon doontaa muddo-xileedkeedii ugu dambeysay.\nMwajuma Noty Mirambo oo ka tirsan xisbiga UMD, waa siyaasi hore uga soo shaqeysay ciyaaraha, kadibna u gudubtay golayaasha deegaanka, iyadoo dhowr jeer isku dayday iney gasho baarlamaanka. In kastoo ay la kulantay caqabado badan, maanta waxay sheegaysaa inay diyaar u tahay hoggaanka ugu sarreeya dalka.\nSaum Hussein Rashid oo ka socota xisbiga UDP, ahna xoghayaha guud ee xisbigaas, waxay si xooggan u taagan tahay u doodidda sinnaanta jinsiga iyo la dagaallanka tacaddiga lagula kaco haweenka. Iyaduna waa musharax kale oo kamid ah haweenka u tartamaya madaxtinimada.\nMarka lagu daro musharaxiintan, 10 xisbi oo kale ayaa haween u doortay iney noqdaan ku-xigeennada madaxweyne (running mates). Waa markii ugu horreysay ee Tanzania ay aragto tiro intan la eg oo haween ah oo doonaya xilalka ugu sarreeya ee dalka. Inkastoo doorashada ku-xigeennada sida caadiga ah loo eego aragtiyo juqraafiyeed iyo siyaasad, sanadkan waxaa muuqata in xisbiyadu ay xoogga saareen sinnaanta jinsiga.\nGuud ahaan, 18 xisbi ayaa ku jira tartanka madaxtinimada, waxaana tallaabada ay qaadayaan xisbiyada yaryar oo haween u soo xulay musharraxnimada lagu tilmaamay mid muujinaysa in doorashadan ay tahay \"doorashada haweenka\".\nXigashada Sawirka, CCM\nFalanqeeyayaashu waxay leeyihiin go'aanka xisbiyada ay haweenka ugu doorteen musharaxnimo wuxuu ka tarjumayaa isbeddelada bulshada iyo siyaasadda ee dalka ka jiray 15-kii sano ee la soo dhaafay.\nWaxbarashada, wacyigelinta xuquuqda haweenka iyo tusaalaha ay dhigtay Madaxweyne Samia ayaa lagu sheegay iney yihiin sababaha sare u qaaday kalsoonida haweenka ee hoggaaminta.\nMohammed Issa, oo ah falanqeeye siyaasadeed, ayaa yidhi:\n\"Wacyi bulsho wuu jiraa, haweenka tartamayana waa bateen, laakiin marka la barbar dhigo ragga weli taageeradu waa yar tahay.\"\nMararka qaar, xisbiyadu waxay siyaasadda ugu arkaan iney haweeney musharrax soo saaraan si loo helo wejiyo cusub, gaar ahaan xilligan oo codbixiyeyaasha intooda badan yihiin dhalinyaro iyo haween.\nMwajuma Mirambo oo doorashooyin badan u tartantay xilal kala duwan, waxay leedahay:\n\"Sanadihii hore way adkeyd. Dhaqanka ayaa haweenka gadaal  dhigay. Laakiin maanta waxaan aaminsanahay in haweenku ay hogaamin karaan, bulshadaana waxay bilowday iney nagu kalsoonaato.\"\nWaxay sheegtay in isbeddelkan uu ku dhiirrigeliyay in markan xitaa haweeney mucaarad ah ay guul gaadhi karto.\nXigashada Sawirka, INEC\nIn kasta oo tirada haweenka musharraxiinta ah ay korodhay, haddana caqabado weli way jiraan. Xisbiyada siyaasadeed ee Tanzania waxaa wali ka taliyo ragga, haweenkuna marar badan ma haystaan dhaqaalihii ama shabakadihii siyaasadeed ee lagama maarmaanka u ahaa olole weyn.\nTani waxay ka dhigan tahay in kaliya in haweeney musharrax tahay aysan macnaheedu ahayn in fursad fiican ay haysato.\nMohammed Issa wuxuu intaas ku daray:\n\"Haddii laga reebo Samia Suluhu Hassan oo ka socota CCM, musharraxiinta kale ee haweenka mucaaradka ah taageero badan ma haystaan. Dhab ahaantii mucaarad weyn lama arko, xataa dhex-dooda, sidaas darteed ma sahlana in si dhab ah la isu barbar dhigo ragga iyo haweenka.\"\nHanaanka doorashada ayaa sidoo kale dhaleeceyn la kulmay, gaar ahaan sidii ay u sinnan lahaayeen xisbiyada yaryar. Musharraxiinta sida Mwajuma iyo Saum Rashid waxay wajahayaan mishiinka siyaasadeed ee xooggan ee CCM  waana tijaabada ugu weyn.\nSidoo kale, fikirrada bulshada ee horey uga jiray arrimaha haweenka iyo hoggaanka, gaar ahaan miyiga, weli ma dhammaan.\nLaakiin, natiijada doorashada kasta si walba ha noqotee, waa bilowga waqti cusub oo aysan suurtagal noqon doonin in siyaasadda Tanzania looga hadlo iyadoo aan haweenka lagu darin.\nTaariikhda hoggaamiyayaashii haweenka ee hore sida Titi Mohammed, Lucy Lameck iyo kuwo kale wali way xasuusanyihiin, balse jiil cusub ayaa hadda qoraya bog cusub oo taariikhdan ah.\nBishan October 2025 waxii ka danbeeya, ma noqon doontaa doorasho mar ah oo kali ah  mise waxay noqon doontaa bilowga waqti cusub oo loo siman yahay jinsiyad ahaan, siyaasadda Tanzania gudaheeda?", "date": "2025-10-02", "scraped_at": "2025-10-29T17:33:31.208336+00:00", "category": "news", "text_hash": "905f58d540795816ec293174f829010f9ba32729925371287dbd5d28c31c3f28", "minhash_signature": "4139935,9193100,1526874,7203836,5375883,7006655,3043815,4433028,4166273,1247359,999620,288077,1860789,1311048,7144766,2048507,1674497,4780021,4004257,5782242,1223540,1582035,2623630,15565217,17211279,4783070,5570314,36459952,4393719,4624171,19948228,1170736,143785,1018386,760728,85387,1500642,1028935,3642282,5718977,6167965,409114,969511,209967,183490,1021558,3423577,2695101,3833931,1884710,619540,12020277,3551481,8151446,1473658,1098336,908986,1156638,8614245,955371,1045198,1502620,10177741,761992,8391982,6874767,944166,9977099,306998,1647578,4652022,14205925,600977,835018,5859872,2975168,9097311,10162214,4817567,597542,12824091,3230309,1476059,8971235,19460912,19416377,11959378,20910458,176787,4423296,3088655,3979197,6610445,4407365,1903688,1832726,712539,820457,1227304,10597913,3806895,2004249,36393,6236173,8985400,1227427,14532274,4102469,908075,2566105,6127026,790695,2626736,2408759,3715021,471032,1284635,13713066,614843,425648,427653,8058213,2037717,255354,447603,3077201,386421,20684414"}
{"url": "https://www.bbc.com/somali/articles/c3dnk48m50ro", "title": "Newcastle oo sahaminaysa soo celinta Elliot Anderson - Xanta kubadda cagta", "text": "Xigashada Sawirka, Getty Images\nNewcastle United ayaa sahamineysa inay Elliot Anderson dib ugu soo celiso kooxda, madaxa Bayern Munich ayaa sheegay inuusan jirin wax lagu burburin karo qandaraaska Michael Olise, dhanka kalana Harry Maguire ayaan weli Manchester United u soo bandhigin wax heshiis cusub.\nNewcastle United ayaa sahmisay suurtogalnimada ay dib ugu soo celin karto ciyaaryahanka khadka dhexe ee England Elliot Anderson, oo 22 jir ah, ka dib markii ay ka iibiyeen Nottingham Forest sanadkii 2024 kii.\nAgaasimaha ciyaaraha ee Bayern Munich Max Eberl ayaa sheegay in 23 jirka garabka uga ciyaara France Michael Olise, kaasoo lala xiriirinayo kooxo badan, aysan jirin wax lagu burburin karo qandaraaskiisa, kaasoo soconaya ilaa June 2029. Waxaa sidaas qoray (Talksport).\nManchester United ayaa weli xiiseyneysa 24 jirka qadka dhexe ee daafaca Jarmalka Angelo Stiller, laakiin qiimaha Stuttgart ee 24 jirkaan ayaa la filayaa inuu ka badan yahay € 50m (£ 43.5m). (Sky Sports Germany), ayaa sidaas qortay.\nCiyaaryahanka khadka dhexe ee Atletico Madrid Conor Gallagher ayaa sidoo kale bartilmaameed u ah Manchester United, kuwaas oo u arka 25-sano jirkaan bedelka suurtagalka ah ee xiddiga kale ee England Kobbie Mainoo, oo 20. jir ah (Insider Football), ayaa sidaas qortay.\nEnd of Ugu akhris badan\nDaafaca dhexe ee England Harry Maguire ayaa laga yaabaa inuu si bilaash ah uga tago Manchester United marka uu qandaraaskiisu dhaco xagaaga soo aadan, iyadoo kooxda Old Trafford aysan weli u soo bandhigin 32 jirkaan heshiis cusub.\nAston Villa iyo Newcastle United ayaa ka mid ah kooxaha doonaya 21-jirka FC Porto iyo xulka Spain Samuel Omorodion, kaasoo horay ugu dhawaaday inuu ku biiro Chelsea, isla markaana wadahadalo la yeeshay Nottingham Forest.\nDaafaca reer England Fikayo Tomori ayaa wadahadalo heshiis kordhin ah kula jira AC Milan, 27 jirkaan ayaa sheegay inuusan dooneynin inuu ka tago kooxda Serie A.\nWeeraryahanka Faransiiska Jean-Philippe Mateta, oo 28 jir ah, ayaa loo maleynayaa inuu doonayo inuu ka tago Crystal Palace, iyadoo Manchester United, Newcastle United iyo Tottenham ay macquul tahay inuu tago.\nWest Ham ayaa isha ku heysa 24 jirka weerarka uga ciyaara Netherlands Joshua Zirkzee waxaana laga yaabaa inay isku dayaan inay amaah ugala soo wareegaan Manchester United bisha Janaayo.\nBorussia Dortmund ayaa laga yaabaa inay amaah ku dirto 20 jirka khadka dhexe ee Ingariiska Jobe Bellingham, kaasoo ay kala soo wareegeen Sunderland xagaagii hore.\nCiyaaryahanka khadka dhexe ee Ingariiska Samuel Alker, oo 16 jir ah, ayaan weli aqbalin inuu heshiis xirfadle ah u saxiixo Leeds United marka uu 17 jirsado bisha Maarso, waxaana xiiseynaya Borussia Dortmund iyo Bayer Leverkusen.", "date": "2025-10-24", "scraped_at": "2025-10-29T17:34:29.884913+00:00", "category": "news", "text_hash": "7f16113198c8140428e94d369a4e2ecff19ad72d9d166464a0df3b45bb850565", "minhash_signature": "509544,18407664,6338208,2746040,5452920,11862853,15265364,27988889,12748680,15184040,1145370,6578165,6077770,4424234,10982931,5383791,5481930,4062296,12904305,1856941,31695474,49446920,847683,1339642,3108632,4480477,9123105,7075104,686140,4346229,25326198,3135013,9427707,3026661,7935059,721272,50156172,14958010,10398977,370408,12562601,2282156,8589460,14373894,12082623,2706217,33460635,26301871,1122405,21201245,954838,8551042,11722281,1103079,5042889,14501986,7983056,32286,10603716,2111061,368207,5617451,242581,3081545,3728226,32562901,13888875,4605778,9778522,9550226,7232328,4024583,4214880,1278150,12777473,9589268,2994126,3942616,19042229,28983112,16296480,14974153,5023678,19906091,9000924,11074820,3579926,12472589,9839426,12273077,24998698,13789593,11389886,6176650,15624447,5178219,2514873,6582396,1492760,339509,23213095,2169920,2705666,3728429,2463104,18598923,168127,8716798,13655421,33096725,22315314,5543966,3879637,23528967,24330821,1430292,14700058,22421335,1841939,32474283,15522870,31874327,10463869,14451477,11269667,22784702,2874510,11653236"}
{"url": "https://www.bbc.com/somali/articles/cyv61zv5nnzo", "title": "Maxaad ka taqaan masaajidka Qiblateyn ee ka mid ah kuwa ugu faca weyn Afrika", "text": "Xigashada Sawirka, Wikipedia\nXukuumadda Somaliland ayaa ku dhawaaqday inay doonayso inay dayactirto masjidka qadiimiga ah ee taariikhiga ah ee  la yiraahdo Qiblateyn, kaasoo ku yaalla magaalada Seylac.\nCabdullaahi Daahir Jaamac oo ah wasiirka awqaafta iyo arrimaha diinta ee Somaliland ayaa BBC u xaqiijiyey qorshaha dib u dhiska masjidka ee xukuumaddiisa, isagoo ka mid ahaa guddi wasiirro ka kooban oo halkaa u tegey inay soo daraaseeeyaan, kana talo bixiyaan sida loo dayactiri karo masaajidka.\nMasaajidkan oo caan ku ah labo mixraab ama qiblo oo uu leeyahay, ayaa lagu tilmaamaa in uu astaan u yahay soo gaaritaankii diinta islaamka ee Afrika.\nWasiirka ayaa BBC u sheegay in sababta ay u dayactirayaan masjidka ay tahay maadaama uu taariikh fac weyn u leeyahay Islaamka.\n\"Umad walba taariikhdeeda way uruurisaa, sidaa darteed ayaa madaxweynaha Somaliland wuxuu dhawaan magacaabay guddi ay wasaaradda arrimaha diinta hogaaminayso, waxaana loo xilsaaray in masjidkaas xaaladiisa iyo dib u dhiskiisa ka hawgalaan, safarkayagana arrintaas ayuu ku saabsanaa\" ayuu yiri wasiirku.\nEnd of Ugu akhris badan\nWuxuu intaa ku daray in masjidka taaariikhdiisa aad loo ilaaliyey, ayadoo labadii qiblo ay sidoodii u jiraan.  \"Waxaa wax lagu farxo ah in raadkii masjidka uu weli nool yahay oo meel laga duuli karo oo dayactirkiisa laga bilaabi karana uu taagan yahay\" ayuu yiri mar uu ka hadlayey wixii ay la soo kulmeen ka guddi ahaan.\nWasiirku ma uusan faahfaahin qaabka ay dib u sdhiska u wajihi doonaan, laakinse wuxuu sheegay in maadaama masjidkan uu yahay goob taariikhi ah uu dib u dhiskiisa ka duwanaan doono masaajidda kale, ayadoo taariikh badan la baari doono, khubarana lala kaashan doono.\nWasiirka arrimaha diinta ayaa sheegay in uu masaajidkaas sii ahaan doono goob cibaado, isagoo dhanaka kalena noqon doono goob taariikhi ah oo ay dadku soo booqdaan.\nMaxamuud Sheekh Axmed Dalmar waa aqoonyahan arrimaha Islaamka ka faallooda, wuxuu ka warramay sababta uu masjidkaas magaca 'Qiblateyn' kula baxay.\nXigashada Sawirka, HCC\n\"Horta kolley taariikhdaasi baadhis badan bay u baahan tahay, waxay se tilmaamaysaa taariiikhda islaamka wakhtigii aan jasiirad carab aan la soo dhaafin, Nebigu NNKH intii aan la hijroon ee uu Maka joogay, marka uu tukanayo waxay qibladiisu ahayd Quddus oo looma tukan jirin Maka. Markaa waxaa jira masjid ku yaalla Madiina agagaarkeeda oo la yidhaahdo Qiblatayn, oo iyadoo lagu tukanyo oo loo jeedo Quddus ayay aayadi soo degtay oo xaggii Quddus oo waqooyi ahayd laga jeestay oo koonfur oo ay markaa Maka ka xigtay loo jeestay, sidaana Masjidkii labada qiblo lahaa loogu bixiyey, kan se ma hubo oo taariikh bay u baahan tahay. Waa suuragal in yadoo xaggaa loo tukado ay soo gaadhay in Maka ay sax tahay, iyo in ay tahay muujinta taariikhaas si loo xasuusnaado\" ayuu yiri Sheekh Dalmar.\nDadka yaqaanna masjidkan taariikhiga ah waxay sheegaan in la dhisay qarnigii 7aad, inkastoo aan si madax banaan loo xaqiijin.\nDhismahan qarniyaasha jira ayaa waxaa soo gaaray burbur balaaran.  Waxaa jira meelo qodmay iyo meelo uu ka muuqdo aasaaska masjidka.  Sannadkii 2007 ayaa arrintaas iyo dayactir la'aanta masjidka haysata waxaa lagu xusay warbixin uu xaaladda masaajidkaas ka diyaariyey khabiir warbixinta u diray UNESCO.\nXigashada Sawirka, X\nSheekh Nuur Abukar Qaasim oo ah Aqoonyahan Soomaaliyeed ayaa bartiisa X ku qoray in labada mixraab ee masjidka ay taagnaayeen ilaa 2016, markaas oo uu dumay gidaarkii xigay dhinaca qiblada.\nAqoonyahannada ayaa sheegaya in masaajidka uu maray dhowr marxaladood oo dayactir ah, ayadoo labada mixraab ay aad isugu dhow yihiin oo ay isku jiraan 2-3 darajo.\nMasaajidka Qiblateyn waxaa kaloo xeyndaabkiisa ku yaalla qabriga Sheekh Babu Dena.\nMasjidka Qiblateyn ayaa ka mid ah kuwa ugu faca weyn qaaradda Adrika, waxaana isku wakhti la dhisay isaga iyo masjidu saxaaba oo ku yaalla Massawac, Eritrea iyo Masaajidka Al Nagashi ee ku yaalla Itoobiya.\nIlaa hadda waxaa la ogyahay in uu jiro masjd ku yaalla Madiina oo isgana leh laba mixraab.", "date": "2025-09-30", "scraped_at": "2025-10-29T17:35:29.990820+00:00", "category": "news", "text_hash": "66d64694f2bccbebbbf9585961dae88440116da9d3a3315c633d5a837549c272", "minhash_signature": "3271083,14043013,2147681,1307547,13812132,7204899,1791341,5164655,1342468,7047966,2389551,1054646,2780419,15726196,291107,28415329,2245732,3018814,341759,1829565,1129759,8358145,234574,896683,10496211,4143403,4072062,17715146,6063701,4415294,18022916,822662,11695412,9213366,7040364,1397425,1774737,1747185,8277094,7458342,170582,5971462,7011846,10116716,12081838,844876,71208,10260726,11347017,7431405,10028979,2059512,13251219,15470589,2684046,11641010,5122329,8917456,2135870,6796723,14612718,256822,2097636,827482,1104052,2766391,22504486,616949,5563121,10592481,10660746,3378983,4511061,9432295,3066902,6862429,389781,4590718,3330209,17928939,5222810,6603528,4818424,8504389,1459702,4229868,10559625,13632,9796879,13764889,9254633,1259425,6973988,1535060,3701443,34089301,10272568,6582396,1492760,17652362,3208148,24724683,4739371,2643305,2968226,3289530,15136779,4868123,8019611,6371570,1009201,16011731,5564528,5193173,3936462,16683706,4195543,561811,7202501,741036,5098039,3180083,8104085,1591002,6244906,395412,4598474,3358644"}
{"url": "https://www.bbc.com/somali/articles/cx2pe6pj2m7o", "title": "Sidee loo go'aamiyaa abaalmarinta nabadda ee Nobel ee 2025 ee ay ku guuleystay María Coria?", "text": "Xigashada Sawirka, NobelPrize\nHoggaamiyaha mucaaradka Venezuela María Coria Machado ayaa la guddoonsiiyay abaalmarinta nabadda ee Nobel Peace Prize 2025.\nMachado, oo 58 jir ah, ayay guddiga Nobel-ka ku ammaaneen in ay tahay \"mid ka mid ah tusaalayaasha aan caadiga ahayn ee geesinimada rayidka ee Latin America waayadii u dambeeyay\". Waxay qaaday olole ka dhan ah madaxweynaha Venezuela Nicolás Maduro Moros, oo xukunkiisa 12 sano ay dad badani u arkaan mid aan sharci ahayn.\n\"Aqoonsigan baaxadda leh ee halganka dhammaan dadka reer Venezuela waa dhiirigelin aan ku soo gabagabeyno howsheenna: Waan inaan helbo xorriyad,\" Machado ayaa sidaas ku tiri hadal ay soo saaray.\nMagacaabista ama musharaxnimda ayaa xiranta 31 Janaayo. Xubnaha guddiga waxay samayn karaan magacaabistooda ugu dambayn kulankooda ugu horreeya ee Febraayo.\nWaxay ka wada hadlayaan dhammaan magacaabista, ka dibna waxay dejiyaan liis kooban. Qof kasta oo la magacaabo ayaa la qiimeynayaa oo waxa baaraya koox la-taliyayaal joogto ah iyo khubaro kale.\nEnd of Ugu akhris badan\nGuddigu waxay kulmaan bishiiba hal mar si ay uga hadlaan magacaabista. Go'aanka wuxuu u eg yahay in la gaaro bilaha Agoosto ama Sebtembar, ayuu yiri Harpviken.\nGuddidu waxay is-afgarad ka gaaraan xulitaankooda. Haddii aysan gaarin go'aan wadajir ah, go'aanka waxaa lagu gaarayaa cod aqlabiyad ah.\nMarkii ugu dambeysay ee xubin guddiga ka mid ah ay shaqada uga tagto iyadoo mucarada ah ama wax diiddan waxay ahayd 1994-kii, markaas oo hoggaamiyihii Falastiin Yaasir Carafaat uu abaalmarinta la wadaagay Shimon Peres iyo Yitzhak Rabin ee Israa'iil.\nIyadoo liiska buuxa ee magacaabista uu yahay mid sir ah, musharaxiinta waa u madax banaan yihiin inay shaaciyaan laakin ma jirto si loo xaqiijiyo waxa ay shaciyeen.\nMagacyada sanadkan la shaaciyay waxaa ka mid ah Maxkamada Caalamiga ah ee Dambiyada, NATO, Chow Hang-tung oo u ololeeya Hong Kong oo xiran iyo Qareenka Xuquuqda Aadanaha ee Canada Irwin Cotler.\nHogaamiyayaasha Cambodia, Israa'iil iyo Pakistan ayaa sheegay inay magacaabeen madaxweynaha Maraykanka Donald Trump. Magacaabistooda waxaa la sameeyay gu'gii iyo xagaaga taas oo ka dambeysa waqtiga kama danbeysta ah ee magacaabista ee 31-da Janaayo, markaa ansax ma noqoneyso in ay ka mid noqoto abaalmarinta 2025.\nWaxa uu helayaa Bilad, shahaado, 11 milyan oo lacagta Swedishka ah ee krone, taas oo u dhiganta ($1.19 milyan) iyo tixgelin degdeg ah oo caalami ah.\nWaxa lagu dhawaaqi doonaa maalinta Jimcaha ee 10ka Oktoobar saacadda markay tahay 12:00 wakhtiga Afrikada Bari, taas oo looga dhawaaqayo Machadka Nobel ee Norway ee Oslo, waxana ku dhawaaqi doona guddoomiyaha guddiga, Joergen Watne Frydnes.\nXafladan ayaa ka dhici doonta hoolka shirarka ee magaalada Oslo 10-ka bisha Disembar oo ku beegan sanad guuradii ka soo wareegatay geeridii Alfred Nobel.", "date": "2025-10-10", "scraped_at": "2025-10-29T17:36:29.829742+00:00", "category": "news", "text_hash": "ab67532695986f5b6f73b6ca5f658511bdfe42735ee0450d26315d9bd31c399a", "minhash_signature": "5255968,2422132,17169987,7764608,644731,2727001,10521856,10936109,691119,9261139,626158,3715658,462059,35774218,3202456,22685620,627446,643969,413138,16667368,2602393,497643,665829,49076927,20553037,4799004,4337543,15701827,16661448,54667935,4278628,1408377,15098745,9063744,4448554,887389,133818,5597215,11842896,3128279,8119580,60292092,4521215,27608192,7370281,5983340,22405233,40243066,7366857,47677331,4004658,2143045,14694399,8085109,1925925,17486514,1981519,246131,4970516,14187786,27514119,28818025,4551966,1459184,14152752,7937843,10042986,29888279,35175719,698561,11427050,10591560,14953688,16340759,13477062,2530171,3766665,9860139,163177,6316933,10489373,3554861,513467,12367617,28178364,12257769,7122533,3157921,16172131,3710058,15217812,20791465,6665592,12040260,3696990,10999062,518166,2440126,1492760,17504082,3014392,10161568,17706596,3782917,3430275,1586892,273177,3442801,19615900,7069877,66912180,18137370,850322,3069491,3954282,7327599,14302163,15139463,16240713,16200365,3922056,5392373,9278549,30840109,7716899,276343,9858714,6314036"}
{"url": "https://www.bbc.com/somali/articles/cg5e0d15d66o", "title": "Trump oo toban arrimood ka sheegay Soomaaliya iyo Ilhaan Cumar", "text": "Xildhibaanadda Soomaalida ah ee Ilhaan Cumar oo ka tirsan Aqalka Kongareeska Mareykanka iyo Madaxweyne Donald Trump ayaa mar kale u muuqda in ay goradda is geli doonaan, kaddib hadallo kulul oo uu Trump warbaahinta u mariyay saacadihii la soo dhaafay.\nQoraal oo uu soo dhigay bartiisa Truth Social ayaa Mr. Trump waxa uu Ilhaan Cumar ku tilmaamay \"gabadh ka soo jeedda dal sabool ah oo colaado ragaadiyeen islamarkaana isku dayaysa in Maraykanka ay barto sida wax loo maamulo\".\n\"Dalka Ilhaan Cumar ka soo jeeddo ee Soomaaliya, wuxuu la daalaa dhacayaa dawlad-dhexe oo daciif ah, saboolnimo joogto ah, gaajo, argagixiso mar kale soo kacaysa, budhcad-badeed, tobannaan sano oo dagaal sokeeye ah, musuqmaasuq, iyo rabshado baahsan. Boqolkiiba 70 shacabku waxay ku nool yihiin saboolnimo aad u daran waxayna wajahayaan amni-darro iyo cunto yaraan baahsan.\"\nWaxa uu ku eedeeyay in Ilhaan Cumar ay guursatay walaalkeed si ay u hesho muwaadinnamada Maraykanka. Waxa kale tilmaamay in ay dalka Maraykanka ay u yeedhinayso waxa ay tahay in la sameeyo iyo sida loo samaysanayo.\nTrump oo Ilhaan Cumar ku dhaliilaya dalka ay ka soo jeeddo oo muddo dheer ku jiray dagaallo sokeeye ayaa muuqaal gaaban oo ku baahay baraha bulshada waxa uu ku yidhi:\nEnd of Ugu akhris badan\n\"Waxay ka soo jeeddaa Soomaaliya. Sidee bay yihiin hadda? Sidee dowladdoodu tahay? Madaxweyne ma leeyihiin? Golo wasiirro ma leeyihiin? Waxa uun ma leeyihiin? Booliis ma leeyihiin? Waan jeclahay dadka ka yimaadda meel aan waxba lahayn — waxba, gabi ahaanba wax la'aan ah — markaasna ay noo sheegayaan sida dalkeenna loo maamulo\".\nXigashada Sawirka, Getty Images\nXisbiga Jamhuuriga ayaa sare u qaaday ololahooda ay ku doonayaan inay ku aamusiyaan dhaleeceynta taariikhda Charlie Kirk, iyagoo beegsanaya xildhibaanka Dimuqraadiga ee Ilhaan Cumar hadallo ay jeedisay ka dib toogashadiisa, waxayna ku baaqeen in laga xayuubiyo doorkeeda guddiga dowladda.\nWareysi ay bixisay usbuucii hore, Ilhaan Cumar waxay ku sheegtay inay \"damqasho\" u hayso haweeneyda uu ka dhintay Kirk, laakiin waxay ku dhaleeceeysay kuwa soo jeedinaya saameynta garabka midig \"wuxuu rabay dood madani ah\". Waxay sidoo kale dhaleecaysay xildhibaanka Jamhuuriga Nancy Mace, iyada oo ku eedaysay \"inay dhibaatayso kuwa ay u aragto inay ka hooseeyaan\".\nMace ayaa hadda dib u soo jawaabtay qoraal ay soo dhigtay barta X: \"Waxaan gudbineynaa qaraar ah in @Ilhan laga xayuubiyo hawlihii guddigeeda ka dib hadalkeedii foosha xumaa ee dilkii Charlie Kirk\".\nQoraalkaasi xigay ayay ku dartay: \"Tallaabooyinka kala bar kuma filna, Ilhaan Cumar kuma filna qiyamka Mareykanka, boos kuma lahan Congress-ka, waana in la waaniyo\".\nKhilaafka u dhaxeeya Ilhaan Cumar iyo madaxweyne Trump ayaa muddo dheer soo taxnaa, xitaa muddo-xileedkiisii hore.\nXilligii uu madaxweyne Trump ku jiray ololaha doorashada, waxaa aad loo xusuusta hadal uu ka yiri Soomaalida ku nool Mareykanka oo ahaa in falal argagixiso ay kusoo kordhiyen Minnesota, oo haddii la doorto uu ka hortagi doono qulqulka qaxootiga iyo muhaajiriinta Soomaalida.\nWaxaa kale oo aad loo xusuusta hadal caan baxay oo ay tiri Ilhaan oo aha in dadka Minnesota aysan soo dhaweynin qaxootiga oo keliya, balse sidoo kale ay u diraan Washington, oo ay ula jeedday doorashadeedii maadaamma ay qaxooti ahaan dalka ku soo gashay.\nMarkii la dhaariyay lhaan Cumar aya waxay farta ku fiiqday arrimo ay kamid yihiin taageerada Trump uu siiyo dowladda Sacuudiga ee dagaalka ka wada dalka Yemen, waxaana ay ku baaqday in Trump uu joojiyo taageerada uu siiyo xulafada Sacuudiga uu hoggaamiyo ee dagaalka kau qaaday dalka Yemen.\nTan iyo markii la soo doortay Ilhaan Cumar, waxay fursad kasta oo soo marta u adeegsatay inay weerarto siyaasadaha Donald Trump, waxaana tusaale loo soo qaadan karaa markii ay ka hadashay hakadkii ku yimid adeegyada dowladda kadib markii madaxweyne Trump uu aqalka Kongreska ka dalbaday dhaqaale lagu dhisayo derbiga xadka Mareykanka iyo Mexico, si uu u ansixiyo dhaqaalaha lagu kala wadayo adeegyada dowladda.\nXigashada Sawirka, .\nXildhibaankan laga soo doorto gobolka Minnesota ayaa wacad ku martay in ay ka hor iman doonto qorshayaasha Trump ee ku aaddan dadka soo galootiga ah.\nWaxay sheegtay in ay la dagaallami doonaan qorshayaasha Trump uu doonayo inuu fuliyo\nIlhaan Cumar oo ka tirsan Congress-ka Mareykanka ayaa qoraal ay soo dhigtay boggeeda Facebook waxay tallaabada Trump ku tilmaamtay \"Shisheeye nacayb iyo mid naxariis darro ah islamarkaana aan Ameerika laga oggolaan\".\n\"Waxaan la dagaallami doonaa tallaabo kasta oo jidka ku soo jirta\" ayay intaa ku dartay.\nWaxa uu hadda ka hor bartiisa kusoo qoray \"TRUE!!! (waa run) isaga oo ka jawaabayay faallooyinka muxaafidka ee ah in Trump uu ku dhawaaqi doono xaalad degdeg ah oo qaran oo uu isticmaalo hantida milatari si uu u hoggaamiyo \"barnaamijka masaafurinta ballaaran\".", "date": "2025-09-19", "scraped_at": "2025-10-29T17:37:29.864270+00:00", "category": "news", "text_hash": "1185c0b8a0a5e1518b572ab693a755071efa2be41820115cbea1bef4054a5180", "minhash_signature": "4189613,3396961,6939556,4766324,6017429,4450499,7253303,547307,5286697,8778765,4935211,7844279,13038062,5103372,26230409,10716407,2814166,3447857,775639,7930989,329779,5949078,2834826,2561616,329045,2868017,7711646,8327680,13382390,9399682,1328208,480191,673036,118659,1077559,1026942,1904778,15982655,19581534,1883440,1009650,11840967,4203691,11598580,3072059,989367,7773802,538653,14281683,124624,3474099,8477545,1476777,3286499,1521205,3349500,1014072,1034118,4010095,10699821,11895477,9597218,4275578,850741,7169065,4215959,1236180,4544949,1367464,1637907,11375665,4732381,13570131,1443161,10654606,275175,12519951,5339090,267121,32794,12258,4327649,7598460,3680577,1061501,1355263,6436293,921258,2317924,1950100,801273,551783,2847863,1433526,1638426,6884534,3646999,11701251,1598419,3636378,8061764,962965,2864808,5689346,5578315,10592578,991022,16819380,2355772,837531,3817397,8214967,4503504,4799853,7096724,1430292,9594490,157472,4802778,1160363,2364037,2999256,3564292,2431681,6701850,4098881,764229,16236925"}
{"url": "https://www.bbc.com/somali/articles/cgkzj371nk0o", "title": "Maxaad ka ogtahay dadka garaadka macmalka (AI) u adeegsanaya inay 'Alle' kula hadlaan", "text": "Xigashada Sawirka, Prashanti Aswan\nDalka Hindiya iyo qeybaha kale ee caalamka, dadka cibaadeysanaya ayaa u weecanaya dhanka AI loo sameeyay hab ujeeddo leh iyagoo u isticmaalaya cibaadadooda diimeed. Maxaa dhacaya marka mashiinnadu ay noqdaan dallaalkeenna cusub ee ruuxiga ah?\nVijay Meel, oo ah 25 jir arday ah kuna nool Rajasthan, Hindiya, ayaa markii ay ka hor yimaadeen su'aalo iyo caqabadaha nolosha casriga ah u weecday dhanka Alle. Markii hore wuxuu la tashan jiray hoggaamiyeyaasha ruuxiga. Dhawaanahanse, wuxuu la tashi la sameeyaa GitaGPT.\nGitaGPT waa mashiin garaadka macmalka ah (AI) oo lagu tabobaray Bhagavad Gita, 'buugga barakeysan' ee Hinduuda. GitaGPT wuxuu u muuqdaa farriin-qoraaleed caadi ah oo aad weydaarsan lahayd saaxiib – marka laga reebo AI-du waxay kuu sheegeysaa inaad la sheekeysaneyso Alle.\n\"Markii aan kasoo bixi waayay imtixaanaadkeygii bankiga, waan murugooday,\" Meel ayaa sidaa yiri. Balse kadib markuu u weecday GitaGPT, wuxuu ku qoray faahfaahinno ku saabsan xasaradaha hoose ee uu wajahayay wuxuuna codsaday talada AI. \"Diiradda saar ficilladaada iskana daa ka walwalidda mirahooda,\" GitaGPT ayaa sidaa yiri. Tan, iyo hagid kaleba, waxay Meel ka dhigtay mid dareemaya dhiirranaan iyo firfircooni.\n\"Ma aysan i dhaheyn inaanan ogeyn, balse xilligaas, waxaan u baahnaa qof mar kale ii sheega,\" Meel ayaa yiri. \"Rogaal-celintan ayaa iga caawisay inaan dib u eego waxaan ka fekerayay billaabana inaan mar kale isu diyaariyo.\" Wixii intaa ka dambeeyay, GitaGPT waxay u noqotay sida saaxiib, uu la sheekeysto mar ama abo toddobaadkiiba.\nEnd of Ugu akhris badan\nAI waxay qaabeyneysaa sida aan u shaqeyno, wax u baranno una jeclaanno. Waxaase soo kordhaya, inay sidoo kale qaabeyneyso meelaha qaar sida aan u cibaaneysanno. Dadka cibaadeysanaya ee diimaha ugu waaweyn dunida ayaa tijaabinaya mashiinnada. Balse Hinduism, oo muddo dheer lagu yaqaannay ilaahyada ay caabudaan oo si toos ah qofku ugu hor cibaadeysanayo, ayaa soo bandhigeysa isku dhafka iimaanka iyo teknolojiyadda. Iyadoo AI ay taabaneyso qeyb walba oo nolosheenna ah, Hindiya ayaa laga yaabaa inay tooshka ku ifiso waxa ay ka dhigan tahay in arrimaha diinta lagala sheekeysto mashiinnada hadlaya.\n\"Dadku waxay dareemaan inay ka go'doonsan yihiin bulshada, duqeyda iyo macbadyada. Dad badan, inay AI kala hadlaan Alle waa hab ay u dareemaan lahaansho, ee keliya maaha dhanka diinta,\" ayuu yiri Holly Walters, oo arrimaha diinta wax ka dhiga kana tirsan Wellesley College oo Mareykanka ku yaalla, kaasoo bartay walxaha barakeysan, xajka iyo dhaqamada diimeed ee Koofurta Aasiya. In AI lagu dabbaqo diinta waa mid aan laga fursan karin, ayuu yiri Walters. \"Waxaanan leeyahay lagama fursan karo sababtoo ah haatanba way jirtaa.\"\nDhowrkii sano ee la soo dhaafay waxaa la arkay tijaabooyin badan oo diimeed oo AI ah. Sannadkii 2023, barnaamijka AI ee loo yaqaan Text With Jesus ayaa sababay baaqyo ka hor imaansho ah sababo la xiriira in la ogolaaday in AI lagala sheekeysto diinta.\nIsla sanadkaas, App-ka QuranGPT oo loogu talagalay in uu ka jawaabo su'aalaha iyo hagid ku saleysan kitaabka quraanka ayay dad badan kusoo jabeen, waxaa la sheegay in dadka oo ka tan batay awgeed uu hallaabay maalin gudaheed markii la furay. AI waxay xitaa saldhig u ahayd diimaha oo dhan, sida kaniisadda Future, oo ah koox uu bilaabay injineerkii hore ee Google, Anthony Levandowski, kaas oo rajeynaya inuu horumariyo oo kor u qaado aqoonsashada Alle oo \"ku salaysan sirdoon macmal\".\nLaakiin waxyaabaha gaarka ah ee cibaadada Hinduuga ayaa ka dhigaya kiis gaar ah oo xiiso leh. Dhaqan ahaan halka waxyaabaha muqadaska ay yihiin kuwo la arki karo lana taaban karo, teknolojiyaddu waxay noqon kartaa mid taa beddesha, Walters iyo kuwa kale ayaa sidaa leh.\nMarkii ChatGPT iyo waxa laga sameeyay AI ay kor u kacday, tiro ka mid ah hal-abuureyaal ganacsi, kuwo daacad u ah iyo kuwa xiiseeya tignoolajiyada ayaa lagu dhiirigaliyay inay dhisaan chatbots kuwaas oo kaa dhigi doona inaad si toos ah ula falgasho waxyaabaha ay dhigeen \"ilaahyada kala duwan ee Hinduga\" - oo ay ku jiraan AIs badan oo dhammaantood loo yaqaan GitaGPT. Vikas Sahu, oo ah arday ganacsiga barta oo ka yimid Rajasthan, Hindiya, wuxuu horumariyay GitaGPT oo mashruuc dhinac ah oo isaga u gaar ah. Wuxuu filayey inuu si tartiib tartiib ah u bilaabmo, laakiin Sahu wuxuu sheegay in adeeggu uu helay 100,000 isticmaale oo aad u badan maalmo yar gudahood.\nTan iyo markaas, way sii ballaaratay waxaana ka abuurmay chatbots ku salaysan qoraallada kale ee Hinduuda ee noocyada AI ee ilaahyada kale. Sahu waxa uu sheegay in uu rajaynayo in uu \"u qaabeeyo jidka loo maro waxbarista \"ilaahyada [Hindu]\". Waxa uu sheegay in uu isaga tegay jaamacaddii uu dhiganayay si uu maalgelin ugu raadiyo mashruuca.\nXigashada Sawirka, Google\nInta badan ururro-diimeedyada ayaa u bogaya isbeddelka. Horraantii 2025, Sadhguru, oo ah khabiir caan ah oo Hindi ah ahna aasaasaha Isha Foundation, ayaa daah-furay \"Maskaxda Cajiibka\" oo ah app qalwo lagu sameeyo oo ay ku jiraan dhowr qeybood oo AI ah. \"Waxaan u adeegsaneynaa AI inay xikmadihii hore dadka u gaarsiiso qaab ku saleysan waxa hadda dhacaya.\nMa aha keliya in app-ka laga dhigo mid caqli leh, balse waa in khibradda laga helaa mid shakhsiyadeed oo la aamini karo,\" ayuu yiri Swami Harsha, oo ka tirsan Isha Foundation. \"Waxyaabaha ku jira app-ka waxaa ka mid ah waxa ku xusnaa buugga Sadhguru muddo 35 sano ah oo wax laga beddelay, si farriinta ku habboon loo gaarsiiyo qof maalintaas u baahan.\" App-ka ayaa la sheegay inay soo dejisteen hal milyan oo qof muddo 15 saacadood gudahood ah markii la daah-furay.\nAI waxaa sidoo kale loo adeegsadaa baaritaanka ruuxiga iyo kan cilmiyeed. Daraasad la sameeyay sanadkii 2022 ayaa lagu adeegsaday is barbardhigga waxyaabaha ku qoran kutubta Hinduuda.\nKhubarrada ayaa sheegaya in AI sidoo kale loo adeegsan karo soo bandhigidda micnaha qotada dheer ee ku duugan kutubtaas oo aan akhrinta caadiga ah lagu ogaan karin, ayna micno cusub u abuuri karaan qoraallada barakeysan.\nKhatarta waa taas – marka aaladahan loo arko codad ruuxi ah, erayadooda waxay xambaarsanaan karaan miisaan ka weyn intii ay ahayd – ayuu yiri Holly Walters\nSida uu qabo Walters, AI waa uun wax lagu kordhiyay qaababka ay Hinduism iyo teknolojiyaddu horeba iskula falgeli jireen.", "date": "2025-10-20", "scraped_at": "2025-10-29T17:38:29.926485+00:00", "category": "news", "text_hash": "4508b6e7558ba7dd5db654d6536349d30706ff4a2ce9928bcea08acc35c29326", "minhash_signature": "1004344,2715604,3726832,3263894,9171502,2029183,14687611,51999,13435690,1266748,7550236,886806,8197630,589495,7363820,2907171,283737,324279,217203,1572858,1260150,10097504,1068771,830691,5113,4124278,15168441,10390381,7388339,2867253,3259876,3826906,14566,5399966,1036560,3396637,1785280,5596375,6386310,1737287,1226373,2541253,4261077,512577,523703,1222336,7261,4847382,2946535,12176202,4539798,15724957,5996072,2377145,6200957,17222250,604150,241922,920392,4758898,3351650,5990076,7117152,20733234,879644,55022,1461043,839024,3421709,17515206,115628,10840700,8577723,1289544,225083,10723591,115252,5929840,9715095,13555107,170885,3540960,15241934,20048608,11943830,1738820,1524552,6290390,12838840,13035156,8040846,6125505,5606078,1535971,173859,11599662,12323960,32147,1492760,4572100,1790655,16195715,6618346,454914,5635766,15677460,1987593,533074,7589543,274244,6286383,4493785,2339514,2137501,8635982,1430292,7434363,491897,2623618,289451,262356,3896795,2406423,30065,270203,322605,3518470,2013242"}
{"url": "https://www.bbc.com/somali/articles/clydzmne9nxo", "title": "Sidee buu u guuldarraystay mooshinkan ka dhanka ah Ilhaan Cumar", "text": "Xigashada Sawirka, Getty Images\nXisbiga Jamhuuriga ayaa sare u qaaday ololahooda ay ku doonayaan inay ku aamusiyaan dhaleeceynta taariikhda Charlie Kirk, iyagoo beegsanaya xildhibaanka Dimuqraadiga ee Ilhaan Cumar hadallo ay jeedisay ka dib toogashadiisa, waxayna ku baaqeen in laga xayuubiyo doorkeeda  guddiga dowladda.\nWareysi ay bixisay usbuucii hore, Ilhaan Cumar waxay ku sheegtay inay \"damqasho\" u hayso haweeneyda uu ka dhintay Kirk, laakiin waxay ku dhaleeceeysay kuwa soo jeedinaya saameynta garabka midig \"wuxuu rabay dood madani ah\". Waxay sidoo kale dhaleecaysay xildhibaanka Jamhuuriga Nancy Mace, iyada oo ku eedaysay \"inay dhibaatayso kuwa ay u aragto inay ka hooseeyaan\".\nMace ayaa hadda dib u soo jawaabtay qoraal ay soo dhigtay barta X: \"Waxaan gudbineynaa qaraar ah in @Ilhan laga xayuubiyo hawlihii guddigeeda ka dib hadalkeedii foosha xumaa ee dilkii Charlie Kirk\".\nQoraalkaasi xigay ayay ku dartay: \"Tallaabooyinka kala bar kuma filna, Ilhaan Cumar kuma filna qiyamka Mareykanka, boos kuma lahan Congress-ka, waana in la waaniyo\".\nKa gudbinta, oo Mace ay kusoo qortay barteeda X, ayaa ujeedkeedu ahaa \"in la canaanto Ilhaan Cumar ee Minnesota lagana saaro Guddiga Waxbarashada iyo Shaqaalaha iyo Guddiga Miisaaniyadda\".\nEnd of Ugu akhris badan\nKa gudbinta dalabkan ayey ku soo qaadatay wareysi uu la yeeshay wariye Medhi Hassan, kaas oo ay ku andacoonayaan in Ilhaan ay \"magac dishay  Charlie Kirk oo ay ku sheegtay inuu isagu mas'uul ka ahaa dilkiisa\". Waxa uu ahaa isla wareysigii ay Ilhaan ku dhaleeceeysay jawaabaha  siyaasadeed tan iyo toogashadii.\n\"Waxa jira dad la mid ah Nancy Mace, oo si joogto ah u dhibaateeya, waad ogtahay, dadka ay u aragto inay ka hooseeyaan oo ay rabto inaysan ka jirin dalkan\" Ilhaan ayaa sidaasi u sheegtay Hassan wareysiga uu kula yeeshay barnaamijkiisa Zeteo.\n\"Oo waad ogtahay waxaad haysataa dad sida Trump oo kale ah, kuwaas oo kiciyey rabshado ka dhan ah dadka aniga oo kale ah, waxaana muhiim noo ah inaan u yeerno iyaga, inaga oo dareemayno carr iyo murugo,\" ayay tiri\".\nWareysiga Ilhaan waxa ay ku tilmaantay dilka Kirk mid \"dhib dhalin kara\".\nWaxa ay tiri: \"Runtii aad ayaan uga naxay  inaan maqlo warka, inaan daawado muuqaalka. Waad ogtahay, waxa kaliya ee aan ka fikiri karay waxay ahayd xaaskiisa, caruurtiisa, muuqaalkaasi  wuxuu ahaan doonaa mid weligiis nala nool\".\nXigashada Sawirka, AP\nIyadoo ku qortay barta X, Mace waxay tiri: \"Ma jiraan wax qalbiyadeenna diirinaya oo ka badan dadkii naga soo wacay degmada Ilhaan Cumar oo taageeraya tallaabadii aan ku canaananaynay oo aan uga xayuubinayno guddiyada\".\nIlhaan oo laga soo doorto Minnesota ayaa horay looga saaray Guddiga Arrimaha Dibadda ee Aqalka bishii Febraayo 2023 ka dib markii lagu eedeeyay inay sameysay hadallo yuhuud naceyb ah oo ay markii dambe raali gelin ka bixisay.\nLaakin Ilhaan Cumar iyo siyaasiyiinta xisbigeeda Dimuqraaddiga ayaa sheegay in arrintaasi  ay ahayd aargoosi ka dib markii labo xubnood oo Jamhuuriyiin ahaa laga saaray guddiyo ay ka tirsanaayeen 2020-kii, markaas oo Dimuqraadiyiintu ay haysteen aqlabiyadda Aqalka.\nMace ayaa bayaan ay soo saartay ku sheegtay \"Ilhaan Cumar waxay na tustay qofka saxda ah ee ay tahay: waa qof difaacda rabshadaha siyaasadeed oo diidaysa inay cambaareyso khasaaraha nafeed ee aan waxba galabsan oo aysan ku habooneyn ajandaheeda, xitaa dilkii Charlie Kirk\".\nSi kastaba ha  ahaatee Xildhibaan Nancy Mace oo ka tirsan xisbiga Jamhuuriga, lagana soo doorto South Carolina ayaa Arbacadii ku guul darraysatay mooshin ay ku doonaysay in ay ku aamusiso Xildhibaan Ilhaan Cumar oo ka tirsan xisbiga Dimoqaraadiga kaas oo ku saabsan hadallada dilkii Charlie Kirk ka dib markii afar ka tirsan Jamhuuriga ay ka soo horjeesteen soo jeedinteeda.\nCodbixinta 214-213 ayaa soo afjartay dadaalkii Nancy Mace ay ku doonaysay inay Ilhaan Cumar ku canaanto oo ay ka xayuubiso dhammaan hawlihii guddiga ay ka tirsan tahay, ayadoo loo cuskanayo arrinta ku aadan dhaleeceynta ay u jeedisay u dhaq-dhaqaaqihii muxaafidka ahaa ee Charlie Kirk ee la toogtay. Ilhaan ayaa si adag u beenisay inay si toos ah u sheegtay faallooyinka ay soo xigatay Mace, iyadoo Dimuqraadiyiinta Aqalka Wakiilada ay taageereen.", "date": "2025-09-18", "scraped_at": "2025-10-29T17:39:29.955621+00:00", "category": "news", "text_hash": "fe10791d733a566a43837fc12e81b0395a1fb8226ee096529ffe34dfb7063996", "minhash_signature": "5882603,13946732,2147681,987076,924857,505284,909534,133315,6231835,5195092,4935211,2684438,5457414,3920186,7540056,17200461,2814166,10774366,3081706,17425199,971752,19239197,4281931,4436629,556205,2868017,7703183,8327680,13523666,1838814,2583341,10209390,6263455,118659,1077559,10520112,4255688,8909545,1892374,1883440,4423183,2545073,16549743,14436334,26170019,4476352,3449638,10971808,6327625,1838727,25635989,7113521,1376187,3530674,271462,6679754,12200809,1459508,13832145,12998090,11895477,7752756,10030351,2982276,16368301,25909905,29598149,836319,3763853,1637907,24206659,15952712,4155035,1879511,2238931,8069114,2277904,5339090,10728427,8071890,12258,6208371,4482665,2297055,1121368,6101490,5528259,19423636,14614154,5681017,1263085,691346,10624026,6020362,1521895,80101,4512508,516027,1598419,662857,8061764,1686786,21320219,156173,7000243,4874443,991022,6452673,453063,10372950,3817397,2222885,7585717,4799853,13188134,4092195,15523581,157472,2530851,1183406,303351,2999256,2288993,5948751,1455976,4098881,10099880,1241360"}
{"url": "https://www.bbc.com/somali/articles/cm27k0y8zlgo?at_medium=RSS&at_campaign=rss", "title": "Waa kumaa madaxwaynaha Muslimka ah ee Trump ka caawiyay heshiis muhiim ah?", "text": "Xigashada Sawirka, Getty Images\n\"Anigu xabsiga ayaan ku jiray laakiin waxaad ku dhawaatay inaad halkaas gaarto\" ayuu Ra'iisal wasaaraha Malaysia Anwar Ibrahim kula kaftamay madaxweynaha Maraykanka Donald Trump markii ay kulmeen.\nWuxuu ahaa kaftan diciif ah - mid uu si degdeg ah uga gudbay marka loo eego dabeecadda Trump ee ku yartahay maaweelada- laakiin sidoo kale waxaa la oran karaa waa hadal ka soo yeeray siyaasi  ruug-caddaa ah.\nWaxa uu hadda heshiis la saxeexday Trump si uu hoos ugu dhigo cansuuraha wax-soo-saarka Malaysia ee Maraykanka lagana dhigo 24% ilaa 19%. In kasta oo tafaasiil badan oo kale aan la bixin, hubanti kasta oo ah in canshuuraha aan kor loo qaadi doonin waa la soo dhaweynayaa iyadoo ay jirto dhammaan hubanti la'aanta arrintaa ku xeeran.\nLaakiin tan ugu muhiimsan guud ahaan, Anwar ayaa xaqiijiyay ka qaybgalka Trump ee shir madaxeedka gobolka kaas oo si isdaba joog ah su'aalo loo waydiiyay.\nMadaxweynaha Mareykanka ayaa ku sugnaa kulanka Ururka wadamada koonfur bari Eeshiya , ama loo soo gaabiyo Asean, ee ka dhacay Kuala Lumpur si uu goob-joog uga noqdo \"heshiiska nabada\" ee aadka loo wada sugayay ee u dhaxeeya Thailand iyo Cambodia, kaas oo Anwar abaabulay.\nEnd of Ugu akhris badan\nWaxa uu sidoo kale dhexdhexaadiyay xabad joojinta jilicsan ee udhaxeysa Thailand iyo Cambodia ka dib isku dhacyo lagu hoobtay oo xuduuda ka dhacay horaantii sanadkan .\nWaxaa uu heshiiska sidoo kale ku soo beegmay ka dib markii Trump ku hanjabay inuu canshuuro ku soo rogayo labada dhinac haddii dagaalku aysan joojin.\nQaar ka mid ah dadka wax falanqeeya ayaa ku tilmaamay guul diblumaasiyadeed oo u soo hoyatay Malaysia, halka qaar kalena ay sheegeen in Anwar uu si sahlan ku gaaray goobta saxda ah ee waqtiga saxda ah - sanadkan, waxa uu ahaa ra'iisul wasaaraha Malaysia islamarkana ah hogaamiyaha ururka wadamada koonfur bari Eeshiya.\nLaakiin Anwar waxa uu ku doodi karaa in uu sugay fursadan muudo 25 sano oo waqtigiisa ka mid ah – wxaa uuna soo maray wakhti qalafsan, xilligaas oo laba jeer la xiray.\nXigashada Sawirka, Getty Images\nAnwar ayaa markii ugu horeysay isku tilmaamay hogaamiye arday ah oo soo jiidasho leh oo aasaasay dhaqdhaqaaqa dhalinyarada Islaamka ee Malaysia, ABIM.\nSannadkii 1982-kii, waxa uu ku biiray xisbigii muddada dheer xukumayay ee United Malays National Organisation (UMNO), taas oo dad badan ka yaabisay iyaga oo ka filayey in uu ka fogaan doono kooxda xukunka haysa.\nLaakin waxay caddaysay dhaqdhaqaaq siyaasadeed oo caan ah - wuxuu si degdeg ah u fuulay jaranjarada awoodda wuxuuna qabtay jagooyin wasaaradeed oo badan.\nSannadkii 1993-dii, waxa uu noqday ku xigeenka ra'iisal wasaarihii xilligaas Mahathir Mohamad, waxaana si weyn loogu arkayey dhaxal sugaha. Taasi waxay ahayd ilaa ay isku khilaafeen maaraynta dhibaatada dhaqaale ee Aasiya 1997, taas oo aad u saamaysay Malaysia.\nAnwar ayaa shaqada laga ceyriyay sanadkkii xigay, ka dibna waxaa lagu xiray kiisas la xiriira musuqmaasuq iyo in uu caruur fara-xumeeyay – eedeymahaa oo uu ilaa maanta diidan yahay, isagoo ku dooday inay qeyb ka ahaayeen olole sumcad dil ah oo lagu doonayay in xilka looga xayuubiyo.\nSannadkii 2004tii, sanad ka dib markii Mahathir uu xilka ka degay, maxkamadda sare ee Malaysia ayaa laashay xukunkii ahaa inuu faraxumeyn sameeyay waxayna sii daysay Anwar. Waxa uu u soo baxay isaga oo ah hoggaamiye mucaarad xoog leh, isaga oo u horseeday guushii abid ugu xoogganayd doorashadii 2013-kii.\nWax ka yar hal sano ka dib, isaga oo isu diyaarinaya inuu ka qeyb galo doorasho, waxaa lagu soo oogay dacwado cusub oo ah in uu sameeyay galmo isku jinsia ah , isaga oo dib loogu celiyay xabsiga.\nKadib 2016-kii, dhacdo naxdin leh, Mahathir waxa uu ka soo laabtay hawlgabnimadii si uu ugu tartamo jagada ugu sareysa, iyadoo hogaamiyihii xilligaas Najib Razak uu wajahay eedeymo musuqmaasuq.\nXigashada Sawirka, Getty Images\nMahathir oo markaas 92 jir ahaa ayaa heshiis aan la filaynin la galay Anwar oo weli xiran, isagoo ballan qaaday inuu sii dayn doono Anwar haddii la doorto, ugu dambayntiina uu ku wareejin doono xilka Ra'iisul Wasaaraha. Isbahaysigoodu wuxuu dhaliyay guul taariikhi ah 2018, laakiin isbahaysigu ayaa isbadalay oo awoodda laguma wareejin.\nDoorashadii 2022, isbaheysiga Anwar ayaa ku guuleystay kuraastii ugu badnaa, laakiin weli way ka yaraadeen tirada loo baahan yahay si loo dhiso dowlad.Maalmo is-mari waa ka dib, boqorku wuxuu u magacaabay rai'sul wasaare.\nDadka qaar waxay moodayeen in muddo-xileedkiisu uu gaaban yahay. Laakiin ku dhawaad ​​​​saddex sano kadib, 78-jirka ayaa horey u sii hayay shaqada in ka badan seddexdii qof ee ka horreeyay.\nGuusha ugu weyn ee Anwar ayaa laga yaabaa in ay tahay xasiloonida siyaasadeed ee uu u muuqdo in uu ka keenay waddan soo maray saddex ra'iisal wasaare intii u dhaxaysay 2020 ilaa 2021.\n\"Malaysia maalmahan waxaa mararka qaarkood loo arkaa inay ka mid tahay kuwa ugu xasiloon Koonfurta Bari ee Eeshiya, taasoo sidoo kale ka dhigtay mid soo jiidata maalgashadayaasha,\" ayay tiri Syaza Shukri, oo ah borofisar cilmiga siyaasadda ka dhiga Jaamacadda Caalamiga ah ee Islaamka.\nLaakiin qiimaha maciishada ayaa kor u kacaya, sida dalal kale oo badan. Bishii July, 20,000 oo mudaaharaadayaal ah ayaa isugu soo baxay waddooyinka Kuala Lumpur iyagoo dalbanaya in Anwar uu xilka iska casilo, sababo la xiriira kor u kaca qarashka iyo dib u habeynta dhaqaalaha.\nKuwo kale waxay ku eedeeyaan maamulkiisa inuusan wax ku filan ka qaban kor u qaadida Malaysia oo loo dhan yahay marka loo eego Islaamiyiinta sii kordheysa.\nXigashada Sawirka, Getty Images\nSaaxadda Caalamka, Anwar aad buu u guulaystay. Raiisel wasaare ahaan, wuxuu isu-dheellitiray dhaqaalaha dalkiisa ee soo ifbaxaya  iuusan dhexda u gelin harddanka Mareykanka iyo Shiinaha.\nWaxa uu sidoo kale ku casuumay shir madaxeedka hogaamiyaha Shiinaha Xi Jinping. Xi ayaa booqasho rasmi ah ku tagay Malaysia bishii April, ka dib 12 sano oo khilaaf u dhaxeeyay, balse wuu ka baaqsaday shir madaxeedka toddobaadkan.\nLaakin joogitaanka Trump arrin yar uma ahayn dhaqaalaha Koonfur Bari Aasiya ee ku tiirsan suuqa Maraykanka. Waxay ka dhigan tahay in dalal kale, sida Thailand iyo Vietnam, ay sidoo kale ka wada hadli karaan faahfaahinta canshuuraha taasi oo imika ay ku guuleysteen.\nAnwar waxa uu ahaa nin aad ugu firfircoon dhinaca diblomaasiyadda. Sannadkii ugu horreeyay ee uu Ra'iisul Wasaaruhu ahaa, waxa uu booqday dhammaan dalalka Koonfur Bari Eeshiya , marka laga reebo Myanmar, oo ay ka socdeen dagaallo sokeeye tan iyo markii ay ciidamadu la wareegeen awoodda sannadkii 2021-kii.\nDoorkii uu ku lahaa xabad joojinta Thailand iyo Cambodia ayaa sidoo kale kor u qaaday mawqifka Anwar, laakiin guushan dublamaasiyadeed wax yar ayey uga dhigan tahay dadka caadiga ah ee Malaysia.\nMarka ay timaado gudaha dalkiisa Waxa guriga ka guuxaya waa u doodista uu u hayo qadiyadda Falastiin, oo aad u sii xoogaysanaysay tan iyo markii uu dagaalka Qaza bilaabmay 2023-kii.\nJawaabta taasi waxay muhiim u noqon doontaa qaabka uu uga badbaado doorashada soo socota, ee ku beegan 2028.", "date": "2025-10-28", "scraped_at": "2025-10-29T17:40:30.039969+00:00", "category": "news", "text_hash": "b5c90fa1ff64c00738f4acf0e9c4cf4fd979b70535f6707779b38304f48899d7", "minhash_signature": "276769,2765648,129876,7453948,8168639,5712311,2106806,91926,1225900,1345751,3024833,8391547,804375,846327,1846850,3782764,1646368,2853476,900660,2668728,8838905,1004084,7854746,671465,3244535,2824751,1045025,11068615,759480,10244325,5734538,1606647,4844681,15932976,10417591,6258197,2411045,365956,813326,3129305,3274880,7319586,1029334,10220879,1324486,2309451,2346184,4626019,10164993,9272011,6242229,973970,78410,1972378,4657773,7681680,1321969,10578093,2487685,11062079,832300,3483719,2705589,842536,1710398,9096036,7485114,7505751,1500067,5530576,4831745,9028696,3783292,3789024,2198451,202506,315762,641273,2377282,186616,3374734,713417,1385887,563713,29735727,4659076,4069056,10330660,2852213,1318893,1043510,239904,11443749,5523348,9531775,735849,1651702,287643,1227304,2454737,3601662,4687136,8734663,2774193,3231593,9170496,1934466,2431652,1802443,654186,19448627,1881404,4693802,9456774,4568935,11571684,3049992,5452866,1928043,1152686,2072042,5153713,2297652,12155701,868951,7633074,4319021,3635578"}
{"url": "https://www.bbc.com/somali/articles/cg5vlvl7gq4o", "title": "Wax badan ka ogow is aragii ugu horreeyey ee Lamine Yamal iyo Cristiano Ronaldo oo caawa ballansan", "text": "Xigashada Sawirka, Getty Images\nWaa laba jiil oo dahabi ah oo midna masraxa ka sii baxayo midna soo galay oo wacdarro ka dhigayo garoomada ciyaaraha kubada cagta ee Yurub.\nCristiano Ronaldo, halyey muddo dhowr iyo labaatan sano ciyaaraya kubadda cagta ahna shumac ka dhex ifaya ciyaaraha kubada cagta ee Yurub iyo caalamka iyo da'yarka mucjisada lagu tilmaamay ee soo koray masraxa kubadda cagta ee caalamka Lamine Yamal ayaa ku ballansan is aragoodii kowaad ee ay garoon isaga hor imaanayaan.\nLabada xiddig ee hiboolayasha ah ayaa caawa finaalka koobka horyaalka Qaramada Yurub ku ciyaaraha garoonka Allianz Arena ee magaalada Munich ee  dalka Jarmalka, waxaana ciyaarta xiisaha u yeellaya waa inay hanashada koobka ku tartamayaan Ronaldo iyo Lamine Yamal.\nRonaldo, waa finalkiisii afaraad ee uu la gaarayo dalkiisa Portugal 25-kii sanno ee u xirnaa funaada dalkiisa halka Lamine Yamal ay tahay kiisii labaad ee uu u ciyaarayo Qarankiisa Spain oo final Joogo.\nHaddi Ronaldo iyo dalkiisu Portugal ay hantaan koobkan waa kii labaad oo qaadayaan isagoo koodii kowaaad qaaday sanadkii 2019-kii, halka haddii Yamal kula guulaysto Spain uu noqonayo koobkiisii labaad ee Yurub ee dalkiisaa la qaadayo isago sanadkii 2024 la qaaday.\nEnd of Ugu akhris badan\nKulankani wuxuu noqonayaa markii ugu horreysay ee Yamal oo ka tirsan Barcelona – lana hadal hayo inuu ku guuleysan karo Ballon d'Or xilli ciyaareedkan – uu wajaho Ronaldo oo shan jeer ku guuleystay abaalmarintaas, kana tagaya kooxda Sacuudiga ee Al-Nassr xagaagan marka uu dhamaado heshiiskiisa.\nBBC Sport ayaa eegaysa waxa Ronaldo iyo Yamal ay toddobaadkan ka yiraahdeen midba midka kale – iyo sida ay isugu egyihiin ama u kala duwan yihiin.\nLabada ciyaaryahan ayaa la weydiiyay midba midka kale isku diyaarinta kulankaan.\nRonaldo oo hadda 40 sanno jir ayaa yiri, \" Cunnugan yar wuxuu run ahaantii wax wanagsan ka sameeyey kooxdiisa iyo qarankiisaba taaso si fiican u caawisay\"\n\"Waxay u tahay jawi wanaagsan oo isaga oo ku muujin  karo tayadiisa\" ayuu intaas raaciyey Ronaldo. Isagoo sii hadlayey CR7 waxaa uu yiri \" Ha soo barbaaro, ha saarin cadaadis, ha saarin cadaadis si aan ugu raaxaysan karno tayadan oo kale sanado badan.\"\n\"Waxaan jeclaan lahaa inaan ka qaado cadaadiska oo aan keligiis u daayo. Wuxuu leeyahay hibbo aad u badan.\"\nLamine Yamal oo farqi weyn oo xaga da'ada u dhaxeeyo Ronaldo, 13 bishaluuliyana jirsanaya 18 sanno ayaa ixtiraam u muujiyey Ronaldo.\n\"Waa halyeey kubadda cagta ah. Aniga, sida ciyaartoyda kale oo dhan, waxaan u hayaa ixtiraam weyn Cristiano.\n\"Kani waa nooca ciyaarta aan doonayo inaan ciyaaro, si aan u muujiyo aniga cidda aan ahay.\"\nKani waa kulankiisii ugu dambeeyay ka hor inta uusan gaarin 18 sano jir, waxaana uu horay ula soo qaaday koobka Qaramada Yurub Spain, iyo labo horyaal oo La Liga ah iyo Copa del Rey oo uu la qaaday Barcelona.\nWaxa uu u ciyaaray Barcelona 106 jeer, wakhtigaas waxa uu u dhaliyay 25 gool, caawiyena ka ahaa 18 kale, Spain waxa uu u saftay 20 kulan, lix gool iyo sagaal caawiye.\nWaxa uu shabaqa soo taabtay semi-finalka  ee koobkan uu caawa ciyaarayo finalkisia- isagoo dhaliyay labo gool kulankii Khamiista ay 5-4 kaga badiyeen France. Sidoo kale afar gool oo El Clasico ah ayuu ka dhaliyay Real Madrid.\nMarkii uu Ronaldo jirsaday 18-sano waxa uu 19 kulan u saftay kooxdiisii hore  Sporting, isagoo ku lugyeeshay  5 gool 3 kalena caawiye ka noqday, walina umuu ciyaarin Portugal ama koob weyn ku qaadin isagoo da'diisu tahay 17 ama ilaa 18 tobban toona.\nRonaldo ayaa koobkiisii ugu horreyey la qaaday kooxda Man-United sanadkii 2004-tii.\nXigashada Sawirka, Getty Images\nLabadoodaba waa u muhim hanashada koobkan,\nWariye Ciise Talyaano oo ka faallooda arrimaha ciyaaraha kuna sugan magaalada Muqdisho ayaa BBC-da u sheegay si uu u arko waxa Lamine iyo Ronaldo ugu dhigan tahay ku guulaysiga koobka horyaalka qaramada Yurub\nLamine Yamal:\n\"Lamine Yamal guushiisa koobkan waxay ka dhigantahay tallaabo uu horay uqaaday, yaraan ayuu ku qaaday dhammaan tartamada qaaradiisa, waxa u haraya oo kaliya inuu ku guulaysto koobka adduun. Sanadkan waxa uu soo qaaday Horyaalka Spain, Super Cupka iyo koobka Boqorka oo uu Barcelona la wada qaaday, waxana muddo ka dib uu kooxda geeyay afar dhammaadka Champion-ka. Ninkan yari waa gool dhaliyo, kubad sameeye iyo hogaamiye. Inuu koob ka hor qaado Ronaldo waa taariikh cusub oo udhigmaysa\" ayuu yiri Ciise.\nCristiano Ronaldo:\n\"Ronaldo isaga oo 40-jira inuu xulkiisa keenay finaalkan waa arin muujinaysa hogaamintiisa, waxa uu xulka udhaliyey gooshii ay uga soo baxeen Germalka, taas oo ku guulaysigiisa koobkanna ay usii noqonayso dhiiri-gelin uu ku hiigsado koobka adduunka 2026. Ronaldo waa gool-dhaliyaha guud ee Portugal waana ninka ugu badan ee kulama u ciyaaray, laba koob oo hore ayuu la qaaday, haddii kanna uu kula guulaysto waa diiwaan uu dalka udhigay\"\nsidoo kale khabiirka ciyaaraha Maxamed Axmed Deysane ayaa  isna qaba in uu muhiim u yahay labada hiboole.\n\"Wiilkan yar Lamine Yamal, mustaqbalka waa ciyaaryahanka baddeli doono meshii ay baneeyeen Ronaldo iyo Messi, marka caawa ayuu Lamine xaqiijin doono inuu halkaas la wareegayo\" ayuu yiri Deysane.\nWuxuu intaa raaciyeye Deysane in Ronaldo ay tani u tahay tusaale ciyaartoyda kale inuu ciyaarayo isagoo da'diisu weyn tahay isla markanaa uu gool dhalin badan sameeyey intuu joogay Horyaalka Sacuudiga ahna ninka labaad ee tartanka uu finalka Jooga ugu gool dhalinta badan isagoo 7-dagool.\nTaageerayasha dunida ee garoonka iyo shaashadaha caalamka ka daawan doonna kulan ayaa sidoo kale labadan xiddig ku kala eegi doona indhaha taageeranimo ee kooxaha Realmadrid iyo Barcelona.", "date": "2025-06-08", "scraped_at": "2025-10-29T17:41:30.460551+00:00", "category": "news", "text_hash": "2c87cf4f3704f4c1f97a7634a2e85b9103e8139d1616034bf1d0a7142bea9bd1", "minhash_signature": "10312984,3349546,12698971,4048518,1329978,1535314,6370557,5640197,9467103,4537049,5314718,5464294,1866989,2589896,3875150,6702738,212871,7432887,6223150,12038023,8203176,7885680,5435663,4436629,2214616,2110314,87310,666240,4374386,12156476,830857,586883,2472055,4605682,7325403,9406668,2061416,3598296,1557901,7664863,5058147,1596874,26384842,486732,2330185,2727285,14578038,10196996,1694783,2295751,2421205,66589,3178097,12059902,1860940,3181329,5033511,3919364,9998952,1055876,2853115,6409478,1624059,4372043,8128564,4715951,3331994,7652072,627061,11723815,17526318,7053007,4883733,3901518,2538270,2251527,7049361,20010080,2902270,926524,7777193,8830423,5687931,1596224,1331899,4206985,6467566,4495947,9254995,11335352,2367127,1662199,6838590,4475303,1602990,647336,430455,1417332,2606919,4607637,3955703,374458,520419,124617,1338918,4525402,2917,8274287,5795100,5361300,1150003,8999358,4513424,10728956,2111666,1806252,767287,1137466,4537616,374962,2618515,508728,1141787,390584,6213877,742229,10330785,7573068"}
{"url": "https://www.bbc.com/somali/articles/ckg12g4nw4eo", "title": "Xiriirka gaarka ah ee hogaamiyihii mucaaradka Kenya ee geeriyooday Raila Odinga uu la lahaa Somaliland", "text": "Xigashada Sawirka, Xafiiska Afhayeenka M JSL\nFG: Qormadan dib ayaa loo cusboonaysiiyey.\nWaxaa dalka Hindiya ku geeriyooday hogaamiyihii mucaaradka Kenya, marna noqday ra'iisul wasaaraha dalka Raila Odinga.  Wuxuu ka mid ahaa dad aan badnayn oo lagu tiriyo inay qaabeeyaan siyaasadda Kenya.\nMuddo 40 sano ka badan ayuu siyaasadda ku soo jiray. Kenya marka laga soo tago xiriir fiican ayuu lahaa caalamka iyo gobolka.  Somaliland oo hadda ka hor uu booqday waxay ka mid tahay meelaha aadka looga taageero, oo uu xiriirka dhow lahaa siyaasiyiintooda.\nBishii Juun ayaa booqasho waxaa ku yimid Kenya madaxweynaha Somaliland Cabdiraxmaan cirro oo ay markaas magaalada Nairobi kaga munaaqashoodeen sidii uu Raila ugu ololayn lahaa in ay Somaliland aqoonsi hesho.\nWar kasoo baxay afhayeenka madaxweynaha, Xuseen Aadan Cige, ayaa lagu sheegay in kulanka diiradda lagu saaray hagaajinta xiriirka labada dhinac oo dhinacyo kala duwan ah, sida nabadda iyo ammaanka, waxbarashada, isdhaafsiga dhaqan iyo qeybo kale.\nEnd of Ugu akhris badan\nLabada hoggaamiye ayaa sidoo kale ka wada hadlay arrimaha Afrika, iyagoo ku baaqay xal ay Afrika hoggaamiso iyo horumar loo dhan yahay.\n\"Waxa xusid mudan in Mudane Raila Odinga uu muddo dheer ahaa saaxiib dhaw iyo taageere mayal-adag oo ay Jamhuuriyadda Somaliland leedahay.\"\n\"Intii uu socday kulanka ayaa labada hoggaamiye waxa ay ka wada hadleen sidii loo dardargelin lahaa loona xoojin lahaa xidhiidhka soo jireenka ah ee ka dhexeeya labada Jamhuuriyadood ee Somaliland iyo Kenya, iyo sidii ay labada dhinac iskaga kaashan lahaayeen xagga dhaqaalaha, isku socodka, aqoonta iyo arrimaha isteraatejiga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nMadaxweynaha Somaliland ayaa dhankiisa uga mahadnaqay \"saaxiibtinimada soo jireenka ah ee uu Raila Odinga la leeyahay Somaliland iyo taageeradiisa\".\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nRaila Odinga oo dhexdhexaadiye weyn ka ah Bariga Afrika ayaa horey meelo fagaaro ah uga taageeray qadiyadda aqoonsi raadinta Somaliland, isaga oo ugu baaqay Golaha Fulinta Midowga Afrika inay u aqoonsadaan Somaliland dal madaxbanaan.\n\"Midowga Afrika wuxuu u baahan yahay inuu xaqiiqda ku baraarugo oo aysan suurtogal ahayn in labadan dal aan la isku keeni karin oo aan hal loo aqoonsan karin,\" ayuu yiri sanadkii 2020. \"Somaliland waa xaqiiq ay tahay caalamka inuu ku baraarugsanaado\" ayuu intaa raaciyay.\nRaila Odinga oo sidoo kale ahaa siyaasiga ugu faca weyn siyaasiyiinta Kenya islamarkaasna muddo dheer xabsi ku jiray gudaha Kenya waxa uu isku tilmaami jiray in uu yahay saaxiib dhow ee madaxweynihii labaad ee Somaliland Maxamed Xaaji Ibraahim Cigaal, oo ay isbarteen xilliyadii uu Cigaal xubinta ka ahaa dowladdii rayidka Soomaaliya oo uu Raysal wasaare ka noqday iyo dowladdii kacaanka oo uu la shaqeeyay.\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nSomaliland waxay ku tilmaantay Geerida Ra'iisul Wasaarihii hore ee Kenya iyo Hoggaamiyihii Mucaaradka  dalkaas Raila Odinga, saaxiib qaali ah iyo siyaasi ruug cadaa ah oo qaddiyadeeda u ololayn jiray oo ay wayday.\nWakiilkii hore ee Somaliland u joogay dalka Kenya Baashe Cawil Xaaji Cumar, oo la hadlay BBC-da ayaa sheegay in Raila Odinga uu door weyn ku lahaa xidhiidhka Kenya iyo Somaliland, iyo suurt ogalinta xafiisyada labada dhinac ee ka furan Nairobi iyo Hargeysa.\nKenya ayaa markii hore joojisay qorshaha ay jamhuuriyadda goonni isu taaggeeda ku dhawaaqday ee Somaliland ku dooneysay inay xafiis diblomaasiyadeed uga furato magaalada Nairobi ee caasimadda Kenya.\nWarsaxaafadeed ka soo baxay wasaaradda arrimaha dibadda Kenya, ayaa lagu sheegay in dowladda federaalka Soomaaliya ay u aqoonsan tahay dal madax bannaan, isla markaana aysan ogolaan karin in Somaliland ay xafiis diblomaasiyadeed ku yeelato magaalada Nairobi.\nSomaliland, waxay gooni isu taageeda ku dhawaaqday sanadkii 1991-kii, balse ma helin aqoonsi ballaadhan oo caalami ah oo ku saabsan madax-bannaanideeda\nKenya ayaa sheegtay in ay sii wadi doonto xiriirka ay la leedahay Somaliland, balse ay u aqoonsantahay dowlad-goboleed ka tirsan Soomaaliya, isla markaana ogolaansho ka hesho Soomaaliya.", "date": "2025-10-16", "scraped_at": "2025-10-29T17:42:30.113866+00:00", "category": "news", "text_hash": "f0dfb947a759e575e125ab6b2f860688d102a23bb4277298d0270af6a797c239", "minhash_signature": "338416,23563525,5005283,3746621,18486880,3224043,8187241,1832648,11894394,22099407,3392584,15541947,1923274,2363318,2049181,4560947,3073255,1598257,11705254,12012505,11560589,10563474,1223471,12404719,866287,1635976,7201983,5955403,5458945,1298047,7584054,435406,3886131,50093,18508675,11821589,4600804,2820412,16836640,2550250,9149304,5673898,20153692,13344810,8655243,3426978,3055268,5196131,8381596,1560228,5372561,4555217,2237935,5525111,10666341,25036951,4570312,2358552,37743937,3821203,3981199,3638009,24496773,6515008,13576450,11459765,8136791,1197757,17380246,1373941,2774130,15072331,407954,7180517,21663289,7095493,2994126,19240817,10213410,3002908,1686597,606751,12968297,7457640,2653449,7740674,10386917,9669744,2313993,971898,13143609,6998090,17956185,3353129,1803738,14426260,4647353,4797486,8138489,3064540,4693170,2974186,5805317,5513287,32212081,3120422,3475001,12572109,989753,8871279,514869,20591562,35498783,976240,15900270,24578533,592141,3228341,2770536,6393517,4445502,2606507,488004,6520954,3356636,15970085,2046335,11847488"}
{"url": "https://www.bbc.com/somali/articles/c15k1283ln7o", "title": "Waa tuma \"Haweeneyda Birta ah\" ee lagu wado inay hoggaamiso Japan?", "text": "Xigashada Sawirka, Getty Images\nWaxay ahayd uun ka dib labo isku day oo guuldarraystay, Sabtidii, Sanae Takaichi ugu dambayntii waxay gaadhay hammigeedii dheeraa.\nHaweeneydan 64 jirka ah waxaa loo doortay hoggaamiyaha Xisbiga Dimuqraadiga Xorta ah ee haya talada Japan (LDP) xilli la xusayay 70-guurada aas-aaska xisbigaas – taasoo u furaysa waddada inay noqoto ra'iisul wasaarihii ugu horreeyay ee dumar ah ee dalka Japan.\nWaa wasiir hore oo dowladeed iyo baraamij sameeye telefishin, sidoo kalena mar bay ka ahayd durbaan-tumeyaal koox heesa muusigga culus .\nHadda waxay wajahayaan caqabadda ah inay hoggaamiso kaliya xisbi la tacaalaya sidii uu kalsoonida codbixiyeyaasha u soo ceshan lahaa kaddib fadeexado iyo khilaafyo midig-fog ah – balse sidoo kale waddan wajahaya heerka dhalashada carruurta oo aad u hooseeya iyo xiisado siyaasadeed oo sii kordhaya oo caalamka ah.\nSanae Takaichi waxay ku dhalatay gobolka Nara sanadkii 1961. Aabbaheed wuxuu ahaa shaqaale xafiis, halka hooyadeedna ay ahayd askari booliis. Siyaasaddu aad bay uga fogeyd nolosheedii ay kusoo kortay.\nEnd of Ugu akhris badan\nMar ay ahayd durbaanle aad u xiiseysa muusigga loo yaqaan \"heavy metal\", waxay caan ku ahayd inay sidato ulo fara badan, maaddaama ay uluhu jebi jireen inta lagu guda jiro tumidda durbaanka si xoog leh.\nSidoo kale, waxay ahayd quuse-badeed iyo  qof jecel baabuurta– gaarigeedii ay aadka u jeclayd ee Toyota Supra hadda waxaa lagu soo bandhigay matxafka Nara.\nKahor inta aysan gelin siyaasadda, Sanae Takaichi waxay si kooban uga shaqeysay soo jeediso barnaamij telefishin.\nHimiladeeda siyaasadeed ee Sanae Takaichi, waxay soo bilaabatay 1980-meeyadii, xilliga uu xumaaday xiriirka ganacsi ee u dhexeeyay Mareykanka iyo Japan. Iyadoo go'aan ku gaartay inay fahanto sida Mareykanku u arko Japan, waxay ka shaqeysay xafiiska haweeneydii dimuqraaddiga ahayd ee Patricia Schroeder, oo ahayd xildhibaanad si weyn uga hadasha dhaliilihii ay u jeedisay Japan.\nTakaichi waxay aragtay Maraykanka oo isku dhex geynaya luqadaha iyo cuntooyinka Japan, Shiinaha, iyo Kuuriyada, iyadoo arkaysay sida Jabbaan badanaa loola xiriiriyo Shiinaha iyo Kuuriyada Koonfureed.\n\"Haddii Japan aysan is difaaci karin, masiirkeedu mar walba wuxuu noqon doonaa mid ku tiirsan ra'yiga aan qotodheerayn ee Maraykanka,\" ayay ku soo gabagabeysay.\nXigashada Sawirka, Getty Images\nWaxay u tartantay doorashadii baarlamaanka ee ugu horreysay sanadkii 1992 iyada oo madax-bannaan ahayd, balse ma aysan guuleysan.\nDadaal badan oo ay samaysan, sanad ka dib ayey ku guuleysatay kursi, waxayna ku biirtay Xisbiga LDP sanadkii 1996. Tan iyo markaas, waxay ku guuleysatay inay noqoto xildhibaan 10 jeer, hal mar oo keliya ayaa laga adkaaday, waxayna dhistay sumcad ka mid ah codadka muxaafidka ah ee xisbiga.\nWaxay sidoo kale soo qabatay  xilal sare oo dowladeed, oo ay ku jiraan wasiirka badqabdka dhaqaalaha, wasiirka dowlad-goboleedka ee ganacsiga iyo warshadaha, iyo xilka wasiirka arrimaha gudaha iyo isgaarsiinta oo ay muddo rikoor ah soo qabatay.\nSanadkii 2021, Takaichi waxay markii ugu horreysay  tartan u gashay hoggaaminta  xibiga LDP, balse way ku guuldaraysata, waxaana ka guulaystay Fumio Kishida. Waxay mar kale isku dayday sanadkii 2024, markaas waxay hogaamisay wareegga koowaad ee codbixinta, balse ugu dambeyn way guuldaraystay  iyadoo Shigeru Ishiba uu kaga guuleystay.\nSanadkan oo ahaa isku deygeedii saddexaad, ayey xaqiijisay guusha, tan ayaa iyada dabcan ka dhigaysa inay noqoto haweeynadii ugu horreysay ee Ra'iisul Wasaare ka noqota dalka Japan marka uu barlamaanku meelmariyo magacaabideeda.\n\"Hadafkaygu waa inaan noqdo Haweeneyda Birta ah,\" ayay u sheegtay koox carruur ah oo iskuul ah intii ay ololaheeda dhowaa socday.\nTakaichi waa haweeney si adag uga soo horjeeda fikirka casriga ah, waxayna muddo dheer ka soo horjeedday sharciga u oggolaanaya dumarka guursaday inay magacooda hooyo sii haystaan, iyadoo ku adkaysanaysa in taasi dhaqanka dhaawacayso. Sidoo kale, waxay ka soo horjeeddaa guurka dadka isku jinsiga ah.\nSi kastaba dhawaan ayey muujisay dabac intii lagu guda jiray ololaheeda waxay ballanqaadday inay khidmadaha ilaaliyaha carruurta ka dhigi doonto qayb ahaan mid canshuurta laga dhimo, sidoo kalena soo jeedisay in shirkadaha bixiya adeegyada daryeelka carruurta ee gudaha loo sameeyo dhimista canshuurta.\nXigashada Sawirka, Bloomberg via Getty Images\nQoyskeeda iyo waaya-aragnimadeeda shaqsiyadeed waxay xoojinayaan hindiseheeda siyaasadeed: ballaarinta adeegyada isbitaallada ee caafimaadka haweenka, siinta shaqaalaha taageerada qoyska aqoonsi weyn, iyo hagaajinta doorashooyinka daryeelka bulshada gabowga ee Japan.\n\"Anigu si shaqsi ah waxaan mar saddex jeer nolosheyda soo noqday kalkaaliso iyo daryeel bixiso,\" ayay tiiri.\n\"Taasi waa sababta go'aankaygu uu uga sii adkaaday sidii loo yarayn lahaa tirada dadka qasbanaaday inay shaqadooda ka tagaan sababo la xiriira daryeelka, tarbiyadda carruurta, ama carruurta oo diida inay iskuulka aadaan.\"\n\"Waxaan rabaa inaan abuuro bulsho aysan dadku iska dhiibin xirfadahooda.\"\nXigashada Sawirka, Getty Images\nTan iyo markii la asaasay xisbiga LDP, sanadkii 1955-tii, wuxuu xukumayey siyaasadda Japan, laakiin hadda wuxuu dhumiyey taageeradiisa, iyadoo ay sabab u tahay niyad-jabka ka dhashay dhaqaalaha gaabiska ah, hoos u dhaca tirada dadka, iyo xanaaqa bulshada.\nTakaichi waxay ka tirsan tahay dhinaca midig ee LDP, doorashadeeda LDP waxay rajeynaysaa inay ku soo ceshato cod-bixiyayaasha xagjirka ah ee u jeestay xisbiga Sanseito ee midigta fog.\nXisbiga Sanseito, oo ku tartamaya hal-ku-dhegga \"Jabbaan Marka Hore,\" ayaa dhawaan ka soo kacday hal kursi ilaa 15 kursi, iyagoo ka jiiday cod-bixiyayaasha xagjirka ah. LDP waxay lumisay inta badan kuraasta labada aqal ee baarlamaanka.\nTakaichi lafteeda ayaa qirtay dhibaatada khudbad ay jeedisay ka dib markii ay ku guuleysatay wareegga koowaad ee codbixinta: \"Waxaan si gaar ah uga helnay dhaleeceyn adag taageerayaasheena asaaska ah, xagjiriinta, iyo xubnaha xisbiga.\"\n\"LDP waa inay isbedeshaa danta Jabbaan ee hadda iyo mustaqbalka. Mar walba waxaan horay u dhigeynaa danaha qaranka waxaanan maamuli doonnaa dalka iyadoo la ilaalinayo dheelitirnaan.\"\nBaarlamaanka ayaa la filayaa inuu xaqiijiyo magacaabiddeeda ra'iisul wasaare 15-ka bishan Oktoobar.", "date": "2025-10-05", "scraped_at": "2025-10-29T17:43:30.243887+00:00", "category": "news", "text_hash": "c6d9396e69a506409d38bf4bd5209f6dc6b4dd67f84251bba5df78439c232848", "minhash_signature": "4558404,6441728,9917805,4492304,3201435,2142890,3687666,5212205,2144830,20197360,3019282,653683,8539493,10658365,9358532,4501466,3722802,4337241,1020892,3984719,2358277,46833,3760464,4436629,10655018,34759679,7166615,3291175,9188559,538548,5750004,4678731,3023875,930784,6293391,7773643,1970066,16321816,3275588,140861,3774772,317314,495068,726122,1178689,5195918,521912,8876288,4081249,10662252,5502835,7292635,7818714,6620645,2272582,1033153,1597893,2525894,1429468,10352094,8466819,1789291,2098208,5122119,732862,8101001,10230522,1415890,760267,2225471,1996031,211554,307809,1858749,2084606,331581,14213397,14605134,5548273,9695325,960440,1833445,7035613,7158501,3351699,6101490,422700,93710,7286183,619186,14354115,5060466,2448468,5155977,317736,2046670,5223962,1657350,1227304,20313,50577,3976487,12677196,263064,4893994,4873585,2536508,2248845,10619,3181617,3087797,3891502,12272773,6866276,820037,3226547,1308585,58715,6235640,6579376,1534275,14158216,33055363,431331,1928421,6390172,9304171,17010914"}
{"url": "https://www.bbc.com/somali/articles/cvg762jjn5no", "title": "Nin gantaallo uu ka keenay Iiraan marsiin jiray meel u dhow xeebaha Soomaaliya oo la xukumay", "text": "Xigashada Sawirka, US Department of Justice\nShakhsi tahriibinayey hubka kaas oo u adeegsaday doon kalluumeysi inuu kusoo raro gantaallada ballistic-ga ee Iiraan ee uu u waday fallaagada Xuutiyiinta Yemen ayaa lagu xukumay 40 sano oo xabsi ah dalka Maraykanka.\nMuhammad  Pahlawan oo u dhashay Pakistan ayaa lagu xiray howlgal ay ciidamada Mareykanka ka fuliyeen badda Carabta (Arabian Se) bishii Janaayo 2024 – xilligaasi oo ay ku qaraqmeen labo Markab oo Maraykan ah.\nShaqaalihii Pahlawan ayaa ka marag kacay in lagu khiyaamay inay ka qayb qaataan, iyagoo aaminsan inay u shaqaynayeen sidii kalluumaysato oo kale.\nXuutiyiinta ayaa xilligaasi weerarro gantaallo ah iyo kuwa diyaaradaha  aan duuliyaha lahayn ku qaaday Israa'iil, waxayna beegsadeen maraakiib ganacsi oo caalami ah oo marayey Badda Cas iyo Gacanka Cadmeed, iyagoo sheegay inay sidaasi u sameeyeen si ay u garab istaagaan reer Qasa. Iiraan ayaa si joogto ah u beenisay inay hubaynayso Xuutiyiinta.\nMarag furka faahfaahsan ee shaqaalaha doonta ay siiyeen maxkamad ku taal gobolka Virginia ee dalka Maraykanka ayaa bixinaysa muuqaal naadir ah oo ku dhex jira hawlgal tahriib ah oo gacan ka geystay awoodda weerarrada.\nEnd of Ugu akhris badan\nQaybaha hubka ee laga helay doonta Pahlawan waxay ahaayeen \"qaar ka mid ah hababka hubka ee ugu casrisan ee Iiran ay ku sii wado kooxaha kale ee argagixisada\", Dacwad oogayaasha Federaalka Mareykanka ayaa sidaasi sheegay kadib maxkamadeyntiisa.\nEedeysanaha oo 49-jir ah ayaa la xukumay Khamiistii, iyadoo horay loogu helay shan dambi- oo ay ku jiraan dembiyo argagixiso iyo inuu soo raray hubka wax gumaada.\nDukumeentiyada maxkamada ayaa muujinaya xukunka labo ka mid ah shanta dacwadood mark la isku daro ay gaareeyso 240 bilood, ama 20 sano. Saddexda dacawdood ee kale ah 20 sano oo kale - taasoo ka dhigaysa wadar ahaan 480 bilood, ama 40 sano.\nSiddeedda qof ee shaqaalaha doonta ah oo maxkamadda ka marag furay ayaa sheegay in aysan waxba kala socon waxa ku jiray baakadaha waaweyn ee saaran doonta loogu magac daray Yunus.\nMid ka mid ah shaqaalaha markabka ayaa sheegay in markii uu Pahlawan wax ka waydiiyay arrintan, loo sheegay in uu maskaxda ku hayo ganacsigiisa.\nPahlawan, si kastaba ha ahaatee, wuu ogaa sida ay shixnaddu khatar u tahay.\nWaxa uu isku tilmaamay in uu yahay \"qof meyd ah oo socda\" fariin qoraal ah oo ay is dhaafsadeen xaaskiisa, oo la diray maalmo ka hor safarka Janaayo 2024  ee lagusoo qabtay.\n\"Kaliya soo duceey in [aan] ku soo laabanno si nabad ah,\" ayaa ku qornyed farriinta, oo caddayn ahaan loo adeegsaday maxkamadda dhexdeeda.\n\"Maxaa sidan ugu hadlaysaa, 'waxa laga yaabaa in aad soo noqoto ama aadan soo noqon',\" ayay waydiisay.\nPahlawan waxa uu u sheegay xaaskiisa: \"Waxa ay shaqadu ku saabsantahay, gacaliso, nooca shaqada ayaa sidaas ah.\"\nHadalkiisii ugu dambeeyay ee uu kula hadlay intii aanu dhoofin waxa uu ahaa: \"joogteey ducadaada, Alle ha igu geeyo si nabad ah oo nabad ha igu soo celiyo, ee soo duceey\".\nXigashada Sawirka, US Department of Justice\nSafarkan, Pahlawan waxa la siiyay 1,400 oo riyaal ($33,274) - oo ah kharash aad u badan oo dacwad oogayaasha dacwadiisa ay ku tilmaameen \"lacag halis ah\".\nSocdaalku waxa uu ahaa \"qayb ka mid ah hawlgal ballaaran\" oo ay maal-galiyeen oo ay iska kaashadeen laba walaalo reer Iiraan ah, Yunus iyo Shahab Mir'kazei, ayay tiri Wasaaradda Difaaca ee Mareykanka ee xilligaas (oo hadda loo yaqaan Wasaaradda Dagaalka) bayaan ay soo saartay bishii June.\nWalaalaha Mir'kazei ayaa lagu eedeeyay in ay xiriir la leeyihiin Ciidamada Ilaalada Kacaanka Islaamiga ah ee Iiraan (IRGC) - oo ah xoogga ugu awoodda badan Iran. IRGC waxa uu Maraykanku u aqoonsaday urur argagixiso shisheeye.\nLabada shakhsi,  Shahab iyo Yunus Mir'kazei ayaa waxaa dacwad ku soo oogay mas'uuliyiinta Mareykanka, laakiin wali waa baxsad,  waxana la rumeysan yahay inay ku sugan yihiin Iiraan.\nPahlawan waxa uu sameeyay laba safar oo tahriib ah ka hor inta aan la qaban – mid waxa uu ahaa bishii Oktoobar 2023, kan labaadna laba bilood ka dib.\nRagga uu u qoray in ay la shaqeeyaan ayaa dhamaantood kasoo jeeda Pakistan waxayna usoo safreen xadka Iran iyaga oo shaqo raadis ah.\nKa hor inta aysan u dhaqaaqin safarka bishii Diseembar, maxkamadda Mareykanka ayaa dhageysatay, shaqaalaha markabka in loo xilsaaray in ay baakadaha waaweyn ku raraan doonida oo joogtay Chabahar xeebta koonfureed ee Iiraan.\nDabadeed, shan ama lix maalmood ka dib, markii ay badda ku jireen, markii ay u dhawaayeen xeebaha Soomaaliya, shaqaalihii markabka waxay tilmaameen doon kale oo habeenkii soo ag istaagtay taas oo ay ku wareejiyeen xamuul.\nMehandi Hassan oo xubin ka ah shaqaalaha ayaa maxkamadda u sheegay in doonta kale ay saarnaayeen ilaa shan nin, kuwaas oo ku hadlay luqad uusan garaneyn.\nSocdaalkoodii xigay ee bisha ku xigtay aya la filayey in uu maro isla dariiqii hore ee safarka. Sidii hore oo kale, waxa ay ka bilaabatay dekedda yar ee Konarak ka hor inta aanay u shiraacan Chabahar, halkaas oo shaqaalihii markabka lagaga dhigay in ay ku raran yihiin sanduuqyo culus.\nBaakadaha, ciidamada badda ee Maraykanka ayaa mar dambe ogaan doona, in ay ku jiraan qaybo ka mid ah gantaallaha ridada dheer ee ballistic ah oo ay Iiraan samaysay, qaybo ka mid ah gantaallaha maraakiibta ka hortagga iyo hub.\nXigashada Sawirka, US Department of Justice\nTaariikhdu markii ay ahayd 11-kii Jannaayo, shaqaaluhu waxay sheegeen in ay ku baraarugeen guuxa  helicopter dushooda taagan iyo markab ay leeyihiin ciidamada badda ee Maraykanka oo garab taagan. Pahlawan ayaa ka soo baxay qolkii uu ku jiray si uu qof walba ugu sheego \"inuu sii socdo\" oo uusan joojin doonida, isagoo u sheegay in markabka iyo helikabtarrada ay leeyihiin burcad badeed.\nCiidamada Badda Mareykanka oo hubeysan iyo saraakiil ka tirsan ilaalada xeebaha ayaa isku dayay inay fuulaan doonta Yunus. \"Waxaa jiray buuq badan,\" mid ka mid ah shaqaalaha Doonta, Aslam Hyder, ayaa sidaasi u sheegay maxkamadda.\nSarkaalka Gaarka ah ee Dagaalka Christopher Chambers ayaa gacantiisa ay u sibxatay oo ku dhacay biyaha intii uu socday hawlgalka - waxana biyha ku booday sarkaalka kale ee dagaalka ee heerka koowaad Nathan Gage Ingram si uu isku dayo inuu badbaadiyo.\nLabada nin ayaa si aad ah ugu rarnaa qalab, si degdeg ah ayey u qaraqmeen sida lagu ogaaday warbixin gudaha ah oo markii dambe la helay. Meydadkooda lama helin, waxaana lagu dhawaaqay inay dhinteen 10 maalmood ka dib.\nShaqaalihii saarnaa Doonta Yunus ayaa ku sugnaa doonta dusheeda labo maalmood ka hor inta aan loo wareejin markab ay leeyihiin ciidamada badda ee Mareykanka, maxkamaddu waxay sheegtay in loo kala saaray laba kooxood oo lagu hayey laba konteenar oo aan daaqad lahayn.\nPahlawan ayaa ku amray shaqaalihii markabka inay been sheegaan, wuxuuna sheegay in kabtankii uu mar hore baxsaday. \"Wuxuu yiri, 'Ha u sheegina inaan anigu ahay kabtanka, sababtoo ah waxa aan kuu geysan\nkaraa dhaawac halis ah haddii aad sidaas sameysid',\" Aslam Hyder ayaa u sidaasi u sheegay maxkamadda.\n\"Wuxuu bilaabay inuu noo hanjabo... in qoyskeena iyo carruurtu aanay  na arki doonin, mana ogaan doontiin waxa ku dhacay,\" ayuu yiri. \"Markaa aad ayaan u cabsannay, waanan aamusnay\" ayuu yiri Aslam Hyder.\nShaqaalaha markabka ayaa mid mid caddeymo u bixiyay, waxaana laga soo saaray konteenarka , si kali kali loogu wareeysto. Qof kasta oo doonta saarnaa - oo uu ku jiro Pahlawan - ayaa la weydiiyay cidda uu yahay kabtanka, sida ay sheegeen dacwad oogayaasha Mareykanka, Pahlawan \"si fudud ayuu isaga fogeeyay, been ayuu sheegay, oo waa uu is qariyey\".\nMilateriga Mareykanka ayaa sheegay in baakadaha laga helay Doonta Yunus ay ahaayeen hubkii ugu horreeyay ee Iiraan ay keento ee ay qabtaan ciidamada Mareykanka tan iyo markii Xuutiyiinta ay bilaabeen inay weeraraan maraakiibta mareysa Badda Cas dhowr bilood ka hor.\nLaakiin Pahlawan waxa uu marayey waddo ay ka siman yihiin mukhalasiinta hubka u siday Yemen.\nIntii u dhaxaysay 2015 iyo 2023, ciidamada Maraykanka iyo xulafadooda ayaa gacanta ku dhigay ku dhawaad 2.4 milyan oo rasaas ah, 365 gantaalada lidka taangiyada ah, iyo in ka badan 29,000 oo hubka fudud iyo kan dabacsan oo ay wateen doomo yar yar oo marayay Badda Carabta, sida lagu sheegay warbixin ay soo saartay Qaramada Midoobay.\nCaadi ahaan, Kuwa wax tahriibiya ayaa isticmaala nooc ka mid ah doomaha yar yar, inta badanna ah kuwa  kalluumeysiga - si ay shixnad ugu daabulaan meel u dhow xeebaha Soomaaliya.\nXigashada Sawirka, US Department of Justice\nWilliam Freer, oo ka tirsan guddiga Golaha Cilmi-baarista Geostrategy ee UK, ayaa u sheegay BBC News in iyadoo inta badan weerarrada Xuutiyiinta ay ku lug leeyihiin hub yar yar, qaybaha laga helay markabka Pahlawan ay yihiin \"mid aad casri u ah oo aad u xoog badan\".\n\"Si dhaqso ah, inta badan shirkadaha maraakiibta waxay go'aansadeen in ay dhammaan safarkooda maraakiibta u weeciyaan, halka ay suurtagal tahay, agagaarka Koonfur Afrika halkii ay ka gudbi lahaayeen Badda Cas.\"\nSocdaalkan dheer ayaa ku daraya10 ilaa 12 maalmood oo wakhtiga socodka ee safar kasta, iyo shidaal dheeri ah, kaas oo kuwa horey u falanqeyay arinkan ay ku qiyaaseen inay ugu kacayso shirkadaha $1m (£748,735) oo dheeri ah safarka kasta oo wareeg ah.\nMaraykanka, UK, Israel iyo Sucuudiga ayaa Iiraan ku eedeeyeen in ay gantaalo iyo hub kale ugu soo gudbiso Xuutiyiinta dhinaca badda, taas oo jabinaysa qaraarkii Golaha Ammaanka ee Qaramada Midoobay, tan iyo markii kooxda hubaysani ay 10 sano ka hor ka saareen dawladda Yemen ee caalamku aqoonsan yahay inta badan waqooyiga-galbeed ee Yemen, taas oo dhalisay dagaal sokeeye oo ba'an. Iiraan waa ay diiday eedeyntaas.\n5tii bishii Juun ee sanadkan, Pahlawan waxaa lagu helay danbi ah inuu maleegay inuu taageero agab iyo dhaqaalle u fidiyo argagixisada; siinta taageero agab  barnaamijka Ilaalada Kacaanka Islaamiga ah ee Iiraan ee barnaamijka hubka wax gumaada; shirqoolka iyo u daabulka walxaha qarxa ee Xuutiyiinta, iyadoo la og yahay in qaraxyadan loo adeegsan doono in dhibaato lagu geeysan karo iyo in uu u hanjabay shaqaalihiisa.\n\"Pahlawan kaliya ma ahayn tahriibiye khibrad leh,\" dacwad oogayaashu waxay sheegeen, \"wuxuu ogaa waxa uu tahriibinayey iyo waxa loogu talagalay in loo isticmaalo.\"\nQareenka Pahlawan oo codsigii ugu dambeeyay u gudbiyay maxkamadda ayaa qoray in nolosha xaaska Pahlawan ay muddo dheer ka fogaaneyso qoyskeeda, sababtoo ah guurka ay isaga guursatay, iyadoo  tan iyo markii la xiray, nolosheedaa iyo tan ilmaheeda ay noqotay \"mid aad u adag\".\n\"Tan iyo markii ay xukuntay xeer-beegtida, Mr Pahlawan waxa kali ah ee uu diiradda saaray wada-hadalkooda telefoonka waa bad-qabka qoyskiisa,\" ayuu yiri qareenkiisa. \"Kama hadlo naftiisa iyo masiirkiisa, wuu ooyaa isagoo ka welwelaya waxa ku dhici doona xaaskiisa iyo ubadkiisa.\"\nLaakiin maxkamaddu waxay xukuntay in xukunkiisa dheer uu ahaa mid ku haboon dabeecadda iyo duruufaha dembiga iyo taariikhda iyo astaamaha eedaysanaha.", "date": "2025-10-19", "scraped_at": "2025-10-29T17:44:30.330284+00:00", "category": "news", "text_hash": "f9e16bfd1d2c1060f2f8113443dd63627e1155271dcdc51d4b51546fb70f94f1", "minhash_signature": "2259492,2318450,2147681,3120533,350348,754311,127817,230531,1988219,42257,536856,785635,1157609,6547110,5701102,214331,3076244,1436087,549206,1572858,1535153,3366563,897625,978596,5378014,1650388,577779,6618129,142588,6099931,1180482,3959757,913670,3575638,9036339,3647656,938115,3634706,442418,3829031,1961461,3716440,4368236,5131081,4880838,4367847,1459970,1853868,1276790,4171035,1912406,140689,6561748,2811923,479831,812589,525876,2523903,851380,6095885,1386213,2045447,4131135,530947,12887,3030944,6658093,184740,907351,2070628,209923,5618226,111365,6372863,2867229,2942774,1021846,182888,2798196,365628,2179668,4774747,957672,893988,7647292,2405445,4412967,4438562,5012762,2659275,1699043,2071377,4967567,1602631,903960,296154,277722,255794,1227304,970920,1528062,2566720,996779,156173,76133,26502,605849,45484,621084,1348894,601649,6913122,6785939,2137501,759821,2750244,792718,921702,781391,9147057,6256793,729811,3484818,1104238,2189115,802298,93088,7940111"}
{"url": "https://www.bbc.com/somali/articles/c0kpxv0r5z8o", "title": "Maxay yihiin caqabadaha horyaalla hirgalinta heshiiska Ceerigaabo,  kheyraadka dabiiciga ahse door ma ku leeyahay colaadda", "text": "Xigashada Sawirka, Baraha bulshada\nWaxaa magaalada Ceerigaabo ee xarunta Gobolka Sanaag lagu soo gabagabeeyay shirkii nabaddeynta ee maalmihii u dambeeyay ka soconayay Magaalada, iyada oo uu goob joog ka ahaa madaxweynaha Somaliland Cabdiraxmaan Cirro.\nHaddaba maxay yihiin caqabadaha horyaala dhaqan galka heshiiska ee ay tahay in wax laga qabto iyo doorka khayraadka dabiiciga uu ku leeyahay colaadaha soo noqnoqda ee ka dhaca gobolka Sanaag?\nSi nabaddu u ahaato mid sii jirta ayay tahay in la sii wado nabadeynta sida uu qabo Qareen Guuleed Dafac oo arrimaha bini'aadantinimada iyo gobolka ka faalooda ''Nabaddu si ay noqoto mid waarta oo sii jirta waxaa loo baahan yahay in dadaalada nabadeed aan la joojin oo aan loo qaadan in halmar ay ku dhammaato, nabadda iyo nabadaynta maalin qura kuma dhammaato. Dadka waa in la isu soo jiidaa oo la is fahamsiiyaa oo xiriiradooda la xoojiyaa, waana in wax laga qabtaa waxaabaha marka hore colaadaha keena ee isha u ah dadku inay is qabsadaan oo is dilaan''\nShirka nabadeynta ee la soo gabagabeeyay ayaa waxaa ka maqnaa mid kamid ah beelaha deegaanka, iyada oo gobolka Sanaag yahay mid ay beelo badan deggen yihiin, ayna tahay in si gaar ah loo eego ''Gobolka Sanaag marka hore waa gobol xasaasi ah oo u nugul arrimaha colaadaha, sababta oo ah beelo kala duwan baa deggan, waana sababta markii gooni isutaaga Burco looga dhawaaqay qodobadii lagu dhawaaqay ay ka mid ahayd in arrinta gobolka Sanaag si gaar ah loo eego, waxaana berigaa ay qaadatay dhowr sanadood. Marka in beeli ka maqan tahay waxa ay muujinaysaa in aanu weli arrinku dhamaystirmin'' ayuu yiri Guuleed Dafac.\n''Dowladdu waa inay xoojisaa maamulka iyo kala dambaynta gobolka, mararka qaar reeruhu inay is dilaan waxaa keena in dambiilayaashu baxsadaan oo lasoo qaban waayo, waa in ammaanka la xoojiyo oo booliska la daadajiyo, maxkamadaha la adkeeyo, caddaalada la xoojiyo, beelaha gobolka degga oo dhana ay iska dhex arkaan maamulka'' ayuu sii raaciyey.\nEnd of Ugu akhris badan\nKhayraadka dabiiciga ayaa kamid ah waxyaabaha uu gobolka Sanaag caanka ku yahay iyada oo mararka qaarna uu sababi karo isku dhaca beelaha.\n'Berigii hore dadku waa yaqaaneen sida loo maareeyo arrimaha beeyada ama kaluumaysiga waayo wax ay boqlaal sano ku soo dhaqmayeen ayay ahayd. Hadda waxaa soo kordhay Dahab oo dadku ma yaqaan si loo maareeyo waayo cidda leh lama yaqaan, taasina waxa ay keentay dadku isku dhacaan. Waa arrin afrika ka dhacda, marka dahab yimaado waa lagu yaacaa, taasina isku dhac bulsho ayay abuurtaa. Gobolku markii hore ayuu sii nuglaa, marka ''haa'' dhib badan buu ku hayaa gobolka waana mid kamid ah waxyaabaha ay tahay in awoodda la sii saaro oo la sii xoojiyo oo wax laga qabto''.\nSi looga badbaado colaado ka dhalata khayraadka ayaa qareenku wuxuu qabaa in dowladda looga baahan yahay maamulkeeda. ''Dowlada ayay tahay inay maamusho khayraadka. Dahabka dadkaa helay dabadeedna waa ku yaaceen iyada oo dowladu xeerar iyo nidaam aysan u samayn, kolkaa markiiba dhibaatuu keenay. Waxa ay u baahan tahay dowladu in gacan ku hayn fara badan ku samayso inay maamusho, nidaamiso oo qaabka leesanka u bixiso ka taxadarto. Marka khayraadka dabiiciga dhinacna waa ka barako iyo khayr, dhinacna waxaa u ka noqdaa dhibaato oo dalalka uu inkaarta ka noqday waxaa kamid ah Suudaan, Koonfurta Suudaan iyo Congo. Waxyaabaha lagu kala bartayna waa sida loo maareeyo waxay ku xiran tahay in uu wax ku taro ama inuu wax ku yeelo''.\nXigashada Sawirka, Facebook\nShirkaasi ayaa laga soo saaray Lix qodob oo ay isku raaceen ergadii iyo guddiyadii nabadda ka shaqaynaysay.\nWasiirka Gaadiidka iyo horumarinta jidadka Somaliland Cismaan Ibraahim Nuur, isla markaana ah guddoomiyaha guddiga qaban qaabada shirka nabadda Ceerigaabo ayaa warbaahinta la wadaagay qodobada oo ay kamid ah yihiin in nabadda iyo walaaltinimada lagu wada noolaado guud ahaan gobolka Sanaag iyo degmada Ceerigaabo, waxaa ay beeluhu isla qaateen in nabadda loogu baaqo lagana howlgalo sidii loo raadin lahaa cid kasta oo ka maqan gogosha nabadda ee madaxweynaha Somaliland dhigay, waxaa loogu baaqay xukuumada Somaliland inay ka fuliso mashaariic horumarineed gobolka sida ugu dakhsiiyaha badan.\nWaxaa kale oo kamid ahaa qodobada uu wasiirku sheegay in lagu heshiiyay in dowladda Somaliland ay masuul ka tahay ammaanka iyo nabadda gobolka Sanaag.\nSuldaan Siciid Suldaan Cabdisalaan oo ka qayb galay shika ayaa soo dhoweeyay qodobada shirka laga soo saaray ''Maanta oo ay tahay maalin taariikhi ah oo aan halkan isugu nimi nabadgalyada gobolka Sanaag, intii ka qayb qaadatay waan uga mahadcelinayaa waana soo dhoweynayaa waa maalin taariikhi ah, madaxweynahana gaar baan ugaga mahad naqayaa howshaas isagaa u ahaa garwadeen gogoshana bilaabay, raggii la qaban qaabiyay ee la qabtayna waan uga mahadcelinayaa, madaxweyne waxaan leeyahay inta hartayna dhammaystirkeeda adigeey kuu taalaa iyo dowladaada, marka anagana garab baan kugu siinaynaa diyaar baan u nahay, wixii dhimmana waan dhamaystiraynaa''.\nMadaxweynaha Somaliland ayaa dhankiisa baaq u diray beelaha dega Ceerigaabo inay ka shaqeeyaan nabadda ''Waxaan ku soo gunaanadayaa hadalkayga oo summadna uga dhigayaa in nabaddu ay kamid tahay shaqooyinka aanay dowladuhu kaligood fulin karin, nabaddu gunta ayay ka soo tolantaa, sidaa awgeed ma hirgasho haddii aanay qofka ama qoyska iyo bulshadu ka soo unkamin iyaguna aanay ilaalin. Heshiiskaa aynu gaadhnay, nabaddaa aynu unugnay waa in aynu dhaadhicinaa''.", "date": "2025-10-23", "scraped_at": "2025-10-29T17:45:30.297053+00:00", "category": "news", "text_hash": "489cfb1375d35bc12a8d60fb8f5c5c9baaf0499b2a415efa2379a83d6ab73fd9", "minhash_signature": "4483140,2395931,18865116,4861915,5554336,5495100,628816,1761769,4776594,6395875,7296105,522455,1646447,1528026,10112934,5335380,3496227,5044825,1011790,3943821,3594358,342355,1992289,6468896,1967557,2694284,1913150,6074903,64586,6624010,8986856,3767196,6612917,7616240,805629,2498419,3205678,5596375,3008520,3517212,9323,5329109,15032184,9882457,8140240,3926050,24137107,1059770,7260637,6110717,7797782,6653905,127150,7981935,11357660,5607614,5954198,197472,4356103,1530210,1315521,4939359,2412580,2584076,1073205,6274706,3028566,8464352,10110188,2488354,3151647,26786271,493051,1526376,852431,1048402,4376132,3825330,1558614,26717708,2575586,10206378,6793357,6330008,810597,7045385,178016,6925322,1284148,1091997,21896640,11311934,12321054,11387331,3464622,5122676,2019229,324164,12950483,5194045,8478591,986768,11456990,7806879,20652329,1852057,6960830,5834132,132718,3081854,2143798,2846863,4356009,1430020,8384176,5556682,131038,760321,4862167,9085615,2730198,6963914,2542765,1305797,5920302,933452,17140221,8804149"}
{"url": "https://www.bbc.com/somali/articles/cly1mrd14l3o", "title": "Dalka ugu farxadda badan adduunka: Soomaalida ku nool Finland ma dareemaan farxadda lagu sheegay dalkaas?", "text": "Xigashada Sawirka, ABDIWELI HASSAN\nFinland ayaa sanadkii siddeedaad oo xiriir ah hoggaanka u haysa Liiska Farxadda Adduunka – balse waxa si dhab ah u soo jiita dalxiisayaasha waa qiyamka qoto dheer ee dalka, sida dheellitirka, dabiicadda, iyo qanacsanaanta nolosha maalinlaha ah.\nDadweynaha Finnish-ka ah guud ahaan si daggan ayay u aqbalaan abaalmarinta farxadda sare ee ay heleen, taas oo lagu shaaciyay Warbixinta Farxadda Adduunka ee Qaramada Midoobay bishii Maarso 2025, markii sideedaad oo xiriir ah. Si kastaba ha ahaatee, shirkadaha dalxiiska ee Finland waxay u dabbaaldegayaan sidii dad badan oo safar doon ah ay ula xiriirinayaan Finland iyo farxad, iyaga oo rajaynaya in ay yimaadaan si ay u dareemaan noocaas gaar ah ee farxadda Finnish-ka.\nSi kastaba ha ahaatee, ha filan inaad la kulanto qosol xooggan iyo hadallo farxad leh markaad ka degto garoonka diyaaradaha ee Helsinki ama aad kaga soo degto mid ka mid ah doonyaha Baaltigga dekedda caasimadda.\nWaxaa jira wax run ah oo ku saabsan aragtida Finland oo ah dal aan buuq badan lahayn, dhab ah oo miyir leh. Guud ahaan, Finnish-ku way ku farxaan – xitaa waa ay ku faraxsan yihiin – in la maamuuso iyaga oo ku saleysan natiijooyinka warbixinta, balse iyaga oo si xushmad leh u aqbalaya, waxay dareemayaan in \"farxad\" aysan ahayn erayga ugu habboon. Halkii laga dhihi lahaa \"farxad\", erayo sida \"qanacsanaan\" iyo \"dhammaystirnaan\" ama \"raalli ahaansho nolosha\" ayaa si ballaaran loogu arkaa kuwo ku habboon.\nXigashada Sawirka, Tim Bird\nSida uu madaxweynihii dhawaan la doortay ee Finland, Alexander Stubb, ku qoray Facebook: \"Qofna ma noqon karo mid faraxsan mar walba, mararka qaarkoodna duruufaha ayaa adag. Laakiin marka aasaaska la hagaajiyo – nabadgelyo, xorriyad iyo sinaan – waa bilow wanaagsan.\"\nEnd of Ugu akhris badan\nLaakiin inkastoo fikradda farxadda ee Finland ay tahay mid xeel dheer oo si gaar ah ula xiriirta dhaqanka, haddana si qoto dheer ayay uga mid tahay nolosha maalinlaha ah.\nXigashada Sawirka, AHMENUUR\nDalkan ku yaalla waqooyiga Yurub ayey ku nool yihiin tiro badan oo Soomaali ah oo sanado iyo siyaabo kala duwan ku tagay dalkaasi.\nKumannaan Soomaali ah ayaa ku nool magaalooyinka dalkan loo tiriyo inuu dadkiisu ugu farxada badan yihiin dadyowga caalamka,.. Hadaba dadka Soomaalidu ma haystaan farxadaas sideese u arkaan inay ku noolyihiin?\nCabdiweli Xasan Xaashi Wali, oo  ah wariye ka tirsan telefishinka Qaranka ee Finland muddo dheerna degganaa dalka Finland ayaa xusay in farxada  la sheegayo inay haystaan dadka ku nool dadkaasi uusan isagu haysan ayna kala duwan tahay sida loo haysto iyo sida ay farxadaasi tahay.\n\"Waa wax  fiican y waana wax wanaagsan in dalka an ku noolaa 34 loo  magacabay in 8sano isku xigta wadanka ugu faraxada badan adduunka, laakiin farxadu waa kala nooc habka dadku faraxadu u malayno iyo habka laga wado inay kala duwan tahay ayaa moodaa, Finland waxkasta oo ku saabsan qofka noloshiisa waa shaqeeyaan, hadda cafimaad rabto, waxbarshada, ballamaha qofku marku leeyahay si wanagsan ayaa loola dhaqmaa. Faraxada waxaa laga wadaa waxkasta waa shaqaynayaan, wax carqalad ah qofka ka hor imaan kara waa yar yihiin\"ayuu yiri Cabdweli Wali.\nXigashada Sawirka, Getty Images\nIsagoo si gaara ugu hadlayey farxadda shakhsiga wuxuu sheegay in taasi aysan dadku haysan inta badan.\nWaxyaabaha sida gaarka ah loogu suntay in dadka Finland ku haystaan dalkaasi waxaa ka mid ah inay jiraan meelo qurux leh oo dabiici ah oo ay dadku ka helaan farxad marka ay nasiino iyo tamashle u tagaan sida Cabdiweli Xaashi u sheegay BBC-da.\n\"Aniga laftaydu anigoo Afrikaan ah oo Soomaaliya ka imid, markaan waddankaas joogo meelaha an ku raaxaysto ee aan waqtigayga ku qaato waa meelaha duurka ah oo howdka ah adigoin waxba ka cabsanayn, oo an ka baqayn in lagu dhaco ama lagu dilo, sida dalku u samaysan yahay ayaa ah kuwa shaqaynaya\" ayuu yiri Wali.\nMar isagu  aan si gaara u waydiinnay su'aal ahayd in isagu haystay farxadda lagu sheegay in dadka dalkaasi haystan ayuu yiri \"Maya, farxadda sida aan annaga u naqaano Finland ma taallo\".\nWali, oo muddo ka shaqaynayey telefishinka Finland, haddana si gaara ugashaqeeya qaybta Soomaaliga ayaa xusay in marka ay dadka Soomaalida ay waydiiyaan su'aasha ay u sheegaan inay la yaabaan marka ay maqlaan in dalku yahay kan dadkiisu ugu farxada badan adduunka.\nAxmed Nuur Cali Maxamed oo isna ah wariye muddo dheer ka shaqaynayey Soomaliya haddase deggan dalka Finland ayaa xusay in marka laga hadlayo farxadda qofka Finishka ah ee la xiriirta hab macaamilka ay tahay mid ka duwan taas.\n\"Farxadda meesha laga qiimeeyo ayay ku xiran tahay. Haddii laga hadlayo in Finland tahay waddan horumaray dhanka caafimaadka, waxbarashada oo ay aad ugu sarreeyaan, shaqooyinka, maamul-wanaagga iyo waxyaabaaha keena farxadda haddii laga hadlayo Finland way leedahay waa haysataa, laakiin haddii laga hadlayo qofka shakhsiga ma faraxsan yahay waxaan qabaa su'aashu inay dhinaca kale aadayso oo aysan farxad jirin,\" ayuu BBC-da u sheegay Axmed.\nWuxuu intaa ku daray in qofku inuu faraxasan yahay lagu cabbiro inuu ku salaamo kuu dhoolla-caddeeyo iyo inuu si uun kula falgalo caadiyan dadka Finishka saas maaha.", "date": "2025-04-22", "scraped_at": "2025-10-29T17:46:30.388207+00:00", "category": "news", "text_hash": "f78687d086ffabd65bab8f4f6bd5b60b56a70c443c31ac983efaadb8d5e07e20", "minhash_signature": "6316722,8671585,2147681,12743574,950675,4556061,2006118,98682,10536702,170587,4990428,831494,3604612,10207584,176863,13155973,17957287,1322389,13105061,2640499,3079452,1228818,11389578,4436629,7284689,3839358,8967829,2940494,9056597,1661493,12601765,1115116,622995,5606659,881351,938629,411842,4845578,4030717,4646465,18444383,3331571,1559420,8339910,262691,3657723,6409422,53144,3959580,643574,6858768,3798213,2123274,2385060,1003524,17955993,6512719,22126268,79870,20540992,4333501,3985112,1367879,8844196,7602617,2467614,4971772,935384,865694,18970473,2553697,5395484,5464439,4746881,1877340,3131699,9379327,9951008,6259409,32794,2084960,7869709,438553,632289,3466107,1550406,1238242,6915310,86443,9710169,10158376,1281239,998687,20619811,1829670,5517609,6962134,190105,1492760,4516919,9160198,1205216,191070,10201879,10862875,5156386,2414149,1164156,3553159,6671641,4380980,5808122,2638812,8138,3575553,10185546,3686702,2121341,2165261,1575084,15182129,4694469,16957015,1574933,3189631,3992694,13042036,683719"}
{"url": "https://www.bbc.com/somali/articles/cy0vn07l008o", "title": "Dhegeyso: Soomaali ka ag dhowaa goobta uu ka dhacay weerarka Israa'iil ee Dooxa oo BBC-da u warramay", "text": "Israa'iil ayaa shalay weerar cirka ah ku qaadday dhimse la deggan yahay oo ku yaalla oo ku magaalada Dooxa ee dalka Qatar, taas oo Xamaas ay sheegtay in ay ku dishay shan ka mid ah xubnaheeda, balse \"ay ku guul-darreysteen\" in ay dilaan kooxdoodii wada-xaajoodka u ahayd ee ka shirayey soo jeedintii ugu dambaysay ee Maraykanka ee ku aaddanayd xabbad-joojinta Qasa.\nRaysalwsaaraha Israa'iil Benjamin Netanyahu ayaa sheegay in uu amray \"weerar sax ah oo bartilmaameed leh\" oo lagu qaaday Xamaas, taasoo jawaab u ah weerarradii kooxdaasi ay gaysatay ee 7-dii Oktoobar 2023-kii iyo toogasho ka dhacday magaalada Quddus oo ay ku dhinteen lix qof, toodbaadkan.\nRaysalwsaaraha Qatar, Sheekh Maxmaed bin Cabdulraxmaan Al-Thani ayaa sheegay in dalkiisa \"uu ka fakarayo\" in ay ka jawaabaan \"Weerarka qaawan\" ee Israa'iil, isagoo intaa ku daray in Mareykanka uu uga digay 10 daqiiqo kaddib markii uu bilowday.\nMadaxweynaha Mareykanka Donald Trump ayaa sheegay in aanu ku faraxsanayn wixii dhacay.\nHaddaba, waxa aan la hadalnay Ibraahim Saleebaan Cali oo ka tirsan jaaliyadda Soomaalida ee magaalada Dooxa ee dalka Qadar, kana ag dhowaa goobta uu weerarku ka dhacay.\nLifaaqa kore ka dhegeyso wareysiga:", "date": "2025-09-10", "scraped_at": "2025-10-29T17:47:30.200845+00:00", "category": "news", "text_hash": "8bd41ddd31c3e29de8be42081689cf605b5a0d76219e6ad431eae26199cd569f", "minhash_signature": "8002925,53046872,31206950,18039055,1315892,1156840,54328961,16248732,50698865,348967,7911471,52182858,25497836,10713035,450402,37091420,26739462,2202526,13640379,4187389,11123497,2707221,7698487,122780,18291778,24080178,63014315,3546285,17802934,2794013,144364966,8428727,32243434,4806238,9338448,25473096,6338925,9011384,97491172,4429305,52250011,16760276,17938523,11588453,74911887,43714040,19927698,25245752,1633716,30903077,1549621,26024544,60912565,12744036,23448727,11375892,43358690,3147053,67774996,20999994,4675529,3045726,9554617,21031367,43878382,28064005,12196460,37774541,30998065,33019662,11155047,22402178,14010462,47634184,96195702,9594960,2277904,48908175,29847588,8034442,81056936,29974621,28382073,4703720,37263950,31080119,23828013,7038152,5073923,6390353,179225,11901976,13459629,61617786,87399509,32567298,11529946,6582396,1492760,15584808,19118843,8292370,28943527,34332843,88199,32661724,15475118,3399554,16204459,48648927,1009201,15723618,9648983,37825467,27623741,8296439,10555706,10868709,4208063,17962158,6450965,784340,93616981,17522887,36478230,845659,19533820,11642112"}
{"url": "https://www.bbc.com/somali/articles/crkj7066jdko", "title": "Dhegeyso: Lix sano kahor madaxdu way ku qosli jireen khudbadda Trump ee QM markanse way aamusnaayeen", "text": "Khudbaddii uu Donald Trump u jeediyay Qaramada Midoobay ayaa ahayd mid ka mid ah waxyaabihii aadka u muujinayay sida uu u arko caalamka, fikirkiisa oo ah qaab cayriin ah.\nIn ku dhow hal saac, waxa uu u jeeday kuwii ka soo horjeeday iyo fikradahooda, isaga oo mid mid u kala saaraya marka uu dunida ku soo wareegayo.\nDalka ayuu ka bilaabay, isagoo ammaanaya Mareykanka iyo naftiisa. Waxa uu sheegay in Maraykanku uu ku noolaa waqti dahabi ah, waxaanu ku celceliyay sheegashadiisii ​​aadka loogu muransanaa ee ahaa in uu shakhsiyan soo afjaray toddoba dagaal, taas oo uu ku dooday in uu ku mutaystay abaalmarinta Nobel Peace Prize.\nHaddaba, lifaaqa ka dhegeyso khudbadda Trump iyo sida ay Soomaalida Mareykanka u arkaan, waxaa soo koobaya weriye Siyaad Siciid Saalax.", "date": "2025-09-24", "scraped_at": "2025-10-29T17:48:32.121169+00:00", "category": "news", "text_hash": "e7fe87d4b6334d03c62c4c7ad3d5e7c097e4b60c7652914e7bbaaf0b4bca4b7b", "minhash_signature": "48069880,695275,21560562,2743827,23712377,60652436,15090222,78218851,17071809,73301262,37968766,6283743,32214352,5897188,35932228,20986621,48120915,47914495,99491295,29712492,36888576,13613709,54379916,15974208,4421520,6075846,27017860,31977984,63352552,104534322,4554442,74293207,51512407,23526057,23435597,55902899,13993173,16526840,18050065,21570946,65573079,31945229,35153386,19944854,19975749,9064897,14395759,9352601,6508525,126626807,33496149,19150659,7895434,37732645,13284985,41285860,35686463,68085598,45654745,72511136,28314068,119704483,94704900,38442210,924603,6221074,76030433,40102670,56284046,9954966,10247033,15560206,36040886,38057418,6657042,44980919,100297813,74130777,75820585,22909742,32101536,39417058,27499467,28256862,42422973,2830510,9968107,22896693,2466601,16553260,8902382,15126982,71597008,5955830,19660699,16632202,80304886,5008599,1492760,19982872,43484001,92981705,2820219,26739582,65958693,39187854,8578269,68467247,70538729,19700808,23039286,68661559,5779865,9681586,36829390,107885335,21449540,20635823,36111681,60292270,82013011,75352435,47154055,52271123,90631021,40961949,17890680,84389876"}
{"url": "https://www.bbc.com/somali/articles/cm2zp11mymro", "title": "Dowladda Soomaaliya oo iska fogeysay inay heshiis qarsoodi ah la gashay Sweden", "text": "Xigashada Sawirka, Radio Sweden\nDowladda Soomaaliya ayaa beenisay warar ay dhowaan baahiyeen qaar ka mid ah warbaahinta Sweden, oo ku saabsan inay galeen \"heshiis qarsoodi ah\" oo isku xiraya gargaarka horumarineed iyo dib u celinta muwaadiniinta Soomaaliyeed.\nWar-saxaafadeed kasoo baxay xafiiska raysal wasaaraha Soomaaliya ayaa lagu sheegay in arrintaas aysan waxba ka jirin.\n\"Eedeymahan waa kuwo been abuur ah, marin-habaabin ah, isla markaana aan sal iyo raad toona lahayn. Ma jirto heshiis qarsoodi ah ama shuruudeysan oo Soomaaliya ay la gashay waddan kale oo ku saabsan dib u celinta muwaadiniinteeda Soomaaliyeed.\n\"Xiriirka u dhaxeeya Soomaaliya iyo Sweden waa mid soo jireen ah, kuna dhisan is ixtiraam iyo sharciga caalamiga ah. Dhammaan wada shaqeynta iyo wada xaajoodyada waxaa lagu fuliyaa heer diblomaasiyadeed oo daah-furan iyadoo lagu hubinayo kormeerka Golaha Wasiirrada iyo isla xisaabtanka hay'adaha dowliga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nXigashada Sawirka, aftonbladet\nRadiyoowga madaxa banaan ee dalka  Sweden ee \"Ekot\" ayaa dhowaan daaha ka qaaday in Sweden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya, kaasoo 100 milyan oo karoon oo ka mid ah miisaaniyadda gargaarka lagu wareejiyay mashaariic  la xidhiidha dawladda Soomaaliya.\nEnd of Ugu akhris badan\nTaas beddelkeeda, Soomaaliya waxay aqbashay, sida ay idaacaddaas sheegtay, dib u soo celinta muwaadiniinta u dhashay.\n\"Khatarta musuq-maasuqa dhici karaa waa mid aad noogu cad aniga oo arrimahan ka shaqeeyey muddo dheer\" ayay tiri Wiilo Cabdulle Cismaan, oo sannado badan ka shaqaynaysay arrimaha dib u celinta Soomaalida.\nSida ay idaacaddu sheegtay, heshiiska ayaa la gaaray bishii Diseembar 2023. Musaafurinta qasabka ah ee Soomaalida ayaa aad kor ugu kacday, iyadoo sanadkii hore  la tarxiilay 28 qof, sida ay booliisku sheegeen.\nEkot ayaa shaaciyay in ilo xog-ogaal ah oo ka kala socda Soomaaliya iyo Sweden ay u sheegeen  in dalabka Soomaalida uu ahaa in \"lacagta kaalmada Sweden la geliyo dadka ku hareeraysan xukuumadsda si ay saameyn ugu  yeeshaan si ka duwan, markaad barbar dhigto sida nidaamka mucaawinadda ee caadiga ah loo maamulo\".\nDhanka kale, mid ka mid ah wargeysyada ugu afka dheer Sweden, Aftonbladet, ayaa qoray war kaas la mid ah.\nWargeyska ayaa soo qaatay wiil Soomaali ah oo lagu magacaabo Xasan Cusmaan oo 24 jir ah, kaas oo uu wargeysku sheegay inuu ka mid yahay Soomaalida lagu qasbay inay isaga baxaan dalkaas.\n\"Wuxuu helay warka kadib markii Swden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya. Hadda wuxuu u baqayaa naftiisa.\" Ayuu wargeysku qoray.\nXigashada Sawirka, X\nSweden ma aysan soo saarin faallo rasmi ah oo la xiriirta arrintan, balse khubarrada diblomaasiyadda ayaa sheegaya in wada-xaajoodyada la xiriira socdaalka iyo iskaa u laabashadu ay tahay arrin xasaasi ah oo u dhaxeysa dowladaha Yurub iyo Afrika, gaar ahaanna xilli bannaanbaxyo looga soo horjeedo soo-galootiga ay ka socdaan eybo ka mid ah Yurub.\nMa aha markii ugu horreysay ee ay soo shaac baxaan wararka ku saabsan in Soomaaliya ay heshiis kula gashay dal Yurub ah celinta muwaadiniinteeda.\nMadaxweynaha Soomaaliya Xasan Sheekh Maxamuud oo sanadkii hore booqasho ku tagay dalka Jarmalka iyo dhiggiisa dalkaas ayaa ku dhawaaqay qorshooyin lagu celinayo Soomaalida aan sharciyan joogi karin dalkaas.\nSweden waxay sheegtay in Soomaali kumannaan gaaraysa ay qeyb ka yihiin dadka magangalyada ka helay Jarmalka, kuwaas oo hadda kaalin wanaagsan ku leh horumarka iyo wada-noolashaha guud ee bulsho-weynta dalkaas.\nSanadkii hore dowladda Jarmalka waxay sheegtay dadka la celinayo in ay sidoo kale dan ugu jirto Soomaali badan oo ku nool jarmalka kuwaas oo si fiican dalka u dhexagalay.\nKulankii madaxweynaha Soomaaliya iyo hoggaamiyaha jarmalka dhexmaray wuxuu xiligaas ka sheegay madaxweynaha Soomaaliya in aysan aheyn Soomaaliya dal dagaal sokeeye ku jira oo ay doonayaan in ay ka helaan Jarmalka maalgelin.", "date": "2025-10-08", "scraped_at": "2025-10-29T17:49:30.904084+00:00", "category": "news", "text_hash": "1f9d163badc1e01fe08399b323f1c77d3b6d640e6a97598b25daf9340e01e0a5", "minhash_signature": "25729628,3270716,12009339,15165304,5941960,12202599,427022,2503477,1730676,4400002,3392584,1770018,5408790,14274848,4679421,5236664,30387957,3843205,13004,6130055,15068615,31698582,27233474,87114,8961076,734431,15513853,2080410,2639467,1820781,1374051,1046546,11515314,7516320,1360121,156119,1170204,2676253,6412508,7841065,107482,5840342,12971138,489677,1525445,2309451,8904874,10749618,1624475,4310936,10409203,1061239,4466446,13267029,217381,1629388,1066730,1994887,1725895,121868,5309293,1393504,7348084,6573470,3682161,12592741,3614949,1538610,4267787,2029293,16919925,3490274,10091252,5272322,11151761,7983001,4949758,8678428,2502508,17508089,6847792,9375588,7692283,8376164,20416013,5955684,14596274,7896826,8263014,75156,1026850,834278,1591692,567110,21512161,19143554,1882295,18682621,1492760,182207,16766996,5444624,1595687,18179211,663565,35779476,3028942,11197258,6989630,4902015,31044532,15623061,4623748,2903045,10572357,4115662,5843657,1902834,9989171,1128111,2336388,2870158,19010495,7696568,3380146,8183957,7460634,11198796"}
