{
  "url": "https://www.bbc.com/somali/articles/c3w9ev78z2vo",
  "title": "Daraasad: Kiniinnada ka hortaga uurka ma waxay kordhiyaan Kansarka",
  "text": "Xigashada Sawirka, Getty Images\nHay'adda Caafimaadka Adduunka ee WHO ayaa sheegtay in 1.9 bilyan oo dumar ah oo da'doodu u dhaxayso 15 ilaa 49 sano (da'da taranka) ay jireen guud ahaan dunida sanadkii 2021. Waxaa ka mid ahaa 1.1 bilyan oo haween ah oo u baahnaa habka ka hortagga uurka iyo qorsheynta qoyska, waxaana ka mid ahaa 874 milyan oo doortay inay isticmaalaan hababka casriga ah ee ka hortagga uurka, sida kiniinnada iyo habab kale.\nSi kastaba ha ahaatee, tirada haweenka isticmaala kiniinnada ka hortagga uurka ayaa laga yaabaa inay ka badan tahay inta la diiwaan geliyey, maadaama hababkan hormoonnada ku saleysan sidoo kale loo adeegsado xakameynta calaamadaha xaalado kale oo caafimaad.\nMid ka mid ah calaamadaha ugu waaweyn ee ay kiniinnada ka hortagga uurka caawiyaan in la xakameeyo waa xanuunka PCOS (Polycystic Ovary Syndrome), oo ah xaalad ku dhacda ugxan-sidaha haweenka. Sida ay sheegtay Hay'adda Caafimaadka Adduunka eeWHO.\nWaxay u muuqataa in kiniinnadan, oo markii ugu horreysay la sameeyay kuwoodii hore 1950-meeyadii, ay haatan si adag loogu weerarayo baraha bulshada.\nWaxaa TikTok lagu wareejinayaa tobanaan muuqaal oo malaayiin jeer la daawaday, kuwaas oo ay haween dhalinyaro ahi ku sheegayaan in kiniinnada ka hortagga uurka ay keeni karaan kansar, isla markaana ay Hay'adda Caafimaadka Adduunka dhowaan u aqoonsatay inay yihiin \" heerka 1-aad\" – oo la mid ah tubaakada, khamriga, asbes-toska, iyo hilibka si warshadaysan loo farsameeyay.\nLaakiin intee bay run yihiin sheegashooyinkan? Oo ma jiraan wax kale oo aynaan garanayn oo ku saabsan kaniiniyada ilaalinta uurka?\nXigashada Sawirka, Getty Images\nDhammaan  hormoonnada ka-hortagga uur-qaadista , oo ay ku jiraan kaniinniyada ilaalinta dhalmada, waxay ku shaqeeyaan iyagoo siidaaya hormoon macmal ah 'syn'thetic' kaas oo maskaxda ku khiyaaneeya inaysan u sheegin ugxan-yari inay soo daayaan ukunta bil kasta oo sii dhuujisa xabka ilmo-galeenka ee furitaanka ilmo-galeenka. Si  wada jir ah,  Labadan arrimood oo isu tagay waxay ka hortagaan in ukunta haweeneyda la bacrimiyo, sidoo kalena waxay ka hortagaan in minka uu diyaar u noqdo inuu qaabilo uur.\nWaxaan waydiinay laba dhakhtar faahfaahin dheeraad ah oo ku saabsan kaniinnadan, noocyadooda, sida ay u shaqeeyaan, iyo khatarta la xiriirta.\nEnd of Ugu akhris badan\nProfessor Mohi El-Din Saud oo ah khabiir ku takhasusay arrimaha dhalmada, haweenka iyo kansarka isla markaana leh boqolaal maqaal cilmiyeed oo ku saabsan arrintan, ayaa noo sheegay in tan iyo markii la bilaabay isticmaalka kaniiniyada ugu horreeyay ee dhalmo-xakamaynta sanadihii 1950-meeyadii iyo 1960-meeyadii, laga hadlayey suurtagalnimada in kaniiniyadani ay sababi karaan kansarka.\nSi kastaba ha ahaatee, sida uu sheegay Saud, dhibaatadu waqtigaas \"waxay la xiriirtay nooca iyo qadarka hormoonnada ku jiray kaniinniyadan, kuwaas oo aad uga duwan kaniinniyada maanta la heli karo.\"\n\"Waxay isticmaaleen estrogen keligood, sanado ka dibna waxay ku dareen progesterone, waxayna ku bilaabeen qiyaaso badan oo hormoonnadaas ah, ilaa 100 micrograms ee ethinyl estradiol,\" qaabka synthetic ee estrogen, ayuu sharaxay.\nKaniinnada ka hortagga uurka ee maanta \"waxay ka kooban yihiin 30 micrograms oo ethinyl estradiol ah, halka kaniiniyada kale ay ka kooban yihiin 20 iyo 15 microgram oo hormoonkan,\" sida uu sheegay Saud.\nWaxa uu tilmaamay in si la mid ah progesterone, \"qadarka loo isticmaalo kaniiniyadan si weyn loo dhimay.\"\nKiniinniyadii ugu horreysay ee afka lagu qaato ee ka hortagga uurka waxaa oggolaaday Maamulka Cuntada iyo Daawooyinka Mareykanka (FDA) waxaana suuqa lagu iibiyey sanadkii 1960-kii.\nWaxaa jira laba nooc oo kiniinnada ka hortagga uurka ah kuwaas oo ku kala duwan heerka xadiga iyo qiyaasta maadada.\nDr. Ghina Ghaziri oo ka tirsan jaamacadda Maraykanka ee Beirut ayaa waraysi ay siisay BBC-da Carabiga waxa ay tilmaantay in nooca koowaad uu ka kooban yahay kaliya progesterone oo ay aad u yar tahay, halka nooca labaadna uu yahay kaniini isku jira oo ka kooban progesterone iyo estrogen.\nFaahfaahin ay dumar  badan, oo xitaa kuwa isticmaala kiniinnadan, aanay ogeyn ayaa ah in kiniinnada ka hortagga uurka ay joojiyaan caadada. Dhiigga dumarka ay arkaan maalmaha yar ee ay joojiyaan qaadashada kiniinnadaasi ma aha dhiig caado, balse waa natiijada jirka oo ka jawaabaya bixitaanka hormoonnada, mana la laha wax xiriir ah oo toos ah dhiigga caadada.\nXigashada Sawirka, Getty Images\nMarka hore, waa in la caddeeyaa in Ururka Caafimaadka Adduunka uusan soo saarin wax tallooyin cusub ah oo ku saabsan kiniinniyada ka hortagga uurka, mana uu muujin xiriir toos ah oo ka dhexeeya kiniinnadaas iyo kansarka, sida lagu faafiyay TikTok.\n\"Waa inaan aad u cadaano,\" ayuu yiri Saud. \"Waxaa jira daraasado qaar, in kastoo ay yar yihiin, oo soo gabagabeeyay in haddii haweenku isticmaalaan noocyo gaar ah oo kiniiniyada ka hortagga uurka ah inta lagu jiro marxalad gaar ah oo noloshooda ah iyo muddo dheer — taasoo ah, in ka badan 10 ama 15 sano — kiniiniyadani ay sababi karaan koror yar oo aad u yar oo ku yimaada bararka, gaar ahaan aagga naaska.\"\nLaakiin waxa uu intaa ku daray in daraasado kale ay awoodi waayeen inay caddeeyaan arrintan.\nSi loo fahmo heerka halista, cilmi-baarayaal British ah ayaa sannadkii 2023-kii awoodday inay sawirka u soo dhaweeyaan xaqiiqada. Waxay ogaadeen in isticmaalka kiniinniyadan muddo shan sano ah uu kordhiyo halista haweeneydu ku qaadi karto kansarka naaska muddo shanta iyo tobanka sano ee soo socota 20 ilaa 30 boqolkiiba, taas oo ku xiran da'deeda xiligaas.\nSidaas darteed, tirada kiisaska dheeraadka ah ee kansarka naaska ee ku dhaca 100,000 haweeney oo isticmaasha kiniiniyada ka hortagga uurka waa: siddeed kiis haddii ay kiniinka qaateen intii ay jireen da'da da'yar ilaa labaataneeyada , iyo 265 kiis haddii ay kiniinka qaateen intii ay jireen da'dooda soddomeeyada bartankeeda ilaa inta dambe.\nSaud iyo Ghaziri labaduba waxay qaataan hab la mid ah si ay ula macaamilaan haweenka da'da yar iyo haweenka leh xubnaha qoyska ee qaba kansarka naasaha.\n\"Saud wuxuu leeyahay in dhakhaatiirtu laga yaabo inay waqti qaataan ka hor inta aysan qorin kiniiniyadan haweenka laga yaabo inay u nuglaadaan kansarka naaska sababtoo ah taariikh qoys oo kansarka naaska ah, isla markaana ay leeyihiin kromosoomyo ama hiddo-sideyaal keeni kara cudurkaas.\"\nGhaziri waxa ay tilmaantay in kiiskan aanay doorbidayn in ay u qorto kaniiniyadan muddo ka badan toban sano.\nSaud wuxuu tilmaamayaa in waxa muhiimka ah ay tahay in dhakhtarku sameeyo daraasad faahfaahsan oo dhamaystiran oo ku saabsan xaaladda caafimaad ee bukaanka si loo go'aamiyo in kiniiniyada ka hortagga uurka ay ku habboon yihiin xaaladdeeda iyo taariikhdeeda caafimaad, oo ay ku jiraan cudurrada hidde-sideyaasha ah ee qoyska.\nLabada dhakhtar waxay sidoo kale tilmaameen in, dhinaca kale, kiniiniyada ka hortagga uurka ay ka hortagi karaan kansarka ugxanta, iyo in ilaalintan ay sii socoto sanooyin badan xitaa haweenku joojiyaan isticmaalka kiniinnadda.\nXigashada Sawirka, Getty Images\nSida hore loo soo sheegay, kiniinnadan ma aha oo kaliya in looga hortago uurka. Waxay leeyihiin faa'iidooyin kale, kuwa ugu muhiimsan ayaa ah in ay yareeyaan calaamadaha cudurka polycystic ovary syndrome (PCOS), oo ah cudurka hormoonka ugu badan ee haweenka ku dhaca.\nGhaziri waxay tilmaamaysaa in kiniiniyada ka hortagga uurka ay yihiin daawada ugu badan ee loo qoro haweenka qaba cudurka polycystic ovary syndrome (PCOS) guud ahaan dunida, sababtoo ah waxay wax ka qabtaan calaamado dhowr ah isku mar. Waxay hagaajiyaan wareegga caadada waxayna hoos u dhigaan heerka hormoonka ragga, kaasoo keena maqaarka saliidda leh, finan, iyo timaha xad-dhaafka ah.\nSidaas kale waxay tilmaaamtay in la oggolaado in faa'iidooyinka 'bilicda' ee kiniiniyada ka hortagga uurka, ugu yaraan, aanay ahayn kuwo joogto ah. Finanka, timaha ama xaada xad-dhaafka ah, iyo maqaarka saliidda leh ayaa dib u soo muuqan doona marka la joojiyo isticmaalka, markaasna bukaanku waa inuu raadiyaa xalal kale.\"\nXigashada Sawirka, Getty Images\nSaud wuxuu sheegay in hadalka ku saabsan xiriir ka dhexeeya kiniiniyada ka hortagga uurka iyo ilmo-la'aanta uu yahay mid aan sax ahayn. Wuxuu intaa ku daray, 'Tani waa mid ka mid ah fahamka khaldan ee ugu badan ee laga qabo kiniiniyada ka hortagga uurka.'\"\nDhinaca kale, wuxuu leeyahay, 'Kiniinku xitaa wuxuu yeellan karaa saameyn wanaagsan marka la doonayo uur dambe, maadaama uu dhab ahaantii ilaaliyo ugxanta isagoo joojinaya ugxan-soo-deynta, taasoo ka hortagta cudurro sida endometriosis iyo finan ugxanta ku samaysma, oo ah labo xaaladood oo caafimaad ku adkeeya dhalmada.'\"\nWuxuu sharaxayaa fahamka khaldan ee dadka qaar isagoo leh, 'Waxa badanaa dhaca waa in dadka qaar aysan ogeyn dhibaatooyinka ay horey u qabeen, sida cudurka polycystic ovary syndrome, oo sababi kara ugxan-soo-deyn aan joogto ahayn taasoo dib u dhigta uur qaadashada, ama endometriosis. Marka ay joojiyaan isticmaalka kiniiniyada ka hortagga uurka, waxay aaminsan yihiin in daawadaas ay keentay in aysan uur qaadin, halkii ay eegi lahaayeen dhibaatooyinkii caafimaad ee horey u jiray.'\"\nSaud wuxuu sheegay in mararka qaar, isticmaalka kiniiniyada ka hortagga uurka uu saameyn wanaagsan ku yeelan karo ugxan-soo-deynta haweenka qaba cudurka polycystic ovary syndrome, kuwaas oo aan ugxan-soo-deynin bil kasta.\nXigashada Sawirka, Getty Images\nIsagoo telefoonka kula hadlay BBC Carabi, Saud wuxuu  xaqiijiyay in \"waxba haweeneyda ka joojin karin inay ukumo lumiso, xitaa inta ay uurka leedahay ama aysan ukumo soo deynayn\".\" Waxa uu intaas ku daray in arrintan ay sidoo kale khusayso xilliyada la isticmaalayo kiniinada ka hortagga uurka.\nDhankeeda, Ghaziri waxay sidoo kale xaqiijisay in isticmaalka kaniiniyadan aysan dib u dhigin menopause.\nEraygii ugu dambeeyay, Saud wuxuu sheegay inuu aaminsan yahay in kiniinada ka hortagga uurka ay yihiin kuwo ammaan ah isla markaana muddo dheer la isticmaalayay. Waxa uu intaas ku daray, \"Dawo kasta, xitaa aspirin oo ah mid sahlan, waxay leedahay waxyeellooyin, sidaas darteed qof kasta oo dawada qaadanaya waa inuu miisaamaa faa'iidooyinka iyo khasaaraha ay isaga u leedahay si shakhsi ah.\nWaxa uu tilmaamay, dhinaca dhakhtarka, \"dhakhtar kastaa waa inuu si fiican u daraaseeyaa bukaankiisa oo aanu u qorin wax daawo ah iyada oo aan si dhab ah loo baarin oo aan si dhow u darsin xaaladdooda, taariikhda caafimaad, iyo sidoo kale taariikhda caafimaadka qoyskiisa.\"\nDhankeeda, Ghaziri waxay ku nuuxnuuxsatay muhiimada ay leedahay in la baro dhakhaatiirta iyo bukaanka labadaba \"saamaynta xun iyo waxyeelada kaniiniyada ka hortagga uurka, iyo sidoo kale in lagu wargeliyo bukaanada habab kale oo loogu talagalay xakameynta hormoonnada ama ka hortagga uurka haddii kiniinka ka hortagga uurka aysan ku habboonayn iyada sabab kasta ha ahaatee.\"\nWaxay ku soo gabagabaysay, \"Fikirka bukaan-socodka iyo fikradda ku saabsan daaweynta aan u qornay waa mid aad muhiim u ah. Waa inaan mar walba la tashano bukaanka oo aan waydiinno saameynta daawadu ku leedahay iyada.\"",
  "date": "2025-10-20",
  "scraped_at": "2025-11-10T15:32:17.877551+00:00",
  "category": "news",
  "text_hash": "d8ac19650292671c8042c5c087c51e9cb765a39bdc9199c1d7fafab0ee012786",
  "minhash_signature": "4758028,764637,4018805,2561783,2782360,881764,1172131,656717,4325303,382277,4836858,650113,6081021,3915973,274268,2800605,1577521,1886588,1270368,1951796,3221192,1866709,2280901,844079,3550197,11869,2468958,2297273,1845522,8123693,1610770,3381658,694055,5818186,751000,9247050,3418095,1265214,1030994,374339,1258620,5673898,4699490,701825,1706596,1267982,4338758,1820339,2049706,3015296,856054,127265,1796729,2298178,7824055,901772,1992927,4494547,2429944,308536,2354665,1954528,3288550,1937548,5652372,1250757,12509511,1004517,92752,826234,3605628,355722,1643681,3945525,905146,2117901,711038,4488629,871077,2324082,1148350,995102,1344009,1297841,33260,283019,3460613,1597567,3100941,1326435,2361383,280967,702473,673957,886653,4249238,4645335,1405379,1227304,18958722,5964451,2173796,1427717,749603,146488,281612,3518065,194016,463435,5212787,278063,1849530,855227,7759342,848057,2267824,199306,3865568,1668685,5610159,509388,2026265,1826597,1211187,4386773,722802,6613369,1349493"
}