{
  "url": "https://www.bbc.com/somali/articles/cjed8q7d507o",
  "title": "Maxaa lagu xalliyay xiisadii ka dhalatay xafladda xeerka Ciise ee Seylac",
  "text": "Xigashada Sawirka, Facebook\nXukuumada iskeed ugu dhawaaqday madaxbanaanideeda ee Somaliland iyo salaadiinta gobolka Awdal ayaa xal ka gaaray xiisad maalmihii ugu danbeysay ka taagneyd magaalada Seylac taas oo la sheegay in ay salka ku haysay xaflad la sheegay in halkaas lagu qabanayo taas oo ku saabsan xeerka Ciise oo dhawaan Hay'adda Jamciyadda Qaramada midoobay u qaabilsan dhaqanka ee UNESCO ay u aqoonsatay xeer dhaqameed Qadiimi ah.\nShir muddo laba maalmood uga socday magaalada Boorama Xukuumadda Somaliland oo uu hoggaaminayey Wasiirka Arimaha gudaha iyo Amniga Cabdalla Maxamed Carab iyo Salaadiinta gobolka Awdal ayaa lagaga hadlay sidii loo dejin lahaa oo xal looga gaari lahaa xiisadda taas oo ay ka dhasheen mudaahaardyo iyo dhalinyaro la xirxiray.\nSuldaan Cabdiraxmaan Jaamac Dhawal oo ka mid ah salaadiinta dhaqanka ee gobolka Awdal ayaa BBCda uga warramay shirka ay salaadiintu la yeesheen xubnaha wasiirada ah.\nSuldaanka ayaa sheegay in khilaafaadkii maalmahan ka jiray Galbeedka Somaliland oo ay dadku siyaabo kala duwan uga hadlayeen in guddiga dhaqanka ee Galbeedka Somaliland ay go'aansadeen in arintaasi la xakameeyo wadahadlna lagala yeesho Xukuumadda Somaliland oo miiska wadahalka la iskugu yimaado.\nXigashada Sawirka, IBRAHIM AXMED\nSuldaan Dhawal  oo ka hadlayey arimaha laga wadahadlay ayaa sheegay in odayaashu ay soo gudbiyeen qoddobo ay u arkeen in ay yihiin xal iyo tallooyin arinta lagu xallin karo taas oo wafdigii uu hoggaaminayey Wasiirka Arimaha Gudaha, Cabdalla Maxamed Carab markii ay isla arkeen qoddobada ay kusoo gabagabowday is afgarad.\nXukuumadda ayaa qaadatay wixii ay masuuliyad u lahayd sida  sugidda ammaanka,  halka salaadiintuna ay dadkii kacsanaa u sheegeen in howshaasi laga wada hadlay oo la xalliyay.\nWaxa jiray dhalinyaro tagtay Seylac oo ku lug lahaa xiisadan ka dhalatay xafladda xeerkan Ciise ee muranka dhalisay kuwaas oo dhawaan halkaas laga soo xiray, balse Suldaanka ayaa sheegay in dhalinyaradaasi la soo daayey oo hadda ay joogaan guryahooda.\nMar la weeydiiyay suldaanka in ay xukuumada kala hadleen arrinta salka u ahayd xiisaddan taas oo ahayd in xaflad ku saabsan xeerka Ciise lagu qabanayo magaalada Seylac, waxa uu Suldaanku kaga jawaabay in laga wadahadlay oo uu ahaa qoddobka ugu horreeya wadahadalka \"wixii nabadgelyo xumo keenaya dowladda ayaa qaadatay oo u xilsaaran, anaganna wixii naga quseeyay ayaan ka qaadanay\" ayuu yiri Suldaan Dhawal oo  dadka ugu baaqay in qof walba uu dantiisii iyo shaqadiisa ku noqdo, arinkaasina uu soo gabagaboobay.\nEnd of Ugu akhris badan\nSuldaanku ma caddeyn in la qabanayo xafladda xeerka Ciise iyo in kale balse waxa uu ku gaabsaday in wax alle wixii nabadgelyo darro keenaya ay masuuliyadeeda qaadatay xukuumaddu.\nHay'adda Qaramada Midoobay u qaabilsan dhaqanka ee UNESCO ayaa si rasmi ah u aqoonsatay Xeer Ciise, oo ah xeer qarniyo jiray oo ay ku dhaqmaan beesha Ciise ee degta dalalka Jabuuti, Itoobiya iyo Soomaaliya, waxayna ku dartay liiskeeda waxyaabaha dhaqanka aadmiga la xiriira.\nAqoonsigan taariikhiga ah ayaa lagu saleeyay sida xeerkan uu u mideeyo bulshooyinka, uuna u dhowro dhaqanka oo uu Geeska Afrika ugu dhiirrigeliyo caddaaladda.\nIn xeerkan ay aqoonsato UNESCO ayaa waxaa si wadajir ah u gudbiyay dad ka soo kala jeeda Itoobiya, Jabuuti iyo Soomaaliya, waxana lagu ansixiyay fadhigii 19aad ee guddi-goboleedka hay'adda, kaasoo lagu qabtay magaalada Asunción, ee dalka Paraguay.\nUNESCO ayaa Xeer Ciise ku dooratay sida uu u xoojiyo qawaaniinta caalamiga ah sida xuquuqda haweenka iyo carruurta, dhowridda deegaanka iyo xallinta khilaafaadka.\nUNESCO ayaa ammaantay hannaankan oo ay u aragtay inuu tusaale dhif ah u yahay dhaqanka sharciga ah ee nool kaasoo dhiirrigelinaya dowlad-wanaagga iyo iskaashiga isagoo sidoo kale wax ka qabanaya caqabadaha maanta sida xallinta khilaafaadka iyo dhowridda deegaanka.\nXigashada Sawirka, LOOH PRESS\nQabiilka Ciisaha oo aad u dega Jabuuti, Qaybo ka tirsan Somaliland iyo Itoobiya, ayaa waxa uu leeyahay xeer soo jiray sida la sheegay ku dhawaad 500 oo sano. Xeerka waxaa sameeyay 100 oday oo la soo xulay, waxaana lagu sameeyey magaalada Mile tuulo hoostagto oo la yiraahdo Waaruf, deegaankaasi oo u dhaxeeya magaalada Diridhaba ee Itoobiya iyo Jabuuti.\nMarka laga soo tago xeerarka ay qabaa'ilka Soomaaliyeed wadaagaan sida hoggaanka ka dhaxeeya, xeerka qof kasta qabanaya iyo in dagaalka la wada galo haddana waxay leeyihiin kuwo iyaga u gaar ah.\nWaxyaabaha Ciisaha u gaarka ah waxaa ka mid ah sida uu dhigayo xeerkooda wax la yiraahdo 'Ganda' ayaa jira, Ganduhu wuxuu ka kooban yahay 44 oday oo talada Ciisaha ay ka go'do, waana baarlamaanka Ciisaha. Arrimo weyn oo adag haddii ay dhacaanna waxaa isugu imaanaya boqolka oday iyo boqorka ayuu yiri Oday Aadan Allaale oo ka mid ah odayaasha beesha.\nSidoo kale Xeerka Ciise waxyaabaha uu kaga duwanyahay xeerarka kale ee beelaha Soomaalida waxa ka mid ah habka loo doorto ugaaska kaas oo sida beelaha kale aan dhaxal aheyn.",
  "date": "2025-10-07",
  "scraped_at": "2025-11-10T15:35:17.990712+00:00",
  "category": "news",
  "text_hash": "3b3099912fc27a74503d6583a75d5a5bcbe29ea1cbfcb3041867eeaef538d74a",
  "minhash_signature": "1538280,6411601,1147550,425057,3980967,471139,2656466,3828302,10759872,7795581,9159995,5808767,2047348,3940316,7039707,977974,17878031,1829084,41251,6320346,15335190,4765514,19720138,248960,3521999,10381039,1484023,5643234,20824734,9150976,2072752,4983966,3876338,2633331,3726478,4463262,2121027,14035527,3005397,7196841,530289,7493125,1635835,12451138,10402410,3311996,128218,7169710,6206723,4369236,7366006,3334150,4113758,2255547,14505653,2679593,3328583,4192325,4336052,13708068,1736984,1490692,425968,6826803,10300837,4215030,4498478,2005022,4702265,14082918,3574976,5064863,1969884,562332,20169721,10686954,2994126,25299699,4782,1112530,265698,8699800,8594108,8024920,370403,16263332,3546500,4114999,5627754,5472519,3199763,5649798,38358661,5387685,4044679,4287303,8410043,934682,1492760,10590247,4778918,5567773,1594872,7428445,3623139,14490493,1294173,4353694,4307885,3734443,49588,10754981,10888051,615708,4507176,13904912,5157178,12322483,1241552,1256626,147763,5747641,6066537,5975046,817225,6922810,18533292,3108099"
}