{
  "url": "https://www.bbc.com/somali/articles/c1j8nrwk672o",
  "title": "Waa kuma wasiirka kaliya ee aan iska dhex waayin xukuumaddaha Soomaaliya tan iyo 1990-kii?",
  "text": "Xigashada Sawirka, Golaha Shacabka\nRa'isul Wasaare Xamse Cabdi Barre ayaa u magacaabay siyaasiga ruug caddaaga ah ee Prof.  Saalim Caliyow Ibrow Wasiirka Shaqada iyo Arrimaha Bulshada ee Xukuumadda Federaalka Soomaaliya.\nWar ka soo baxay xafiiska Ra'isul Wasaaraha ayaa lagu sheegay in markii uu arkay howsha baaxadda leh iyo shaqada hortaalla Wasaaradda Shaqada iyo Arrimaha Bulshada ee Xukuumadda uu xlkan u magacaabay Prof.  Saalim Caliyow Ibrow.\nProf.  Saalim waa aqoonyahan shaahadada sare ee culuunta cudurrada faafa iyo daaweynta xoolaha ka qaatay jaamacadda La Trobe University, Melbourne, Australia. Prof.  Saalim waxa uu kuxigeenka hormuudka kuliyadda iyo macalinba ka noqday kuliyaddii xannaaanada xoolaha ee Jaamacadda Ummadda Soomaaliyeed muddadii u dhaxeysay 1976-1990-kii. Waxa kale oo uu ka soo shaqeeyay hay'adda dhaqanka ee Qaramada Midoobay ee UNESCO, waxana uu qoray qaamuuska isku fasariya lahjadda Jiidada iyo luuqada ingiriisida.\nSaalim waxa kale uu daabacay illaa konton cilmi baaris oo ka hadalaya cudurrada ku dhaca xoolaha Soomaaliya.\nXigashada Sawirka, OPM\nProf.  Saalim Caliyow Ibrow waa wasiirkii ugu muddada dheeraa wasiiraddii soo maray xukuumadda Soomaaliya, waxa uuna wasiir ka noqday ku dhawaad toban xukuumadood oo soo maray Soomaaliya dhawr iyo sodonkii sano ee la soo dhaafay.\nXillalka Wasiir ee uu soo qabtay Prof.  Saalim Caliyow Ibrow tan iyo xukuummaddii Cumar Carte Qaalib ee 1991-kii:\nWasiirka Cadaaladda iyo Arimaha Diinta\nWasiirka Tamarta iyo Biyaha\nEnd of Ugu akhris badan\nWasiirka Xannaanada Xoolaha, Dhirta iyo Daaqa\nWasiirka Maaliyadda\nWasiirka Tacliinta Sare, iyo hadda oo loo magacaabay Wasiirka Shaqada iyo Arrimaha Bulshada.\nMuddada uu siyaasadda ku jiray Prof.  Saalim waxa kale oo uu noqday Ra'isul Wasaare Kuxigeen muddadii u dhaxeysay 2005-2008-dii.\nXilalka aan dhicin ee Prof.  Saalim hayo waxa kamid ah xildhibaan barlamaanka Soomaaliya, isagoo marna aan kurisgaas waayin tan dawladdii Carta lagu dhisay 2000.\nProf.  Saalim Caliyow Ibrow waa siyaasi gabalkiisu aanu dhicin, hadday tahay barlamaanka ama xukuumadda Soomaaliya, waxayna dad badan is waydiiyaan sababta ka dambeysa arintaas.\nWasiirka oo BBC-da la hadlay ayaa su'aashaas uga jawaabay \"siyaasi ahaan waxa ii sahlay siyaasad ku shaqaynaysa mabda'ayga ah xasilooni siyaasadeed iyo in hawl kasta sidii saxda ahayd loo qabto. Waxa kale oo aan fuliyay qorshaha iyo siyaasadda ay wasaaraddu u sameysan tahay, wax muuqdana aan ka soo saaro\".\nWasiir Saalim waxa kale oo uu sheegay in waqtiyadii uu maamulayay wasaaraddaha kala duwan uu si dhaw ula shaqeeyay shaqaalaha iyo madaxda kale ee wasaaraddaha, isagoo ka fogaaday khilaaf dhexmara isaga iyo shaqaallaha kale.\nKu dhawaad toban Ra'isul Wasaare ayaa wasiir u magacaabay Prof.  Saalim, su'aashuse waxay tahay maxaa lagu xushay.\n\"Kow aqoonta ayay igu xulanayeen, waxan ahaa nin xirfadle ah, badi waxa la igu magacaabayay wasaaradda xannaanada xoolaha, khibradna waan lahaa oo wasaaraddo badan ayaan soo qabtay, macalina waan soo ahaa, maamul yaqaana waan ahaa\" ayuu yiri Prof.  Saalim.\nSanadaha badan ee uu siyaasadda ku jiray Prof.  Saalim laguma arag fagaarayaasha mucaaradka, xitaa haddii aan loo magacaabin xil wasiir. Inkastoo ay yarayd inta uusan ka soo muuqan golaha wasiirada haddana lama arag isagoo meel fagaare ah ka mucaaradaya dawladda.\nSu'aal ay BBC-du waydiisay oo ahayd haddii mar uun noqday mucaarad, waxa uu ku jawaabay \"anigu wixii aan qabo waxan ka sheegi jiray, goobtaan ku sheegan jiray, dadka ayaan qancin jiray, laakiin inaan bannaanka istaago oo dawladda hor istaago ma dhicin, maxaa yeelay waxan markasta u arkayay in taasi waqti naga dhuminayso oo duruufta aanay noo saamaxayn\".\nWasiir Saalim waxa kale oo uu sheegay marka la eego duruufaha dalka uu ku jiray iyo sida loo doonayay in dhakhso looga kabto dhibaatooyinka jira ay keentay in uu ka baaqsado in uu mucaarad dibadda taagan noqdo. Waxa uu aaminsan yahay in xukuumad kasta waqtigeeda la siiyo, gudahana lagu saxo.\nSaalim Caliyoow Ibrow ayaa ku booriyay dhalinyada doonaysa inay siyaasadda galaan amaba hadda ku jira in siyaasaddu u baahan tahay dulqaad, isu tanaasul iyo is aaminaad.",
  "date": "2025-10-28",
  "scraped_at": "2025-11-10T15:51:43.068258+00:00",
  "category": "news",
  "text_hash": "5a0b707fed8182f4b833d0aad394bed3b0357870f7a5e2933d52bc094fdcc30f",
  "minhash_signature": "71510,11072792,2738835,247200,26451489,7094065,2881415,4457685,8707967,3249709,10269560,27664461,3041710,901225,3811352,8979422,89046,1579489,2116208,13687036,576848,256956,2443638,7764903,870419,2051698,5451253,6777357,6787559,6351550,26929433,20971478,11289309,4707306,5179908,62487,3287378,9999209,11083883,6148424,12192059,274181,14777814,3517114,3072059,3291255,434089,5137906,16460431,34170401,24210,1219260,5108090,2487217,4577399,18038870,27826395,7792195,15171685,5545053,8419880,1864461,16603855,18567720,1391306,14233,6206665,3352648,3514746,2270389,7727024,5609033,9258041,5857501,3942169,318632,4571605,25270539,645071,4337097,3329523,9158739,6878888,4611586,3494727,543452,187359,7600485,7853072,4606272,19571397,428199,4573092,10103384,3913243,3205358,12023163,2940178,11666227,7778750,1398716,2099680,3787735,3447736,272190,2173863,3480647,13813940,7800590,27225483,1408051,13918674,98947,1157284,759821,6986399,3410262,2045179,3092150,2585259,3074693,7014678,3359910,8890772,451776,2802940,2662849,11879458"
}