{
  "url": "https://www.bbc.com/somali/articles/ckgyrdzmvzdo",
  "title": "Booliska Galmudug oo BBC-da u sheegay war cusub oo ka soo kordhay dhacdo argagagax leh oo ka dhacday deeganada maamulka",
  "text": "Xigashada Sawirka, Booliska Galmudug\nFal dad badan ay ka argagaxeen ayaa habeen hore ka dhacay deegaan miyi ah oo u dhaxeeya deeganada Qaayib iyo Xiindheere  oo hoostaga degmada Baxdo ee gobolka Galgaduud ee maamulka Galmudug.\nDhacdada ayaa ahayd markii rag hubaysay ay dileen, hooyo iyo saddex carruura oo ay dhashay. saddexda carruurta ah ayaa ahaa gabdho yar yar  sida Booliska Galmudug u sheegay BBC-da.\nSida warbaahinta maxaliga ee Soomaaliya qaarkeed iyo Barasha bulshada lagu sheegay dhacdaddan ayaa lagu xiririyey inay ahayd aano-qabiil,  laakiin Booliska Galmudug waxay BBC-da u sheegeen in wali baaritaan socdo oo dib laga cadayn doono waxaa arrintaasi la xiriirto basle waxay dhacdadaas ku tilmaameen \"Fal ugub ah oo arxan darro ahaa\"\nKa dib dhacadaaas naxdinta lahayd ciidamada ammaanka ee maamulka Galmudug ayaa bilabaay howlgalo lagu raadinayo dadkii falkaas ka dambeeyey oo la sheegay inay baxsadeen sida uu BBC-da u sheegey taliska booliska ee Galmudug.\nXigashada Sawirka, G/Sare Khaliif Cabdulle Maallin\nSida uu BBC-da u sheegay Gashaanle Sare Khaliif Cabdulle Maallin, taliyaha ciidanka Booliska maamulka Galmudug, howlgallo  socday wax ka badan afar iyo labaatan saacadood oo ay iska kaashadeen ciidamada booliska iyo kuwa gaarka ee madaxtooyada Galmudug ayaa suura galiyey in gacanta lagu soo dhigo saddex ruux oo loo haysto dilka qoyska.\n\"Howlgalku wuxuu bilaamay shalay galab sideedii iyo bar duhurnimo wuxuuna soo gagaba gaboobay galabtay tobbankii galabnimo, kaas oo ahaa mid xiriir ah muddaas, waxaa suuragalay in ay la soo qabtay eedeysanayaashii geystay dhibaatadii foosha xumaa dilkii foosha xumaa ee aadka u liitay dadkii geystay oo saddex nin ahaa\" ayuu yiri Taliye Khaliif.\nTaliyaha Ciidanka Booliska Galmudug, wuxuu sheegay in ciidamada ammaanku ay raggan ka soo qabteen meel 150km u jirta deegaanka Qaayib ayna geyn doonnaan Dhuusomareeb si sharciga loo horgeeyo.\n\"Caasimadaa la geyn doonaa garsooraha dacwadaas qaadi kara wuxuu joogaa halkaas\" ayuu yiri.\nEnd of Ugu akhris badan\nXigashada Sawirka, Booliska Galmudug\nIsagoo sharaxay sida dhacdadan ay dadka deegaanada ugu abuurtay argagax xooggan ayuu taliyaha Booliska Galmudug sheegay \"Waxaan aragnay dad shacaba oo dumar ah oo soo qaxaya oo soo cararaya halkii raggu ka soo carari jireen markii dhibaato dhacdo\" ayu intaas raaciyey taliye Khaliif.\nWuxuu intaas raaciyey in qeybaha kala duwan ee bulshadu  ku nool magaalooyinka Cadaado, Baxdo  iyo deeganada hoos yimaado ay si weyn ugu caroodeen falkaas ayna gacan ku siiyeen inay gacanta ku soo dhigaan raggan ay boolisku ku tilmaameen eedaysanayaashii ka dembeeyey dilka qosykaas.\nSida ay noo sheegeen dad deegaanka ah, aabaha qoyska ayaa galay xaalad koomo ah ka dib falkaas naxdinta leh ee ku dhacay qoyskiisa iyadoo sidoo kale ay argagax ku riday dadka deegaanka ay dhacdadu ka dhacday.\nTaliska Booliska Galmudug ayaa xusay inay ka dalbanayaan shacabka in si wadajir ah looga hortago falalka noocaas ee lidiga ku ah dhaqanka suuban iyo diinta islaamkaba.\nFalkaas oo ahaa mid naxdin leh ayaa carro xooggan ka dhaliyey baraha bulshada iyadoo shacabku ka dalbadeen maaamulka in kuwii ka dembeeyey la soo qabto.\nMa aha markii ugu horreysay ee dhacdo sidaas oo kale u argagax leh ay ka dhacdo deegaano badan oo dhulka Soomaalida ah basle tan ugu dembaysay ayaa si weyn u dhalisay carro badan oo bulsho.",
  "date": "2025-10-10",
  "scraped_at": "2025-11-10T15:33:17.936446+00:00",
  "category": "news",
  "text_hash": "48a6a70a56b1807d4e923e2cc5cdcd8a41a38e31305b252760e8a31a73881e98",
  "minhash_signature": "722270,3713524,2220796,9269910,3520087,1428697,7507277,35934824,9447607,7615775,16345796,919195,2047348,7782425,7554944,4200074,22358551,10077045,1508228,5908925,16642354,7591353,7139805,4741802,17234030,12634360,18124391,8848875,1431573,876936,14556750,342949,12540279,4916794,1591,1573349,6030099,2539337,2309612,13667702,6503514,10796169,20860734,2066876,1393177,10342972,12436959,4845974,261902,681764,1464947,3334150,1662310,591727,217381,1593403,7286512,13961793,4393852,6578362,13348965,6146989,2216684,8917431,14855403,8321515,1318318,3150053,5604214,1901040,78301,2430084,10130745,4541529,1108905,1626423,18397125,10819166,12659836,266209,15038922,28130335,7033081,5402967,32489365,4960526,4980529,6779994,1994325,4181282,124139,16574014,2450998,1929192,3797421,2810303,11451738,12538887,868329,54025343,2369077,2680167,570582,6986295,2587878,4485837,7048496,489597,5933485,1165113,7540022,4931375,2216360,6162924,11841048,15918264,8865975,3251814,8559077,1384620,17147170,6860246,2093682,14856502,7204291,8677762,7738407,2313189"
}