{
  "url": "https://www.bbc.com/somali/articles/cx2yl8kxee9o",
  "title": "Madaxweynaha Eriteriya: \"Soomaaliya waa in ay ilaashato xeebaheeda\"",
  "text": "Xigashada Sawirka, Democracy in Africa\nMadaxweynaha Eriteriya, Isaayaas Afwerq oo waraysi siiyay warbaahinta Qaahira ee dalka Masaarida ayaa sheegay ayaa ka hadlay arrimo badan oo ay ka mid yihiin xiisadda badda Cas iyo amniga gobolka Geeska Afrika.\nWaraysi qaatay in ka badan 20 daqiiqo ayaa madaxweynaha keliya ee ay Eriteriya weligeed yeelatay tan iyo markii ay xornimad aka qaadatay Itoobiya waxa lagu weyddiiyay arrimaha Badda Cas ee in muddo ah ay hadal-hayntoodu taagnayd.\nWareysigiisa ayaa Isaayaas wuxuu sheegay in colaadda ka taagan gobolka Geeska Afrika ay sababta ugu weyn ku leedahay faragelin uu sheegay in ay ka imanayso xoogag iyo dawlado kala duwan.\nWuxuu sheegay in dhibaatooyinka dalalkaas aanay ahayn kuwo gudaha ka socda oo keliya, balse ay yihiin kuwo goboleed iyo xitaa qaar caalami ah. Waxa uu tusaale u soo qaatay xaaladda gobolka Geeska Afrika, si gaar ah, xaaladda Soomaaliya, Itoobiya iyo Suudaanta Koonfureed.\n\"Soomaaliya waa dal leh xeeb dhererkeedu gaadhayo 3,300 kiiloomitir, waxaana xeebtaas dheer oo ah goob istaraatiiji ah ay dalka ka dhigtay mid aan xasilloonayn,\" ayuu yidhi. Wuxuu sheegay in dhibaatada Soomaaliya aanay ahayn mid gudaha ah oo keliya ka abuurantay, bal se ay tahay arrin goboleed iyo mid caalami ah.\n\"Kala duwanaanshaha qowmiyadeed ee aan aragnay 30-kii sano ee la soo dhaafay waa kala qaybsanaan iyo xasillooni darro qowmiyadeed. Suudaanta Koonfureed oo ka go'day Suudaan, waxay noqotay dal ay dagaallo sokeeye burburiyeen oo aan deggeneyn,\" ayuu hadalkiisa raaciyay.\nIsayaas waxa uu ka warramay in aanu gobolku u baahanayn quwado shisheeye oo faragelin ku sameeya gobolka, bal se ay muhiim tahay in cid kastaa ay awood u yeelato xilka ka saaran ilaalinta xeebaheeda.\n\"Dalalka gobolka ayaa leh mas'uuliyadda koowaad ee lagu xaqiijinayo amniga iyo badbaadada marin-biyoodkan caalamiga ah. Tani ma aha doorasho u furan dowladda ama wasaaradda difaaca — waa baahi taariikhi ah oo lama huraan ah.\nEnd of Ugu akhris badan\nWaa waajib saaran dhammaan dalalka ku yaal xeebaha Badda Cas in ay ka qeyb qaataan sugidda iyo amniga marin-biyoodkan muhiimka ah.\nMadaxweynaha Eriteriya oo safar shaqo ku joogay magaalada Qaahira ayaa sidoo kale la weyddiiyay in dalalka ku yaalla gobolku ay ku filan yihiin ilaalinta xeebaha iyo marin-biyoodka iyo suurtagalnimada in la sameeyo iskaashi-goboleed arrintan lagu suurtagaelin karo.\n\"Haddii uu suuragal yahay iskaashigaasi waa in la sameeyaa. Is-dhexgalka gobolku waxa uu xoojinayaa xidhiidhka gobolka iyo wada-shaqeynta dalalka ka dhaxaysa. Haddii iskaashiga iyo midnimada goboleed ay gacan ka geystaan sugidda amniga marin-biyoodkan caalamiga ah, markaas waa mas'uuliyad caalami ah,\" ayaa uu yidhi.\nWaxa la weyddiuyay waxa laga yeelayo joogitaanka ciidmamada shisheeye ee  gobolka ku sugan.\n\"Isku day kasta oo dal shisheeye uu ku doonayo in uu ku soo farageliyo ama xakameeyo gobolka — ha ahaado woqooyi, galbeed ama meel kale — waa wax aan la aqbali karin, sharci ahaan iyo ciidan ahaanba.Sidaas darteed, waa in dalalka gobolka ay mas'uuliyaddooda qaataan oo ay si daacad ah u wada shaqeeyaan, oo ay iyaga qudhoodu sugaan amniga marin-biyoodkan caalamiga ah.\nWariyaha ayaa mar kale weyddiiyay in waddamadu gobolku ay ku filan yihiin qabashada hawshaasi iyo in kale. Waxaana Madaxweynaha Eriteriya uu ku nuuxnuuxsaday sida dal wal oo gobolkan Geeska Afrika ku yaalllaa uu ugu diyaarsan yahay in uu iskiis u maamusho xeebihiisa.\n\"Haa. Way awoodaan. Way awoodaan, xitaa intaas in ka badan. Soomaaliya oo leh xeeb dhererkeedu yahay 3,300 km, way awooddaa inay ilaaliso biyahaheeda. Eritrea way awooddaa in ay difaacdo dhul badeedkeeda. Yemen way awooddaa. Jabuuti, Suudaan iyo Sucuudi Carabiya dhammaantood way awoodaan in ay ilaaliyaan xeebahooda. Uma baahna cid shisheeye ah oo u timaadda in ay iyaga u sugaan amniga. Joogitaanka ciidamada shisheeye waa sababta keenta dhibaatada iyo xiisadda gobolka,\" ayaa uu yidhi\nDhinaca kale, madaxweynaha Eriterya waxa uu deedifeeyay waxa uu ugu yeedhay ciidammada qalaad oo uu sheegay in beddelkooda la heli karo isku filnaan ka timaadda wada shaqayn dhex marta waddamada gobolka.\n\"Waxaa jira beddello badan.Waxaa jira fursado iskaashi oo dhex maraya dalalka gobolka. Gobolka waxa ku yaalla dalal awood sare leh oo bixiya adeegyo gaar ah oo faa'iido u leh dadka gobolka iyo bulshada caalamka. Waxaan aaminsanahay in Eritriya ay door weyn ka ciyaari doonto horumarinta iskaashigan. Eritrea ma laha saldhigyo ciidan oo shisheeye. Cidda oggolaata saldhigyo ciidan waa inay isweydiisaa waxa ay ku faa'iidayaan.\nMudane Madaxweyne, qaar ayaa leh Eritrea waxay ka soo horjeeddaa Itoobiya, Suudaan, ama ay saameeyeen xaaladaha ka jira Soomaaliya iyo Yemen. Sidee baad u aragtaa mowqifka dalkaga ee deegaanka?\n\"Eriteriya cadow kuma aha Itoobiya, Suudaan, Soomaaliya ama Yemen.\nRuntii, waxa ka dhacaya gobolka way na saameeyaan, laakiin kama lihin dano gaar ah. Mowqifka Eritriya wuxuu ku dhisan yahay madaxbannaani, iskaashi, iyo mas'uuliyad wada jir ah. Dowlad kasta, sida Soomaaliya, Suudaan, Yemen, Eritrea — waxay leedahay mas'uuliyad u gaar ah. Iskaashiga iyo midnimadu waa awoodda na mideynaysa oo na xoojineysa. Cabirka dalka ma aha muhiim — ha yaraado ama ha weynaado — waxa muhiimka ah waa iskaashi dhab ah oo abuuraya xasillooni iyo amni, marka hore gobolka, kadibna marin-biyoodkan caalamiga ah.\nIsagoo ka hadlayay xaaladda Suudaan, Madaxweyne Isaias wuxuu yidhi, \"Suudaan waxay bartilmaameed u tahay xoogag goboleed iyo kuwo caalami ah.\"\nWuxuu sheegay in qalalaasaha Suudaan oo sii socdaa uu keeni karo gaajo ku baahda gobolka oo dhan.\nIsagoo ka jawaabayay doorka Afrika iyo Ururka Midowga Afrika, Madaxweyne Isaayaas wuxuu sheegay in Afrika ay tahay meel faragelin badan ay ka jirto laguna dhaco khayraadkeeda dabiiciga ah oo si naxariis-darro ah loo sii gurayo, dadkeeduna ay ku nool yihiin \"addoonsi casri ah.\"\n\" Aamusnaanta Midowga Afrika macnaheedu ma aha in laga bogsaday arrintan. Xaqiiqadu waxay tahay in Midowga Afrika aanu awoodin in uu wajaho ama xalliyo dhibaatooyinka waaweyn ee qaaradda haysta, sababtoo ah daciifnimo gudaha ah iyo faragelin dibadda ah awgeed,\" ayuu yidhi. \"Dawladaha xubnaha ka ah Midowga Afrikana iyagaa ugu horreeya oo mas'uul ka ah fashilkaas,\" ayuu hadalkiisa raaciyay.",
  "date": "2025-11-05",
  "scraped_at": "2025-11-10T15:55:42.085538+00:00",
  "category": "news",
  "text_hash": "8ff5ba827a68394de1ed15b3876cc8a276deb605b4a088e2251140c3b1ab96a7",
  "minhash_signature": "2711557,284063,5276958,856031,1526946,333952,3762173,3340412,2456516,371813,9097601,4957220,8787709,407322,21059,801843,215629,5577966,3624011,4055073,3659395,12087129,1057674,2906778,4454052,5091417,4466679,6154577,16908107,3256038,6342309,7478751,4148431,13416582,217385,1553764,2064035,143669,4946622,3958712,986979,1479400,3988251,2852864,15521475,11431836,69169,6528787,9645282,271791,3750515,1711155,3731728,1349658,879121,3080292,4385708,1835456,235835,13001598,1672297,103513,1832602,1543132,19415120,924892,7980242,427315,1047675,15204,1211319,1608558,2869261,1564049,17638957,2317013,1245511,3994582,2337435,32794,21989530,3881475,8734,1520859,3512369,10279653,5538881,3713706,5871591,8739956,5532187,9100168,8483891,3271306,5617687,3362182,12817241,2888389,998407,11728810,2059556,3474273,1853176,11538316,7060906,4240,331419,2510032,453063,9113087,8833844,1654801,4289486,5954760,1432918,5509433,6732496,16125261,3054746,13758639,8793683,1407697,6655325,6616208,12481395,12161343,689745,1093997"
}