{"url": "https://www.bbc.com/somali/articles/ce8gj10lw51o", "title": "Mas'uuliyiin Tigray ah oo dawladda Itoobiya ku eedeeyay weerar diyaarado loo adeegsady", "text": "Xigashada Sawirka, AFP/ Getty Images\nMas'uul sare oo ka tirsan qaybaha amniga ee Tigray ayaa u sheegay BBC-da in dawladda Itoobiya ay duqayn diyaaradeed ku qaaday iyaga.\nMas'uulka ayaa sheegay in weerarku ka dhacay meel u dhow xadka u dhexeeya gobollada Tigrayga iyo Canfarta.\nIlaa hadda ma jiro wax faahfaahin ah oo ka soo baxaysa dhinaca dawladda federaalka Itoobiya oo arrintaas ku saabsan.\nBBC-du ma hayso caddeyn gaar ah oo ay ku xaqiijin karto weerarka. Isku dayadii ay BBC-du ku doonaysay in ay kula xidhiidho afhayeenka dawladda Itoobiya iyo ciidankuna waa ay guuldarreysteen.\nDhacdadan ayaa timid iyadoo ciidammada Tigray lagu eedeeyay in ay u tallaabeen gobolka deriska la ah ee Canafta isla markaana ay weerarro ka fuliyeen halkaas.\nWaxa jira walaacyo xooggan in xiisadaha ka taagan waqooyiga dalka ay markale isu beddelaan iska hor imaad hubeysan.\nToddobaadkan, maamulka gobolka Canfarta ayaa war-saxaafadeed ay soo saareen waxa ay ku eedeeyeen ciidammada Tigray in ay xadka ka gudbeen, weerarro qaadeen, isla markaana ay sababeen khasaare baaxad leh.\nWar-saxaafadeedkaas ayaa sidoo kale lagu sheegay meelaha ay ciidammada Tigray gacanta ku dhigeen, iyadoo lagu xusay in dad rayid ah ay qaxeen guryahoodii.\nEnd of Ugu akhris badan\nDhanka kale, maamulka Tigray ayaa beeniyay eedeymahaas.\nSida uu sheegay sarkaal dhinaca ammaanka ah oo ka tirsan Tigray oo la hadlay BBC-da isla markaana codsaday in magaciisa la qariyo ayaa sheegay in weerarka diyaaradaha aan duuliyaha lahayn ay sababeen dhaawacyo yaryar oo dadka iyo hantidaba soo gaadhay.\nGoobta weerarka lagu qaaday ayaa la sheegay in ay ahayd meel la yidhaahdo Milkaa, oo ku dhow xadka gobolkaasi la wadaago deegaanka Canfarta, wuxuuna sarkaalkaasi sheegay in weerarka lagu beegsaday sal-dhig ciidan.\nSarkaalkaasi waxa uu ku eedeeyay dawladda federaalka in ay jebisay Heshiiskii Pretoria, kaddib markii ay duqayntan fulisay.\nBBC-du waxay sheegtay in goobta la duqeeyay ay u dhowdahay aag ay dawladda deegaanka Canfartu ku eedeysay in ciidammo Tugree ahui ay weerar ka gaysteen.\nXogtan ayaa ah tii ugu horraysay ee laga soo tabiyo iska-hor-imaad u dhexeeya ciidamada dowladda federaalka iyo kuwa Tigray tan iyo markii dagaalkii hore uu sababay dhimashada kumannaan qof.\nDagaalkii ka dhacay waqooyiga Itoobiya ee qaatay labada sano ayaa markii hore ka bilowday gobolka Tigray, kaddibna wuxuu ku faafay gobollada Canfarta iyo Amxaarada, balse ugu dambayntii waxaa lagu soo afjaray Heshiiskii Nabadda ee Pretoria.\nSi kastaba ha ahaatee, dowladda Itoobiya iyo TPLF ayaa midba midka kale ku eedeeyay inuu jebiyay heshiiskaas.\nToddobaad ka hor, warbixin ayaa sheegtay in kooxo ciidan oo loo yaqaan \"Haaraa Mareet\" ay dhaq-dhaqaaqyo ka sameeyeen magaalooyinka Magaale iyo Tonsaar, iyagoo isku dayay inay qalalaase ka abuuraan deegaannada la yidhaahdo Dederban, Tsahaafti iyo Gerbaagew.\nSi kastaba ha ahaatee, war-saxaafadeedka ayaa sheegay in arrintan lagu xallinayo wadahadal, islamarkaana aan loo baahnayn in si degdeg ah loo shaaciyo faahfaahinta.\nDhanka kale, maamulka gobolka Canfarta ayaa war-saxaafadeed ay xilligaasi soo saareen waxa ay ku sheegeen in eedeymaha sheegaya in warka sheegaya in ciidamada Tigray ay gudaha u soo galeen gobolka Canfarts oo ay weerarro fuliyeen ay yihiin \"kuwa aan sal lahayn.\"\nXigashada Sawirka, Getty Images\nShalay ayay ahayd markii mamulka gobolka Canfartu ay ku eedeeyeen kooxo ciidan ah oo ka tirsan TPLF in ay gudaha u soo galeen xadka gobolka Canfarta islamarkaana ay adeegsanayeen hub culus si ay weerarro u fuliyaan.\nGuddoomiyaha degmada Magaale ee gobolka Canfarta, Cabdu Sheek Beraah, ayaa isagoo la hadlayay BBC-da yidhi:\n\"Saacaddu markay ahayd 12-kii ayay bilaabeen in ay dadka ku soo tuuraan hub culus.Waxay wateen ciidan xoog badan, waxaanay u muuqdeen in ay adeegsanayeen hubka lidka diyaaradaha ee ZU-23 la yidhaahdo,\" ayuu yidhi.\nMar la weydiiyay in weerarka ay fuliyeen dagaalyahanno la sheegay in ay ka tirsan yihiin \"Hara Meret\" ama \"Xooggaga Nabadgalyada Tigray \" oo ka socda gobolka Tigray, Cabdu wuxuu sheegay: \"Goobaha la qabsaday iyo meelaha la weeraray midna in aanay ka qabsan dad magacaas wata.\"\nBBC-da ayaa eedaymahaas u bandhigtay Brigadier General Teklay Kidane oo ah madaxa waaxda amniga ee gobolka Tigray. Mas'uulka waaxda amniga ayaa sheegay in \"aanay jirin meel aanu ka talinay oo ka mid ah gudaha Canfarta,\" isaga oo beeniyay eedeynta loo jeediyay ciidamada Tigray.\nKa hor arrintan, ururka TPLF ayaa ku eedeeyay dawladda federaalka Itoobiya in ay halkii ay wadahadal siyaasadeed ku xallin lahayd khilaafaadka, ay ka dooratay in ay tababar iyo taageero siiso kooxo hubeysan oo ku jira gudaha dhinacyada Canfarta iyo galbeedka Tigreega.\nDhanka kale, Brigadier General Gebregziabher Bayyana (loo yaqaan Waddi Anxiru), oo ka mid ah saraakiishii hore ee ka baxay ciidammada Tigray oo hadda dhisanaya ciidan cusub, ayaa u sheegay BBC-da in ay \"lamadegaanka  u galeen si ay u abuuraan wax cusub.\"\nIsagoo la hadlayay BBC-da af-Tigrinya ayaa janaraalku wuxuu sheegay in \"wax cusub\" uu ula jeedo in ay dhisayaan ciidan ka madax-bannaan TPLF, isagoo sheegay in ay doonayaan in ay ka madax-bannaanaadaan xisbiga.\nWuxuu intaas ku daray in ujeeddadoodu aanay ahayn in ay dawlad ama xisbi ciidan cusub ku dhisaan, balse ay rabaan in ay TPLF meesha ka saaraan.\nSidoo kale, wuxuu sheegay in ay qorsheynayaan in afar qaybood oo ciidan ah laga dhiso xuduudaha u dhexeeya gobollada Canfarta iyo Tigreega.", "date": "2025-11-07", "scraped_at": "2025-11-10T15:31:18.717390+00:00", "category": "news", "text_hash": "d16fc3eb2cb3287e94b89a9ab29c1a2f82d3c56edce35bfe98c14a7ef3529dc9", "minhash_signature": "7916653,16169166,2147681,1234074,2416816,6139539,4156946,27800857,11843480,872333,5037920,2173979,8454140,31545951,3027503,353986,4722970,10774366,4048576,3597395,1169518,1965726,1596566,4436629,5791462,6196,6314940,893629,5376528,3513261,7554887,13631314,913940,3304042,9036339,4344442,11676107,13477862,117457,264258,17615283,11071757,1053343,3034617,1034316,3130194,783493,11041162,382932,17114882,18400498,8427343,332965,15142263,5044536,10821796,12160362,315032,6352513,5336997,1472932,5178966,16445863,1107733,1834677,4176260,4808945,2206938,2451555,411528,168924,13261734,6935443,652084,208270,2255182,2994126,6251759,639236,597594,4608690,4487761,8801867,2130302,3568291,7539281,182920,1505209,4612664,253842,1548694,10280294,3945862,1512485,178659,955924,11237494,1446388,198102,4549548,4575889,5410143,1196637,8764953,5401078,28765484,4762971,1126069,408526,358045,1894198,7628077,1626700,3309333,1527351,180865,2089075,890595,8864154,1872047,7271033,3428679,396112,13373857,2413208,802298,20924385,2408795"}
{"url": "https://www.bbc.com/somali/articles/c3w9ev78z2vo", "title": "Daraasad: Kiniinnada ka hortaga uurka ma waxay kordhiyaan Kansarka", "text": "Xigashada Sawirka, Getty Images\nHay'adda Caafimaadka Adduunka ee WHO ayaa sheegtay in 1.9 bilyan oo dumar ah oo da'doodu u dhaxayso 15 ilaa 49 sano (da'da taranka) ay jireen guud ahaan dunida sanadkii 2021. Waxaa ka mid ahaa 1.1 bilyan oo haween ah oo u baahnaa habka ka hortagga uurka iyo qorsheynta qoyska, waxaana ka mid ahaa 874 milyan oo doortay inay isticmaalaan hababka casriga ah ee ka hortagga uurka, sida kiniinnada iyo habab kale.\nSi kastaba ha ahaatee, tirada haweenka isticmaala kiniinnada ka hortagga uurka ayaa laga yaabaa inay ka badan tahay inta la diiwaan geliyey, maadaama hababkan hormoonnada ku saleysan sidoo kale loo adeegsado xakameynta calaamadaha xaalado kale oo caafimaad.\nMid ka mid ah calaamadaha ugu waaweyn ee ay kiniinnada ka hortagga uurka caawiyaan in la xakameeyo waa xanuunka PCOS (Polycystic Ovary Syndrome), oo ah xaalad ku dhacda ugxan-sidaha haweenka. Sida ay sheegtay Hay'adda Caafimaadka Adduunka eeWHO.\nWaxay u muuqataa in kiniinnadan, oo markii ugu horreysay la sameeyay kuwoodii hore 1950-meeyadii, ay haatan si adag loogu weerarayo baraha bulshada.\nWaxaa TikTok lagu wareejinayaa tobanaan muuqaal oo malaayiin jeer la daawaday, kuwaas oo ay haween dhalinyaro ahi ku sheegayaan in kiniinnada ka hortagga uurka ay keeni karaan kansar, isla markaana ay Hay'adda Caafimaadka Adduunka dhowaan u aqoonsatay inay yihiin \" heerka 1-aad\" – oo la mid ah tubaakada, khamriga, asbes-toska, iyo hilibka si warshadaysan loo farsameeyay.\nLaakiin intee bay run yihiin sheegashooyinkan? Oo ma jiraan wax kale oo aynaan garanayn oo ku saabsan kaniiniyada ilaalinta uurka?\nXigashada Sawirka, Getty Images\nDhammaan  hormoonnada ka-hortagga uur-qaadista , oo ay ku jiraan kaniinniyada ilaalinta dhalmada, waxay ku shaqeeyaan iyagoo siidaaya hormoon macmal ah 'syn'thetic' kaas oo maskaxda ku khiyaaneeya inaysan u sheegin ugxan-yari inay soo daayaan ukunta bil kasta oo sii dhuujisa xabka ilmo-galeenka ee furitaanka ilmo-galeenka. Si  wada jir ah,  Labadan arrimood oo isu tagay waxay ka hortagaan in ukunta haweeneyda la bacrimiyo, sidoo kalena waxay ka hortagaan in minka uu diyaar u noqdo inuu qaabilo uur.\nWaxaan waydiinay laba dhakhtar faahfaahin dheeraad ah oo ku saabsan kaniinnadan, noocyadooda, sida ay u shaqeeyaan, iyo khatarta la xiriirta.\nEnd of Ugu akhris badan\nProfessor Mohi El-Din Saud oo ah khabiir ku takhasusay arrimaha dhalmada, haweenka iyo kansarka isla markaana leh boqolaal maqaal cilmiyeed oo ku saabsan arrintan, ayaa noo sheegay in tan iyo markii la bilaabay isticmaalka kaniiniyada ugu horreeyay ee dhalmo-xakamaynta sanadihii 1950-meeyadii iyo 1960-meeyadii, laga hadlayey suurtagalnimada in kaniiniyadani ay sababi karaan kansarka.\nSi kastaba ha ahaatee, sida uu sheegay Saud, dhibaatadu waqtigaas \"waxay la xiriirtay nooca iyo qadarka hormoonnada ku jiray kaniinniyadan, kuwaas oo aad uga duwan kaniinniyada maanta la heli karo.\"\n\"Waxay isticmaaleen estrogen keligood, sanado ka dibna waxay ku dareen progesterone, waxayna ku bilaabeen qiyaaso badan oo hormoonnadaas ah, ilaa 100 micrograms ee ethinyl estradiol,\" qaabka synthetic ee estrogen, ayuu sharaxay.\nKaniinnada ka hortagga uurka ee maanta \"waxay ka kooban yihiin 30 micrograms oo ethinyl estradiol ah, halka kaniiniyada kale ay ka kooban yihiin 20 iyo 15 microgram oo hormoonkan,\" sida uu sheegay Saud.\nWaxa uu tilmaamay in si la mid ah progesterone, \"qadarka loo isticmaalo kaniiniyadan si weyn loo dhimay.\"\nKiniinniyadii ugu horreysay ee afka lagu qaato ee ka hortagga uurka waxaa oggolaaday Maamulka Cuntada iyo Daawooyinka Mareykanka (FDA) waxaana suuqa lagu iibiyey sanadkii 1960-kii.\nWaxaa jira laba nooc oo kiniinnada ka hortagga uurka ah kuwaas oo ku kala duwan heerka xadiga iyo qiyaasta maadada.\nDr. Ghina Ghaziri oo ka tirsan jaamacadda Maraykanka ee Beirut ayaa waraysi ay siisay BBC-da Carabiga waxa ay tilmaantay in nooca koowaad uu ka kooban yahay kaliya progesterone oo ay aad u yar tahay, halka nooca labaadna uu yahay kaniini isku jira oo ka kooban progesterone iyo estrogen.\nFaahfaahin ay dumar  badan, oo xitaa kuwa isticmaala kiniinnadan, aanay ogeyn ayaa ah in kiniinnada ka hortagga uurka ay joojiyaan caadada. Dhiigga dumarka ay arkaan maalmaha yar ee ay joojiyaan qaadashada kiniinnadaasi ma aha dhiig caado, balse waa natiijada jirka oo ka jawaabaya bixitaanka hormoonnada, mana la laha wax xiriir ah oo toos ah dhiigga caadada.\nXigashada Sawirka, Getty Images\nMarka hore, waa in la caddeeyaa in Ururka Caafimaadka Adduunka uusan soo saarin wax tallooyin cusub ah oo ku saabsan kiniinniyada ka hortagga uurka, mana uu muujin xiriir toos ah oo ka dhexeeya kiniinnadaas iyo kansarka, sida lagu faafiyay TikTok.\n\"Waa inaan aad u cadaano,\" ayuu yiri Saud. \"Waxaa jira daraasado qaar, in kastoo ay yar yihiin, oo soo gabagabeeyay in haddii haweenku isticmaalaan noocyo gaar ah oo kiniiniyada ka hortagga uurka ah inta lagu jiro marxalad gaar ah oo noloshooda ah iyo muddo dheer — taasoo ah, in ka badan 10 ama 15 sano — kiniiniyadani ay sababi karaan koror yar oo aad u yar oo ku yimaada bararka, gaar ahaan aagga naaska.\"\nLaakiin waxa uu intaa ku daray in daraasado kale ay awoodi waayeen inay caddeeyaan arrintan.\nSi loo fahmo heerka halista, cilmi-baarayaal British ah ayaa sannadkii 2023-kii awoodday inay sawirka u soo dhaweeyaan xaqiiqada. Waxay ogaadeen in isticmaalka kiniinniyadan muddo shan sano ah uu kordhiyo halista haweeneydu ku qaadi karto kansarka naaska muddo shanta iyo tobanka sano ee soo socota 20 ilaa 30 boqolkiiba, taas oo ku xiran da'deeda xiligaas.\nSidaas darteed, tirada kiisaska dheeraadka ah ee kansarka naaska ee ku dhaca 100,000 haweeney oo isticmaasha kiniiniyada ka hortagga uurka waa: siddeed kiis haddii ay kiniinka qaateen intii ay jireen da'da da'yar ilaa labaataneeyada , iyo 265 kiis haddii ay kiniinka qaateen intii ay jireen da'dooda soddomeeyada bartankeeda ilaa inta dambe.\nSaud iyo Ghaziri labaduba waxay qaataan hab la mid ah si ay ula macaamilaan haweenka da'da yar iyo haweenka leh xubnaha qoyska ee qaba kansarka naasaha.\n\"Saud wuxuu leeyahay in dhakhaatiirtu laga yaabo inay waqti qaataan ka hor inta aysan qorin kiniiniyadan haweenka laga yaabo inay u nuglaadaan kansarka naaska sababtoo ah taariikh qoys oo kansarka naaska ah, isla markaana ay leeyihiin kromosoomyo ama hiddo-sideyaal keeni kara cudurkaas.\"\nGhaziri waxa ay tilmaantay in kiiskan aanay doorbidayn in ay u qorto kaniiniyadan muddo ka badan toban sano.\nSaud wuxuu tilmaamayaa in waxa muhiimka ah ay tahay in dhakhtarku sameeyo daraasad faahfaahsan oo dhamaystiran oo ku saabsan xaaladda caafimaad ee bukaanka si loo go'aamiyo in kiniiniyada ka hortagga uurka ay ku habboon yihiin xaaladdeeda iyo taariikhdeeda caafimaad, oo ay ku jiraan cudurrada hidde-sideyaasha ah ee qoyska.\nLabada dhakhtar waxay sidoo kale tilmaameen in, dhinaca kale, kiniiniyada ka hortagga uurka ay ka hortagi karaan kansarka ugxanta, iyo in ilaalintan ay sii socoto sanooyin badan xitaa haweenku joojiyaan isticmaalka kiniinnadda.\nXigashada Sawirka, Getty Images\nSida hore loo soo sheegay, kiniinnadan ma aha oo kaliya in looga hortago uurka. Waxay leeyihiin faa'iidooyin kale, kuwa ugu muhiimsan ayaa ah in ay yareeyaan calaamadaha cudurka polycystic ovary syndrome (PCOS), oo ah cudurka hormoonka ugu badan ee haweenka ku dhaca.\nGhaziri waxay tilmaamaysaa in kiniiniyada ka hortagga uurka ay yihiin daawada ugu badan ee loo qoro haweenka qaba cudurka polycystic ovary syndrome (PCOS) guud ahaan dunida, sababtoo ah waxay wax ka qabtaan calaamado dhowr ah isku mar. Waxay hagaajiyaan wareegga caadada waxayna hoos u dhigaan heerka hormoonka ragga, kaasoo keena maqaarka saliidda leh, finan, iyo timaha xad-dhaafka ah.\nSidaas kale waxay tilmaaamtay in la oggolaado in faa'iidooyinka 'bilicda' ee kiniiniyada ka hortagga uurka, ugu yaraan, aanay ahayn kuwo joogto ah. Finanka, timaha ama xaada xad-dhaafka ah, iyo maqaarka saliidda leh ayaa dib u soo muuqan doona marka la joojiyo isticmaalka, markaasna bukaanku waa inuu raadiyaa xalal kale.\"\nXigashada Sawirka, Getty Images\nSaud wuxuu sheegay in hadalka ku saabsan xiriir ka dhexeeya kiniiniyada ka hortagga uurka iyo ilmo-la'aanta uu yahay mid aan sax ahayn. Wuxuu intaa ku daray, 'Tani waa mid ka mid ah fahamka khaldan ee ugu badan ee laga qabo kiniiniyada ka hortagga uurka.'\"\nDhinaca kale, wuxuu leeyahay, 'Kiniinku xitaa wuxuu yeellan karaa saameyn wanaagsan marka la doonayo uur dambe, maadaama uu dhab ahaantii ilaaliyo ugxanta isagoo joojinaya ugxan-soo-deynta, taasoo ka hortagta cudurro sida endometriosis iyo finan ugxanta ku samaysma, oo ah labo xaaladood oo caafimaad ku adkeeya dhalmada.'\"\nWuxuu sharaxayaa fahamka khaldan ee dadka qaar isagoo leh, 'Waxa badanaa dhaca waa in dadka qaar aysan ogeyn dhibaatooyinka ay horey u qabeen, sida cudurka polycystic ovary syndrome, oo sababi kara ugxan-soo-deyn aan joogto ahayn taasoo dib u dhigta uur qaadashada, ama endometriosis. Marka ay joojiyaan isticmaalka kiniiniyada ka hortagga uurka, waxay aaminsan yihiin in daawadaas ay keentay in aysan uur qaadin, halkii ay eegi lahaayeen dhibaatooyinkii caafimaad ee horey u jiray.'\"\nSaud wuxuu sheegay in mararka qaar, isticmaalka kiniiniyada ka hortagga uurka uu saameyn wanaagsan ku yeelan karo ugxan-soo-deynta haweenka qaba cudurka polycystic ovary syndrome, kuwaas oo aan ugxan-soo-deynin bil kasta.\nXigashada Sawirka, Getty Images\nIsagoo telefoonka kula hadlay BBC Carabi, Saud wuxuu  xaqiijiyay in \"waxba haweeneyda ka joojin karin inay ukumo lumiso, xitaa inta ay uurka leedahay ama aysan ukumo soo deynayn\".\" Waxa uu intaas ku daray in arrintan ay sidoo kale khusayso xilliyada la isticmaalayo kiniinada ka hortagga uurka.\nDhankeeda, Ghaziri waxay sidoo kale xaqiijisay in isticmaalka kaniiniyadan aysan dib u dhigin menopause.\nEraygii ugu dambeeyay, Saud wuxuu sheegay inuu aaminsan yahay in kiniinada ka hortagga uurka ay yihiin kuwo ammaan ah isla markaana muddo dheer la isticmaalayay. Waxa uu intaas ku daray, \"Dawo kasta, xitaa aspirin oo ah mid sahlan, waxay leedahay waxyeellooyin, sidaas darteed qof kasta oo dawada qaadanaya waa inuu miisaamaa faa'iidooyinka iyo khasaaraha ay isaga u leedahay si shakhsi ah.\nWaxa uu tilmaamay, dhinaca dhakhtarka, \"dhakhtar kastaa waa inuu si fiican u daraaseeyaa bukaankiisa oo aanu u qorin wax daawo ah iyada oo aan si dhab ah loo baarin oo aan si dhow u darsin xaaladdooda, taariikhda caafimaad, iyo sidoo kale taariikhda caafimaadka qoyskiisa.\"\nDhankeeda, Ghaziri waxay ku nuuxnuuxsatay muhiimada ay leedahay in la baro dhakhaatiirta iyo bukaanka labadaba \"saamaynta xun iyo waxyeelada kaniiniyada ka hortagga uurka, iyo sidoo kale in lagu wargeliyo bukaanada habab kale oo loogu talagalay xakameynta hormoonnada ama ka hortagga uurka haddii kiniinka ka hortagga uurka aysan ku habboonayn iyada sabab kasta ha ahaatee.\"\nWaxay ku soo gabagabaysay, \"Fikirka bukaan-socodka iyo fikradda ku saabsan daaweynta aan u qornay waa mid aad muhiim u ah. Waa inaan mar walba la tashano bukaanka oo aan waydiinno saameynta daawadu ku leedahay iyada.\"", "date": "2025-10-20", "scraped_at": "2025-11-10T15:32:17.877551+00:00", "category": "news", "text_hash": "d8ac19650292671c8042c5c087c51e9cb765a39bdc9199c1d7fafab0ee012786", "minhash_signature": "4758028,764637,4018805,2561783,2782360,881764,1172131,656717,4325303,382277,4836858,650113,6081021,3915973,274268,2800605,1577521,1886588,1270368,1951796,3221192,1866709,2280901,844079,3550197,11869,2468958,2297273,1845522,8123693,1610770,3381658,694055,5818186,751000,9247050,3418095,1265214,1030994,374339,1258620,5673898,4699490,701825,1706596,1267982,4338758,1820339,2049706,3015296,856054,127265,1796729,2298178,7824055,901772,1992927,4494547,2429944,308536,2354665,1954528,3288550,1937548,5652372,1250757,12509511,1004517,92752,826234,3605628,355722,1643681,3945525,905146,2117901,711038,4488629,871077,2324082,1148350,995102,1344009,1297841,33260,283019,3460613,1597567,3100941,1326435,2361383,280967,702473,673957,886653,4249238,4645335,1405379,1227304,18958722,5964451,2173796,1427717,749603,146488,281612,3518065,194016,463435,5212787,278063,1849530,855227,7759342,848057,2267824,199306,3865568,1668685,5610159,509388,2026265,1826597,1211187,4386773,722802,6613369,1349493"}
{"url": "https://www.bbc.com/somali/articles/ckgyrdzmvzdo", "title": "Booliska Galmudug oo BBC-da u sheegay war cusub oo ka soo kordhay dhacdo argagagax leh oo ka dhacday deeganada maamulka", "text": "Xigashada Sawirka, Booliska Galmudug\nFal dad badan ay ka argagaxeen ayaa habeen hore ka dhacay deegaan miyi ah oo u dhaxeeya deeganada Qaayib iyo Xiindheere  oo hoostaga degmada Baxdo ee gobolka Galgaduud ee maamulka Galmudug.\nDhacdada ayaa ahayd markii rag hubaysay ay dileen, hooyo iyo saddex carruura oo ay dhashay. saddexda carruurta ah ayaa ahaa gabdho yar yar  sida Booliska Galmudug u sheegay BBC-da.\nSida warbaahinta maxaliga ee Soomaaliya qaarkeed iyo Barasha bulshada lagu sheegay dhacdaddan ayaa lagu xiririyey inay ahayd aano-qabiil,  laakiin Booliska Galmudug waxay BBC-da u sheegeen in wali baaritaan socdo oo dib laga cadayn doono waxaa arrintaasi la xiriirto basle waxay dhacdadaas ku tilmaameen \"Fal ugub ah oo arxan darro ahaa\"\nKa dib dhacadaaas naxdinta lahayd ciidamada ammaanka ee maamulka Galmudug ayaa bilabaay howlgalo lagu raadinayo dadkii falkaas ka dambeeyey oo la sheegay inay baxsadeen sida uu BBC-da u sheegey taliska booliska ee Galmudug.\nXigashada Sawirka, G/Sare Khaliif Cabdulle Maallin\nSida uu BBC-da u sheegay Gashaanle Sare Khaliif Cabdulle Maallin, taliyaha ciidanka Booliska maamulka Galmudug, howlgallo  socday wax ka badan afar iyo labaatan saacadood oo ay iska kaashadeen ciidamada booliska iyo kuwa gaarka ee madaxtooyada Galmudug ayaa suura galiyey in gacanta lagu soo dhigo saddex ruux oo loo haysto dilka qoyska.\n\"Howlgalku wuxuu bilaamay shalay galab sideedii iyo bar duhurnimo wuxuuna soo gagaba gaboobay galabtay tobbankii galabnimo, kaas oo ahaa mid xiriir ah muddaas, waxaa suuragalay in ay la soo qabtay eedeysanayaashii geystay dhibaatadii foosha xumaa dilkii foosha xumaa ee aadka u liitay dadkii geystay oo saddex nin ahaa\" ayuu yiri Taliye Khaliif.\nTaliyaha Ciidanka Booliska Galmudug, wuxuu sheegay in ciidamada ammaanku ay raggan ka soo qabteen meel 150km u jirta deegaanka Qaayib ayna geyn doonnaan Dhuusomareeb si sharciga loo horgeeyo.\n\"Caasimadaa la geyn doonaa garsooraha dacwadaas qaadi kara wuxuu joogaa halkaas\" ayuu yiri.\nEnd of Ugu akhris badan\nXigashada Sawirka, Booliska Galmudug\nIsagoo sharaxay sida dhacdadan ay dadka deegaanada ugu abuurtay argagax xooggan ayuu taliyaha Booliska Galmudug sheegay \"Waxaan aragnay dad shacaba oo dumar ah oo soo qaxaya oo soo cararaya halkii raggu ka soo carari jireen markii dhibaato dhacdo\" ayu intaas raaciyey taliye Khaliif.\nWuxuu intaas raaciyey in qeybaha kala duwan ee bulshadu  ku nool magaalooyinka Cadaado, Baxdo  iyo deeganada hoos yimaado ay si weyn ugu caroodeen falkaas ayna gacan ku siiyeen inay gacanta ku soo dhigaan raggan ay boolisku ku tilmaameen eedaysanayaashii ka dembeeyey dilka qosykaas.\nSida ay noo sheegeen dad deegaanka ah, aabaha qoyska ayaa galay xaalad koomo ah ka dib falkaas naxdinta leh ee ku dhacay qoyskiisa iyadoo sidoo kale ay argagax ku riday dadka deegaanka ay dhacdadu ka dhacday.\nTaliska Booliska Galmudug ayaa xusay inay ka dalbanayaan shacabka in si wadajir ah looga hortago falalka noocaas ee lidiga ku ah dhaqanka suuban iyo diinta islaamkaba.\nFalkaas oo ahaa mid naxdin leh ayaa carro xooggan ka dhaliyey baraha bulshada iyadoo shacabku ka dalbadeen maaamulka in kuwii ka dembeeyey la soo qabto.\nMa aha markii ugu horreysay ee dhacdo sidaas oo kale u argagax leh ay ka dhacdo deegaano badan oo dhulka Soomaalida ah basle tan ugu dembaysay ayaa si weyn u dhalisay carro badan oo bulsho.", "date": "2025-10-10", "scraped_at": "2025-11-10T15:33:17.936446+00:00", "category": "news", "text_hash": "48a6a70a56b1807d4e923e2cc5cdcd8a41a38e31305b252760e8a31a73881e98", "minhash_signature": "722270,3713524,2220796,9269910,3520087,1428697,7507277,35934824,9447607,7615775,16345796,919195,2047348,7782425,7554944,4200074,22358551,10077045,1508228,5908925,16642354,7591353,7139805,4741802,17234030,12634360,18124391,8848875,1431573,876936,14556750,342949,12540279,4916794,1591,1573349,6030099,2539337,2309612,13667702,6503514,10796169,20860734,2066876,1393177,10342972,12436959,4845974,261902,681764,1464947,3334150,1662310,591727,217381,1593403,7286512,13961793,4393852,6578362,13348965,6146989,2216684,8917431,14855403,8321515,1318318,3150053,5604214,1901040,78301,2430084,10130745,4541529,1108905,1626423,18397125,10819166,12659836,266209,15038922,28130335,7033081,5402967,32489365,4960526,4980529,6779994,1994325,4181282,124139,16574014,2450998,1929192,3797421,2810303,11451738,12538887,868329,54025343,2369077,2680167,570582,6986295,2587878,4485837,7048496,489597,5933485,1165113,7540022,4931375,2216360,6162924,11841048,15918264,8865975,3251814,8559077,1384620,17147170,6860246,2093682,14856502,7204291,8677762,7738407,2313189"}
{"url": "https://www.bbc.com/somali/articles/c3epd91732no", "title": "Booliiska Canada oo qabtay nin caddaan ah oo gurigooda ku weeraray qoys Soomaali ah", "text": "Qaar ka mid ah Soomaalida ku nool Edmonton ayaa isugu yimid kulan deg deg ah kadib weerar nin caddaan ah uu ku qaaday rasaasna huwiyay qoys Soomaali ah oo daris la ahaa.\nNinka ayaa la sheegay inuu deris la ahaa qoyska uuna ka dhaxeeyay derbiga guriga, rasaas ayuu dhowr jeer derbiga kasoo dusiyay taasoo cabsi ku abuurtay hooyada iyo carruurteeda.\nHaweeneyda Soomaalida ah oo sababo ammaan dartood aan dooneyn in magaceeda la shaaciyo ayaa sheegtay inay cunno u diyaarineysay ilmaheeda markii ay maqashay dhawaqa rasaasta dhowr jeer.\nKulanka bulshada Soomaalida ee Edmonton kadib ayaa weriye Durraan Xasan Yare  wuxuu arrinta ka waraystay Ahmed-yaasiin Jaamac Cabdulqadir oo ka mid ahaa qaban-qaabiyeyaashii kulanka sidoo kalana ehel la ah qoyska dhibaatada loo gaystay\nLifaaqa kore ka dhegeyso wareysiga:", "date": "2025-11-04", "scraped_at": "2025-11-10T15:34:17.875206+00:00", "category": "news", "text_hash": "99c8ab74af725e69c293ae617d4930d7df8bfb9d0cc356c6d26c718b75ad81a4", "minhash_signature": "23764587,139654492,17212676,48804508,77624029,58666821,7969595,22970693,5572236,8240890,29843726,55359613,12452149,4229733,38543932,44857234,10872733,17098073,3412160,33382622,151382883,154310764,74362980,7971398,6881012,20855605,23580227,24853428,38957642,2794013,26297571,36366347,63430791,6326033,57221700,9989852,59740207,42965478,4161399,9173703,31990464,16760276,2890428,74376615,36367982,88869,3984257,3903702,14662056,15142113,18223666,35822431,4098550,3611176,12708870,39556039,35222615,9183990,18501783,5467028,61049673,62934928,7962261,3316986,6583842,18464767,6730014,25722600,10488233,84060873,7590081,1180857,92167509,4271632,88336571,21166472,2181902,103047998,17806180,21979186,36428123,1842968,56755806,78725429,77859835,9291492,136047666,6655185,2376301,16372705,42077908,5183479,4587397,6687828,29665322,31476855,31845946,53448660,1492760,38132659,769127,36977889,11209112,30731597,30572667,28099609,25481567,61499575,52745259,19906473,23693874,63184140,6006151,28505911,8460713,13914682,32649626,14805207,703821,14370478,17769753,10201614,3086679,53211718,4485665,19608859,786990,14476274"}
{"url": "https://www.bbc.com/somali/articles/cjed8q7d507o", "title": "Maxaa lagu xalliyay xiisadii ka dhalatay xafladda xeerka Ciise ee Seylac", "text": "Xigashada Sawirka, Facebook\nXukuumada iskeed ugu dhawaaqday madaxbanaanideeda ee Somaliland iyo salaadiinta gobolka Awdal ayaa xal ka gaaray xiisad maalmihii ugu danbeysay ka taagneyd magaalada Seylac taas oo la sheegay in ay salka ku haysay xaflad la sheegay in halkaas lagu qabanayo taas oo ku saabsan xeerka Ciise oo dhawaan Hay'adda Jamciyadda Qaramada midoobay u qaabilsan dhaqanka ee UNESCO ay u aqoonsatay xeer dhaqameed Qadiimi ah.\nShir muddo laba maalmood uga socday magaalada Boorama Xukuumadda Somaliland oo uu hoggaaminayey Wasiirka Arimaha gudaha iyo Amniga Cabdalla Maxamed Carab iyo Salaadiinta gobolka Awdal ayaa lagaga hadlay sidii loo dejin lahaa oo xal looga gaari lahaa xiisadda taas oo ay ka dhasheen mudaahaardyo iyo dhalinyaro la xirxiray.\nSuldaan Cabdiraxmaan Jaamac Dhawal oo ka mid ah salaadiinta dhaqanka ee gobolka Awdal ayaa BBCda uga warramay shirka ay salaadiintu la yeesheen xubnaha wasiirada ah.\nSuldaanka ayaa sheegay in khilaafaadkii maalmahan ka jiray Galbeedka Somaliland oo ay dadku siyaabo kala duwan uga hadlayeen in guddiga dhaqanka ee Galbeedka Somaliland ay go'aansadeen in arintaasi la xakameeyo wadahadlna lagala yeesho Xukuumadda Somaliland oo miiska wadahalka la iskugu yimaado.\nXigashada Sawirka, IBRAHIM AXMED\nSuldaan Dhawal  oo ka hadlayey arimaha laga wadahadlay ayaa sheegay in odayaashu ay soo gudbiyeen qoddobo ay u arkeen in ay yihiin xal iyo tallooyin arinta lagu xallin karo taas oo wafdigii uu hoggaaminayey Wasiirka Arimaha Gudaha, Cabdalla Maxamed Carab markii ay isla arkeen qoddobada ay kusoo gabagabowday is afgarad.\nXukuumadda ayaa qaadatay wixii ay masuuliyad u lahayd sida  sugidda ammaanka,  halka salaadiintuna ay dadkii kacsanaa u sheegeen in howshaasi laga wada hadlay oo la xalliyay.\nWaxa jiray dhalinyaro tagtay Seylac oo ku lug lahaa xiisadan ka dhalatay xafladda xeerkan Ciise ee muranka dhalisay kuwaas oo dhawaan halkaas laga soo xiray, balse Suldaanka ayaa sheegay in dhalinyaradaasi la soo daayey oo hadda ay joogaan guryahooda.\nMar la weeydiiyay suldaanka in ay xukuumada kala hadleen arrinta salka u ahayd xiisaddan taas oo ahayd in xaflad ku saabsan xeerka Ciise lagu qabanayo magaalada Seylac, waxa uu Suldaanku kaga jawaabay in laga wadahadlay oo uu ahaa qoddobka ugu horreeya wadahadalka \"wixii nabadgelyo xumo keenaya dowladda ayaa qaadatay oo u xilsaaran, anaganna wixii naga quseeyay ayaan ka qaadanay\" ayuu yiri Suldaan Dhawal oo  dadka ugu baaqay in qof walba uu dantiisii iyo shaqadiisa ku noqdo, arinkaasina uu soo gabagaboobay.\nEnd of Ugu akhris badan\nSuldaanku ma caddeyn in la qabanayo xafladda xeerka Ciise iyo in kale balse waxa uu ku gaabsaday in wax alle wixii nabadgelyo darro keenaya ay masuuliyadeeda qaadatay xukuumaddu.\nHay'adda Qaramada Midoobay u qaabilsan dhaqanka ee UNESCO ayaa si rasmi ah u aqoonsatay Xeer Ciise, oo ah xeer qarniyo jiray oo ay ku dhaqmaan beesha Ciise ee degta dalalka Jabuuti, Itoobiya iyo Soomaaliya, waxayna ku dartay liiskeeda waxyaabaha dhaqanka aadmiga la xiriira.\nAqoonsigan taariikhiga ah ayaa lagu saleeyay sida xeerkan uu u mideeyo bulshooyinka, uuna u dhowro dhaqanka oo uu Geeska Afrika ugu dhiirrigeliyo caddaaladda.\nIn xeerkan ay aqoonsato UNESCO ayaa waxaa si wadajir ah u gudbiyay dad ka soo kala jeeda Itoobiya, Jabuuti iyo Soomaaliya, waxana lagu ansixiyay fadhigii 19aad ee guddi-goboleedka hay'adda, kaasoo lagu qabtay magaalada Asunción, ee dalka Paraguay.\nUNESCO ayaa Xeer Ciise ku dooratay sida uu u xoojiyo qawaaniinta caalamiga ah sida xuquuqda haweenka iyo carruurta, dhowridda deegaanka iyo xallinta khilaafaadka.\nUNESCO ayaa ammaantay hannaankan oo ay u aragtay inuu tusaale dhif ah u yahay dhaqanka sharciga ah ee nool kaasoo dhiirrigelinaya dowlad-wanaagga iyo iskaashiga isagoo sidoo kale wax ka qabanaya caqabadaha maanta sida xallinta khilaafaadka iyo dhowridda deegaanka.\nXigashada Sawirka, LOOH PRESS\nQabiilka Ciisaha oo aad u dega Jabuuti, Qaybo ka tirsan Somaliland iyo Itoobiya, ayaa waxa uu leeyahay xeer soo jiray sida la sheegay ku dhawaad 500 oo sano. Xeerka waxaa sameeyay 100 oday oo la soo xulay, waxaana lagu sameeyey magaalada Mile tuulo hoostagto oo la yiraahdo Waaruf, deegaankaasi oo u dhaxeeya magaalada Diridhaba ee Itoobiya iyo Jabuuti.\nMarka laga soo tago xeerarka ay qabaa'ilka Soomaaliyeed wadaagaan sida hoggaanka ka dhaxeeya, xeerka qof kasta qabanaya iyo in dagaalka la wada galo haddana waxay leeyihiin kuwo iyaga u gaar ah.\nWaxyaabaha Ciisaha u gaarka ah waxaa ka mid ah sida uu dhigayo xeerkooda wax la yiraahdo 'Ganda' ayaa jira, Ganduhu wuxuu ka kooban yahay 44 oday oo talada Ciisaha ay ka go'do, waana baarlamaanka Ciisaha. Arrimo weyn oo adag haddii ay dhacaanna waxaa isugu imaanaya boqolka oday iyo boqorka ayuu yiri Oday Aadan Allaale oo ka mid ah odayaasha beesha.\nSidoo kale Xeerka Ciise waxyaabaha uu kaga duwanyahay xeerarka kale ee beelaha Soomaalida waxa ka mid ah habka loo doorto ugaaska kaas oo sida beelaha kale aan dhaxal aheyn.", "date": "2025-10-07", "scraped_at": "2025-11-10T15:35:17.990712+00:00", "category": "news", "text_hash": "3b3099912fc27a74503d6583a75d5a5bcbe29ea1cbfcb3041867eeaef538d74a", "minhash_signature": "1538280,6411601,1147550,425057,3980967,471139,2656466,3828302,10759872,7795581,9159995,5808767,2047348,3940316,7039707,977974,17878031,1829084,41251,6320346,15335190,4765514,19720138,248960,3521999,10381039,1484023,5643234,20824734,9150976,2072752,4983966,3876338,2633331,3726478,4463262,2121027,14035527,3005397,7196841,530289,7493125,1635835,12451138,10402410,3311996,128218,7169710,6206723,4369236,7366006,3334150,4113758,2255547,14505653,2679593,3328583,4192325,4336052,13708068,1736984,1490692,425968,6826803,10300837,4215030,4498478,2005022,4702265,14082918,3574976,5064863,1969884,562332,20169721,10686954,2994126,25299699,4782,1112530,265698,8699800,8594108,8024920,370403,16263332,3546500,4114999,5627754,5472519,3199763,5649798,38358661,5387685,4044679,4287303,8410043,934682,1492760,10590247,4778918,5567773,1594872,7428445,3623139,14490493,1294173,4353694,4307885,3734443,49588,10754981,10888051,615708,4507176,13904912,5157178,12322483,1241552,1256626,147763,5747641,6066537,5975046,817225,6922810,18533292,3108099"}
