{
  "url": "https://www.bbc.com/somali/articles/c5ykgvegyrmo",
  "title": "Deegaan Soomaaliyeed oo jaangooyey kharashka ku baxa guurka. Ciddii diidda maxay mutaysan kartaa",
  "text": "Xigashada Sawirka, Getty Images\nOdayaasha dhaqanka iyo maamulka degmada Xamaro ee gobolka Erer ee Dowlad Deegaanka Soomaalida iyo qaybo ka tirsan bulshada deegaanka ayaa soo saaray go'aanno ku saabsan qiimaha iyo lacagaha ku baxa guurka. Go'aannadaas ayaa lagu mamnuucay waxyaabo badan oo laga bixiyo gabadha loo geed-fadhiisanayo\nSheekh Cabdiraxmaan Rashiid waa madaxa golaha arrimaha Islaamka ee degmadaasi waxa uu BBC-da uga warramay sababta keentay go'aanada la soo saaray iyo waxa ku soo kordhay bulshada.\n\"Waxa jiray in muddo ah waxyaabo ku soo kordhay guurkii caadiga ahaa ee la yaqiinay, marka taas ayaa saldhig u ahayd in aan shirno oo aan go'aamo ka soo saarno guur xumada iyo waxyaabaha waayadan dambe ku soo kordhay bulshada gaar ahaan degmada Xamaro\".\nSheekh Cabdiraxmaan ayaa sheegay in waxyaabo badan ay soo ku kordheen guurka waqtiyadan dambe kuwaas oo ah wax cusub oo culeyska ku ah dadka is guursanaya.\n\"Waxybaaha aan mamnuucnay waxaa ka mid ah sida dhar la bixiyo marka gabadha loo fadhiisanayo, qaad iyo sigaar oo iyagana waajib laga dhigay iyo geel la qalayo guurka ka hor\" ayuu yiri Sheekh Cabdiraxmaan oo intaas ku daray \"gabaatiga oo waagii hore xubin sharafeed ahaa sida odayaasha dhaqanku noo sheegen waxaa ku kordhay in la bixiyo geel la yiraahdo Gabaati oo oo aan yarad aheyd oo xaafada la siiyo oo geelaas in muddo ah la iska haysto kaddibna ninkii lahaa loo celiyo\".\nDhaqanka in gabadha xoolo laga bixiyo ma ahan wax ku cusub bulshada balse sida sheekhu sheegayo waxyaabo dheeri ah ayaa soo baxay taas oo keentay in dhaqankii hore meesha ka baxo\nEnd of Ugu akhris badan\n\"Hadii dhaqankii hore layska haysanayo, oo aan aad looga sii guureynin, oo waxyaabo cusub aan la keeneyn, iska caadi bay noqon laheyd, oo bulshada wax badan mey dareenteen, laakiin waxaa dhacday in fasaadkii uu batay, guurkii uu adkaaday\" ayuu yiri sheekha oo intaas ku daray in \"dhaqamo badan lagu soo daray dhaqankii hore, wixiina ay isla sii adkaadeen, taasna ayaa keentay in dhibaato kale dhalinyaradi u baxdo\".\nSheekh Cabdiraxmaan oo sharaxay waxa ay sida rasmiga ah uu diidan yihiin ayaa sheegay in ay joojiyeen waxyaabaha dheeriga ah.\n\"Waxaan gabi ahan joojinay wixii gabbaa la oran jiray gabihii, dharkaas iyo waxyaabaha raad raaca, waxaan ugu talo galnay in si xalaal ah oo haboon laysu guursado, loona wada dhaqmo, loona dhiso reer xalaal ah\".\nSi loo fuliyo go'aamada soo baxay waxa uu sheegay Sheekh Cabdiraxmaan in ciqaabayo cidii u hoggaansami weyda.\n\"Wixii aan soo saarnay cidii ka hortimaada waxaa u yaal xeer ciqaabeed xarig iyo hanti isugu jira\".\nXigashada Sawirka, Getty Images\nMa ahan markii ugu horeysay ee go'aamo laga soo saaro nidaamka guurka meelo ka mid ah gobolada Dowlad Deegaanka Soomaalida. Hore ayaa loo soo saaray in dhaqamdaas la joojiyo taasna ma dhaqan galin.\nSidoo kale Bulshada ku dhaqan magaalada Godey ayaa hore ugu heshiiyay in ay hoos u dhigaan kharashka ku baxa guurka. Goa'ankaas ayey dadka deegaanka sheegeen in ay uga gol leeyihiin sidii dhallinyarada loogu fududeyn lahaa guurka xilli sanadihii ugu dambeeyay uu soo badanayay kharashka ku baxa aroosyada.\nHaween ku nool Godey oo BBC-da hore u weydiisay rayigooda ku saabsan in la dhimo qiima guurka iyo aragtidooda waxay sheegeen in aysan faa'ido ku jirin guurka oo la raqiisiyo.\nMid ka mid ah haweenka ayaa tiri, \"Ninka waxa uu leeyahay, qiimo iiguma fadhidid, wuuna furi gabadha, furitaankana degdeg buu noqon, adigoo iska fadhiya ayaa gurigaaga warqada laguugu keenayaa, markaad dhadho maxaa jirana, horeba qiima iiguma fadhin baa lagu dhihi\". Gabar kale oo ayaa iyadana tiri, \"Waxaan qabaa in ragga ay xoolo badan gabadha ka bixiyaan si ay gabadha ugu fara adeegaan, gabadhana ay hadhow reerkeeda u dhaqato\".\nGabdho kalena waxay qabaan in guurkii hore adkaa taasna ay keeneysay in furiinka yaraado.\nWiilal kale ayaa qaba in ay haboon tahay in guurka la raqiisiyo si qof walba uu u awoodo in uu guursado.\nMa ahan oo kaliya dhulka Soomaalida meelaha looga hadlo guurka iyo dhaqaalaha ku xeeran. Al-azhar ayaa hore u soo saartay hindise la xiriira gurka.\nHindidisaha ay soo bandhigay Azhar waxaa ujeeddadiisa lagu sheegay in \"lagu ciribtiro caadooyinka xun-xun iyo dhaqamada guurka\", iyadoo la rajaynayo in wax la fududeeyo, lagana hortago buunbuuninta iyo kharashka badan ee la galo, gaar ahaan xilligan oo xaaladda dhaqaale ee dunida ay aad u liidato.\nWuxuu hindisuhu ka kooban yahay dhowr weji. Tan ugu horreysa waa xafladda meherka, oo la doonayo in lagu koobo arrimaha ugu muhiimsan sida: \"In la akhriyo Suurat Al-Faatixa iyo in lagu casuumo oo keliya qaraabada ugu dhow ama xubnaha qoysaska labada dhinac ama in ay meesha tagaan oo keliya labada is guursaneysa iyo waalidka.\nMarxaladda labaad ee talada ay saameyneyso waa isu-diyaarinta guurka: \"Koorso degdeg ah oo loogu talagalay lammaanaha isqaba oo arrimaha qoyska ah, in lagu heshiiyo qiimaha dahabka ee markaas, balse aan lagu saleyn garaam.\"\nHalka marxaladda saddexaad ay tahay habraacyada guurka oo ay ku jiraan in aan lacag lagu bixin sawirro la galo, bisha malabka in meesha laga saaro, iyo in laga maarmo labbiska waalidka labada dhinac.\nDhammaan arrimahan waxay muujinayaan culeyska dhaqaalaha guurka ku hayo dhallinta guur-doonka ah.",
  "date": "2025-05-19",
  "scraped_at": "2025-11-02T07:24:05.603992+00:00",
  "category": "news",
  "text_hash": "c6ab532e181a9372eddb3466391fc0735d1882d47bb51f55cebf46501eba5775",
  "minhash_signature": "5033251,9851725,4583403,2553029,750885,8069540,218421,6511282,1362655,279347,5459251,6283743,1998,20062865,390162,3047012,2714111,3630222,11189497,1644733,12042731,816494,601374,489468,4926126,163152,4870013,5226785,7335499,946072,7866952,3692934,4121618,1324323,6811499,5324779,3427741,566051,1216278,21792244,10167688,12972340,671316,196318,6772679,860050,600733,503735,3089016,1302600,2749077,7063794,9597743,6681089,1487467,7832366,413474,614406,5569637,4092131,2872189,4606610,15992869,3996889,6492943,839306,1813998,5266978,4793900,6654915,9679569,681059,633357,3718019,4249289,456400,1043735,8311379,4395806,1654251,2920236,674822,6568892,6941085,8161447,4818115,9989026,8697032,3521974,4148100,6671205,13007667,1763611,14097109,3121162,958177,724184,6582396,1492760,10206037,400861,8917590,8734663,774319,1889354,4101129,17243022,15452287,2054750,1443833,492848,1669605,11972236,3086930,4718512,5542502,11577420,6339707,1800579,508588,13871233,4988143,8448611,16525675,2862121,4410117,57147,11879458"
}