{
  "url": "https://www.bbc.com/somali/articles/cqx39n43195o",
  "title": "Nin ku qasbanaaday in uu saacaddiisa qaaliga ah ku beddesho sanbuus iyo hadal heyn ka dhalatay",
  "text": "Xigashada Sawirka, Getty/social media\nKa warran haddii aad ku safrayso tareen haddana aad gaajooto... Tareenka wuxuu istaagayaa saldhig, markaas waxaad iibsanaysaa laba sambuus. Laakiin haddii aad u baahato inaad saacaddaada casriga ah ku iibsato laba xabbo oo saanbuus ah,  sidee ayaad dareemi lahayd?\nDhacdo la mid ah taas ayaa dhowaan ka dhacday Saldhigga Tareenka ee Jabalpur, oo ku yaal gobolka dhexe ee Madhya Pradesh ee dalka Hindiya.\nMuuqaal laga duubay dhacdadan ayaa si weyn ugu faafay baraha bulshada. Dadku waxay su'aalo ka keenayaan dabeecadda iyo dhaqanka kakan ee ganacsatada waddada dhinaca wax ku iibiya ee saldhigga u dhow sugan, iyagoo sidoo kale ka doodaya kalsoonida lacag-bixinta internetka iyo amniga safarka tareennada.\nRuntu waxa ay tahay in dhacdadani dhacday laba maalmood ka hor, 17-kii Oktoobar, fiidkii ku dhowaad 5:30 galabnimo, iyadoo ka dhacday madal lambarka shanaad.\nXigashada Sawirka, screen grab from viral video\nMuuqaalka waxaa laga arkayaa nin ka ordaya barta tareenka laga raaco ama looga dego si uu u qabsado tareenka, balse nin kale ayaa garabka qabanaya.\nTareenka oo dhaqaaqaya awgiis, ma awoodo xitaa inuu qaato sambuusaha, laakiin ninka saanbuusaha iibinaya ayaa ku khasbaya inuu bixiyo lacagta. Rakaabka oo xaalad adag ku jira ayaa isku dayaya inuu lacagta ku bixiyo aaladda lacag-bixinta internetka, balse lacagtu ma gudbeyso.\nEnd of Ugu akhris badan\nMarkuu aad ugu qasbanaado, wuxuu iska siibayaa saacaddiisa (saacad casri ah), wuxuuna ku wareejiyaa ninka saanbuusaha, ka dibna ninkii wuxuu siinayaa laba ama afar xabbo oo saanbuuse ah si uu isagu u sii daayo.\nMuuqaalka intaas ayaa kaliya laga arkayaa.\nLama oga inuu rakaabku horey u cunay saanbuusaha iyo in kale, ama in dhacdadani kaliya ay ku saabsanayd codsiga uu saanbuusaha ku weydiistay.\nQoraal uu baraha bulshada soo dhigay maamulka tareennada ee Jabalpur (DRM), isagoo ka jawaabaya qofka video-ga la wadaagay, wuxuu sheegay in:\n\"Ninka saanbuusaha iibinayey la aqoonsaday, ciidanka ilaalinta tareennada (RPF) ay arrinta la wareegeen, ninkana waa la xidhay, tallaabana laga qaaday si laysanka loogala laabto.\"\nSidoo kale, akoonno kala duwan ayaa sheegaya in saacaddii la helay.\nXigashada Sawirka, SOCIAL MEDIA\nXatooyo, jeebsiibid ama dharka oo layska dhufsado waa waxyaabo caan ka ah baraha tareennada, laakiin dhacdo tan oo kale ah oo qofku ku khasbanaanayo in uu dhiibo alaabtiisa waa mid naadir ah.\nDareenka dadka u muujiyeen qofka safrayay waa mid cad haddeer, laakiin dadka qaar ahyaa aad u dhaliilaya dabeecadda dhaqanka suuban ka baxsan ee qofka wax iibinaayay, sidoo kale waxay isweydiinayaan sida laysugu haleyn karo lacag bixinta Online-ka ah.\nGuddigga jidadka tareennada ayaa lagu ammaanay talaabada degdegga ah ee ay qaadeen, iyagoo lala wadaagay soo jeedinno badan. Mid ka mid ah ciiwaannada wax daabacay ayaa taladaan maamulka la wadaagay isagoo dareen u muujinaya saanbuus gadaha \"Qof qani ah ma'aha, sidaas darteed intii lagala noqon lahaa laysanka, waa in la ganaaxo.\"\nWaloow kuwo badani ayna ku qanacsanayn keliya in lagala noqdo shatiga uu ku shaqaysto, qaar badani waxayba qabaan in laga qaado talaabooyin adag uu jeelna u qalmo.\nQof wata ciiwaanka la dhaho \"Honest Cric Fan\" ayaa muuqaalka ku baahiyay barta bulshada ee X, isagoo qoray:\n\"Dhacdo foolxun ayaa ka dhacay Saldhigga Tarenka ee Jabalpur. Rakaab ayaa dalbaday saanbuuse, balse lacag bixinta ma aysan shaqaynin iyadoo la adeegsanayo PhonePe (Nidaam lacag bixineed oo Online ku shaqeeya) kadibna waxaa bilowday in tareenku dhaqaaqo, arrintaas yar oo sidaas ah awgeed ninka saanbuuska iibinayay ayaa garabka qabtay rakaabka\"\n\"Waxuu ku eedeeyay rakaabka in uu wakhtigiisii lumiyay, waxuuna si xoog ah uga dalbaday lacagta saanbuuska. Rakaabkii waxuu ku khasbanaaday inuu saacadiisa bixiyo si'uu u raaco tareenka. Hadda xiitaa ku safridda tareenka dalka kuma aha mid amaan ah\"\nQoraal kale oo uu raaciyay waxuu ku xusay in Wasaaradda Tareennada ,Rail Seva, Jabalpur, DRM, komishinka Jabalpur, isagoo dalbaday in tallaabo adag laga qaado ninka saanbuuska gada.\nSidoo kale, waxuu ku taliyay in marka aad safrayso ugu yaraan lacag 500 oo rubi ah oo cadaan ah aad wato maadaama mararka qaar hababka lacag bixinta Online-ka ah ayna shaqaynin.\nIntaa waxaa dheer, waxuu ku taliyay in qofku yeesho ugu yaraan laba akoon oo bangiyo kala duwan ah, si haddii mid shaqayn waayo kan kale lacagta ugu bixiyo.\nQof wata magaca la yiraahdo Vikram Pandey ayaa qoray:\n\"Ma ceebaa  qofka inuu isku dayay inuu iibsado saanbuusaha? Sow sax ma aha ninka saanbuusaha  iibinaya inuu dalbado xaqiisa? Miyayna ahayn in aad lacag caddaan ah la wato markaad safrayso?\"\nCricket fan-ka ayaa ku jawaabay:\n\"Runtu waxay tahay, xitaa ma uusan qaadan saanbuuska.\"\nKadib, fiidiyow kale ayaa la baahiyay, kaas oo muujinaya tareen si buuxda u buuxsamay, halkaas oo nin samosas iibinaya uu dhex socdo isagoo dambiil saanbuuse ah madaxa ku sida. Dhallinyaro badan oo ku fadhiya sariiraha sare ayaa ka xadaya saanbuusaha dambiisha, una qaybinaya asxaabtooda.\nDad badan ayaa hadda leh in hay'adda tareenada ay tahay inay rakaabkaas raadiso oo saacaddiisa u soo celiso, isla markaana ninka saanbuusaha iibinaya la ganaaxo, lacagtaasna la siiyo qofka dhibka loo geystay.\nXaaladaha noocan oo kale ah, isku xidhka internet-ka ayaa door muhiim ah ka ciyaara. Xidhiidh liita ayaa sidoo kale keeni kara dhibaatooyin ku saabsan bixinta lacagta online-ka. Taasi waa sababta loo yiraahdo: lacag caddaan ah lama beddeli karo.\nXigashada Sawirka, Thinkstock\nQof wata magac la yidhaahdo Shano Indian ayaa qoray:\n\"Marka aad tareen ku safrayso, kaliya wax ka iibso kuwa wax wareejinaya marka aad lacag caddaan ah wadato, sababtoo ah shabakadaha moobilka si fiican uma shaqeeyaan inta lagu jiro safarka tareenka. Sidaas darteed, ma awoodid inaad ka faa'iidaysato adeegyada lacag bixinta digital-ka, mararka qaar shabakadahu gabi ahaanba ma shaqeeyaan ama aad bay u daciif tahay, taasoo ka dhigaysa in la sameeyo macaamil online ah mid aad u adag.\"\n\"Haddii taasi dhacdo, wuxuu kugula doodi karaa [qofka wax wareejinaya] goobta tareenka , waxaa dhici karta inuusan kuu oggolaanin inaad fuusho tareenka, ama uu ku cabsi geliyo si uu kuugu joojiyo halkaas. Tani waxay carqaladayn kartaa safarkaaga. Sidaas darteed, haddii aad rabto inaad wax ka iibsato tareenka ama saldhigga, lacag caddaan ah ha wato.\"\nXigashada Sawirka, SOCIAL MEDIA\nHay'ad aan dowli ahayn oo la yiraahdo National Crime Investigation Bureau ayaa ku qortay barta X:\nHay'ad aan dowli ahayn oo la yiraahdo National Crime Investigation Bureau ayaa ku qortay barta X:\n\"Kani ma [wax] iibiyihii baa mise waa tuugga saldhigga?\"\nWaxay u tageen Wasaaradda Tareenada iyo Wasiirka Tareenada Ashwini Kumar, iyagoo waydiiyay:\n\"Goorma ayaa tuugada noocan ah la xakameyn doonaa?\"\nQof wata magac la yiraahdo Vidya Yadav ayaa dhacdadan xustay iyadoo waydiisay:\n\"Tani ma daacadnimo baa mise waa is qasbid cusub oo la bilaabay?\"\nWaxay sidoo kale waydiisay:\n\"Dadku waxay tareen ku safrayaan boqollaal ama kumannaan kiiloomitir oo ka fog guryahooda iyo qoysaskooda. Marka Indian Railways ma qaadan karto mas'uuliyadda badbaadada rakaabka miyaa?\"",
  "date": "2025-10-22",
  "scraped_at": "2025-11-02T07:28:05.766516+00:00",
  "category": "news",
  "text_hash": "0aefd469235f858c18080668805a9db6b614caafeca43739de8ff22c04e82fc1",
  "minhash_signature": "137171,6190254,11526668,2921342,2836675,3595564,838581,3776738,1799133,3435336,5457205,1669606,2886916,3974561,728994,10883019,2587235,2525421,13114747,4407137,4900630,6500958,737322,2517030,8423017,53861,4004522,5647429,1653043,864813,7313647,3820046,8528958,830508,3015969,3391005,1677591,897286,8562613,2109588,4742132,2967761,726394,2773207,4434782,91690,2235277,5170264,2736258,1437708,1121171,19641355,1246368,6069816,533858,568899,14798887,5633828,2618463,10249981,1698648,3711488,2804650,2397789,9727373,10588478,678095,6701288,59393,2256736,1719061,6232346,848487,6601209,129658,2724383,4279777,8895942,4928762,4359903,9736164,13945896,442892,119308,5356068,5466472,2339199,170982,2158,3551074,4098700,7545064,3134551,9034660,2294824,1658192,2723739,1791010,1492760,682546,10897134,2523930,2183435,2678169,3393382,3381385,2929519,5785652,4912411,1629336,3175348,1310355,2426378,4753058,1382045,10383913,751112,3058206,17988705,247472,4960820,4756337,8793050,1783022,3027957,2651314,10345326,2313189"
}