{
  "url": "https://www.bbc.com/somali/articles/c4gw8x9j95ro",
  "title": "Shaambadu timaha ma soo celisaa? Afar khuraafaad oo maanta kadib aad iska iloobi doonto",
  "text": "Xigashada Sawirka, Getty Images\nDhamaanteen waxaan doonaynaa in aan lahaanno timo qurxoon oo caafimaad qaba, qaabab kala duwanna loo hagaajin karo.\nTimo hagaajintu waa suuq weyn oo ku kacaya £5.8 bilyan UK oo kaliya.  Waxaa jira waxyaabaha timaha loogu tala galay oo aan xad lahayn, iyo xayeysiimo baraha bulshada lagu arko, kuwaasoo qofka ka weeciya in uu helo waxyaabaha aasaasiga ah ee uu u baahan yahay.\nRuntu waxay tahay in helitaanka timo caafimaad qaba aysan ku xirnayn lacag badan oo la kharash gareeyo ama in la raaco qaabab adag.  Waa in la helo waxa loo baahan yahay ee sahlan.\nEva Proudman oo ah khabiir baratay caafimaadka timaha iyo maqaarka madaxa, iyo Tracey Walker oo ka tirsan xarun ka shaqaysa caafimaadka maqaarka madaxa iyo timaha, ayaa kashifay afar khuraafaad oo ku saabsan sida aad timahaaga u xanaanaynayso.\nXigashada Sawirka, Getty Images\nWeligaa ma qarqartay adigoo biyo qabow ku mayranaya si aad u hesho Timo iftiimaya?\nHagaag nasiib wanaag waad joojin kartaa inaad taas samayso oo aad ku raaxaysato dhaqid diiran oo raaxo leh sida Proudman ay leedahay biyaha qabow timahaaga kuma daraan wax iftiin dheeraad ah.\nEnd of Ugu akhris badan\n\" Looma baahna in timahaaga lagu dhaqo biyo qabow oo qaboojinaya maadaama aysan waxba qaban\" ayay tiri. \"Waxa aad uga muhiimsan waa sida aad timahaaga uga ilaalin lahayd kiimikada, kulaylka iyo deegaanka aad ku jirto\".\nXigashada Sawirka, Getty Images\nHaddii aad tahay qof rajaynaya inuu hagaajiyo darafyada timaha isagoon booqan timo-jareyaasha, waad ka xumaan doontaa inaad ogaato timo jarista inay tahay xalka kaliya.\nProudman waxay sharxaysaa in halka ay tintu ku dhamaato ama darafka uusan jirin qaab fudud oo lagu hagaajin karo.\nWalker ayaa iyadana leh: \"Haddii aad u malaynayso in timuhu jabayaan oo aad ku eegto mikroskoob, waxay ku dhowdahay inay u ekaato sidii inay jiraan laba ama saddex taako ama biin oo kale oo timaha haya.\n\"Alaabooyinka suuqa ku jira waa sida nooc xabag ah oo timaha mar kale dib u dhigaya si ay u muuqato mid ka sii fiican.\"\nWaxay sheegtay in kuwani ay yihiin hagaajin ku meel gaar ah, waxayna ka digaysaa in aan lagu mashquulin in lacag badan lagu kharash gareeyo alaabada ballan qaadaysa xalka.\nProudman waxay kaloo leedahay sheegashooyinka ah in timaha oo la gooyaa ay ka dhigi karto inay dhaqso u koraan waa been.\n\"Suurtagal ma aha in timahaagu si degdeg ah u koraan, sidaa darteed badeecad kasta oo sheeganaysa in taas awooddo waa been\".\nXigashada Sawirka, Getty Images\nWaxaa laga yaabaa inaad la kulantay dad ku dhaartay inay ku guuleysteen inay timahooda u tababaraan inay \"is-nadiifiyaan\" iyaga oo u ogolaanaya inay si aan caadi ahayn u dhaqdaan ama aysanba u dhaqin.\nLaakiin Proudman waxay leedahay \"samaynta arrintan gabi ahaanba uma roona timahaaga. madaxaagu wuxuu leeyahay 180,000 qanjidhada saliidda ah, waxayna ururiyaan wasakhda iyo qashinka haddii aan si joogto ah loo dhaqin\".\nTimaha oo aan si joogto ah loo dhaqin waxay sababi kartaa ur iyo sidoo kale inay ka sii daraan xaaladaha madaxa sida agoolka, ayay tiri, sababtoo ah \"timaha oo aad ka tagto inay noqdaan kuwo saliid leh waxay u oggolaan kartaa in khamiirka iyo bakteeriyada ay dhismaan, keeneysa xaaladaha madaxa cuncunka\".\nProudman waxa ay ku talinaysaa in aad maydho timahaaga maalin kasta haddii timahaagu ay saliid badan yihiin ama aad ku isticmaasho badeecooyin badan.\nXigashada Sawirka, Getty Images\nIn wakhti loo helo in si buuxda loo dhaqo, ama mishiin lagu shido had iyo jeer maaha mid macquul ah marka inta u dhaxaysa shaqada, jimicsiga iyo qorshayaasha bulshada, qaar badan oo naga mid ah ayaa isticmaala shaambada qallalan si degdeg ah si aan u soo nooleyno xididdada dufanka leh iyo dib u cusboonaysiinta timaha annaga oo aan ku mayranin.\nProudman waxay sheegtay in shaambada qallalan ay \"aad u fiican tahay\", laakiin waa in la isticmaalo hal mar oo keliya inta u dhaxaysa timaha dhaqidda.\nDhibaatadu waxay soo baxdaa markaad isticmaasho maalmo badan oo isku xigta adigoon maydhin.\n\"Saliidda dabiiciga ah ee madaxu waxay ku darsantaa shaambada, khamiirkuna wuxuu quudin doonaa waxa halkaa ka dhalanaya,\" Proudman ayaa sidaa tiri.\n\"Haddii aadan taa ka taxaddarin waxaad yeelan doontaa cuncun iyo maqaarka madaxa oo qolof yeesha\".\nUgu dambayntii taladeedu waxa weeye in aad diirada saarto in aad madaxaaga u ilaaliso si la mid ah sida aad u ilaaliso wejigaaga - ma sii wadi doontid inaad maqaarkaaga mariso dawooyinka la isku qurxiyo adigoo aan meesha ka saarin waxa hoos ku jira oo aan marka hore la dhaqin.",
  "date": "2025-10-23",
  "scraped_at": "2025-11-02T07:31:06.204806+00:00",
  "category": "news",
  "text_hash": "29f7121f40d4bb7260bd781c2a3d7a1d15f44c0c2a06e3ec82555e87eb775c2e",
  "minhash_signature": "6753488,10498107,1141723,11103343,3838594,2610094,8710319,8131621,503259,10043271,422394,2312001,7923360,8080952,4741302,5024934,2336286,9767092,1966631,4638686,12970441,755253,9474786,4436629,1307865,286738,715636,9296591,2045537,8940361,237140,3226225,3336191,2860482,2448289,6112249,2148892,3903231,6224962,30411195,916342,93817,22389,4187035,2558336,16198287,461570,459394,3051448,13658385,4168213,2209103,3934077,5737549,5888680,1058361,6806413,607266,537040,805447,17322077,29521,11053424,811674,211488,6680423,904151,818751,5821171,6472202,4996727,7168179,765007,568959,9525896,21899438,9970073,3493822,7697323,14809131,2900102,768806,638479,3590604,6379421,3667067,19064674,13285244,1780682,3030239,12860023,5969889,2475930,4541140,183775,1917788,5497,12813451,1605493,14179929,6277671,12342115,3873442,2516497,2988937,4990628,17575936,3636719,453063,1302215,1611568,1892443,7365086,1367004,10053513,638380,1787052,2084780,1396195,10403506,3811953,279073,8892394,2964144,6319344,1768110,132181,3062348"
}