{
  "url": "https://www.bbc.com/somali/articles/cx25lj7vevxo",
  "title": "'\"Marka aan gool u dhaliyay Soomaaliya, kalama joogsaneyn dadka isoo wacayay'",
  "text": "Sakariya Cabdi Xasan waxa uu u ciyaarayay naadiga AFC Sudbury ciyaar aan aheyn heerka koowaad markii uu soo wacay taleefoon uusan fileynin. Taleefoonkaas wuxuu ahaa mid loogu sheegayay in uu ka mid noqdo xulka qaranka Soomaaliya.\nSakariya oo loo yaqaan Sak waxa laga keenay Netherland markii uu jiray sideed sano kaddib waxa uu isaga kala gudbay akadeemooyinka Leyton Orient, QPR iyo Tottenham.\nHadda waxa oo u ciyaaraa naadiga Wealdstone, in uu ka mid noqdo xulka qaranka Soomaaliya waxay aheyd wax uusan fileynin.\n\"Ma fileynin in ay suuragal tahay marka la fiiriyo heerka aan ka dheelayay\" ayuu BBC-da u sheegay Zakariya.\nMarkaa wixii ka dambeeyay waxa uu xulka Soomaaliya u dheelay 10 jeer isagoo labo jeer goolal dhaliyay.\nMuddo lix sano ah wax guul ah ma gaarin xulka, waxayna is reereebka koobka adduunka kaga jiraan halka ugu hooseeya. Sakariya rajo fiican ayuu ka qabaa balse waxa sugaya jid dheer.\nEnd of Ugu akhris badan\n\"Toban sano ka hor sidii aan aheyn waa ka fiicannahay, 5-0 ama 6-0 hada noolagama badiyo\" ayuu yiri Sakariya oo intaas ku daray \"Markii aan bilaabay in aan Soomaaliya u safto, hal jeer ayaan sanadkii bixi jirnay balse hadda joogto ayaan u baxnaa\"\nXigashada Sawirka, Getty Images\nSoomaaliya dagaal sokeeyey ayey soo martay, markii ugu dambeysay uu xulkoodu ciyaar gudaha ku martigeliyo dal oo lagu qabtay garoonka kubbadda cagta Muqdisho waxay aheyd sanadkii 1986. Sakariya waxa uu sheegay in halkaas markale lagu dheelo in ay tahay wax aad u weyn.\nHadii aan gurigeena ku dheelno, wax weyn ayey noo tahay\", ayuu yiri Sakariya.\n\"Marka aan si caadi ah u dheelno, waxaa noo yimaada taageerayaal boqol ama labo boqol gaaraya si ay noo taageeraan, waxaana ku dheelnaa Djibouti iyo meelo kale halkii aan gurigeena kula dheeli laheyn\".\n\"Taageerayaal garoonka soo buuxiya oo na taageeraya, waxay ahaan laheyd cajiib\".\nSak waxa uu aaminsan yahay in xulka qaranka Soomaaliya uu meel fiican ka gaari karo ciyaaraha Qaramada Africa ee AFCON.\n\"Waa cadahay in aan u dhaweyn guul, balse waa ka dhabeyn karnaa, tobanka sano ee soo socda, dhabtii waan u soo bixi karnaa,\" ayuu yiri Sakariya oo rajeynaya in uu dhiirogeliyo xirfadlayaal gudaha ka soo baxa.\n\"Kubadda cagta wax weyn ayey ka tahay Soomaaliya\" ayuu yiri Sak.\n\"Wiilasha, gabdhaha iyo qof kasta wuu dheelaa, waana isboortiga ugu weyn Soomaaliya, qof kasta ayaa daawada\".\nMa ahan oo kaliya taageerayaasha jooga dalka. Britain waxaa ku nool jaaliyad balaaran oo Soomaaliyeed, markasta oo uu xulka qaranka dheelayo, Sak wuxuu sheegay in teegeero balaaran ay ka helaan dalka.\n\"Marka aan gool u dhaliyay Soomaaliya, kalama joogsaneyn dadka isoo wacayay, fariimaha ii soo dhacaya waali ayey ahaayeen. Wax la barbardhigo ma lahan jaceylka ay dadka Soomaaliyeed i tusiyeen\"\nAbshir Aadan iyo Andreas Ali waxay labadaba u dheeleen naadiga Phoenix Next Gen oo ah naadi Soomaalidu leedahay oo deggan magaalada Bristol. Labadaba taageerayaal ayey u yihiin Sakariya.\n\"Waa cajiib in aad aragto qof aad isku meel ka soo jeedaan\", ayuu yiri Andreas oo intaas ku daray, \"in aad aragto qof heer caalami gaaray waxay taasi dhiirogelin u tahay jiil soo koraya\".\n\"Aad ayaan ugu faraxsanahay wiilashaas, bulshada oo dhan ayey ka farxiyeen, waqti unbaa naga xiga in ay guuleystaan\".\nHadii naadiga uu sii wanaagsanaado, Abshir waxa uu aaminsan yahay in Soomaali badan oo qurbaha ku nool u ciyaaraan xulka Qaranka Soomaaliya.\n\"Hada dadka ka yimaada dalalka sida Sweden, UK iyo adduunka oo dhan waxay fahmayaan in ay u ciyaari karaan xulka Soomaaliya\".\n\"Toban sano gudahood waxaan arki doonaa ciyaal badan oo Soomaali ah in ay ka ciyaaraan England, waxaana rajeynayaa in Soomaaliya loo dheelo iyo Sak Xassan in ay noqonayan hiigsi\".\nSoomaaliya muddo lix sano ah ciyaar kuma guuleysan balse barbardhacyo badan ayey galeen.\nMid ka mid ah kuwa aadka loo xusuusta waa markii loo soo baxayay koobka adduunka oo ay la dheeleen Guinea. Sak waxa ka horjeeda Serhou Guirassy oo ah weeraryahan u ciyaara Borussia Dortmund.\n\"Saddex gool ayuu ka dhaliyay Barcelona balse hal gool wuu ka dhalin waayay Soomaaliya,\" ayuu yiri Sakariya.\nSoomaaliya waxay rajeyneysaa in ay guulo gaarto ciyaaraha soo socda ee lagu soo baxayo.\n\"Waan jeclaan laheyn in aan guuleysano, balse barbardhac ma ahan natiijo xun\" ayuu yiri Sakariya.",
  "date": "2025-09-06",
  "scraped_at": "2025-11-02T07:55:07.211823+00:00",
  "category": "news",
  "text_hash": "539c4f774b1caf6ab27e2b53a82e993fb77e0f49645958fc2af1be0afd4f30b8",
  "minhash_signature": "2245547,619823,6288947,4473024,3651248,3571275,6186727,3035947,484907,3820921,1156291,6283743,14462148,20719240,13828342,373639,12637555,3521550,5744883,7089062,693391,14314923,9233275,4436629,10807544,206471,19138022,6585853,781488,3674815,1953322,11417628,3310396,2745590,74473,652525,994940,27031365,12504154,16526196,18409083,1705678,21160029,4422480,8099829,656981,3507141,7764323,10209733,6692134,3526258,1099219,8428050,8085109,5386072,1279159,14533391,361260,3852482,3886372,1926012,580480,687927,18991767,13089084,8059216,13609191,5647749,2422698,16869552,613892,10893426,8109075,1333185,1872674,509366,2768695,7256932,16826387,2511099,11661986,4302754,10267688,4597970,1531610,6353547,4476035,76660,10741053,9125254,829528,2733184,1540711,10027658,2152236,468377,16388921,8373214,1492760,1712891,9542717,3684610,14278395,1862631,11023869,989258,4438964,3701301,8623564,3558194,5039665,3233914,510585,4522627,92090,10548301,4780844,14017631,1701718,19490478,9545148,3918031,1538944,3784151,11825196,227509,2724679,11498927"
}