{
  "url": "https://www.bbc.com/somali/articles/cq500d2v3vyo?at_medium=RSS&at_campaign=rss",
  "title": "Dadka daawada mareeg baahisa muuqaalo qaawani ah oo hoos u dhacay '77%' gudaha UK.",
  "text": "Xigashada Sawirka, Getty Images\nPornhub, oo ka mid ah mareegaha ugu daawashada badan caalamka kuwooda faafiay galmada, ayaa sheegtay in tirada dadka soo booqda website-keeda ee UK ay hoos u dhaceen \"77 boqolkiiba\" marka loo eego saddex bilood ka hor.\nHoos u dhaca booqdayaasha ayaa timid kadib markii la hirgaliyay Xeerka Badbaadada onlaynka , kaas oo soo rogaya xaddidaadyo da'da gelitaanka waxyaabaha la xiriira galmada.\nPornhub waxay sheegtay in shabakadaha iska indhatiraya shuruudahan cusub iyo xaddidaadaha la xiriira arrinkaan ay hadda ka faa'iideysanaya xaaladda.\nBBC si madaxbanaan uma xaqiijin karto sheegashadan, laakiin xogta Google ayaa muujinaysa in raadinta magaca website-kaan uu ku dhawaad ​​kala bar hoos u dhacay tan iyo markii sharciga la dhaqan galiyay.\nHoos u dhacan waxaa sabab u ah hoos u dhaca daawashada waxyaabaha xun xun, laakiin suurtagalnimada kale waa adeegsiga VPN-yada si loo galo goobta iyada oo loo marayo habab qarinaya waddanka isticmaalaha.\nSida laga soo xigtay xog ay baahisay shabakadda SimilarWeb, Pornhub waa shabakadda internetka ee ugu booqashada badan adduunka iyo bogga 19-aad ee loogu booqashada badan yahay internetka oo dhan.\nEnd of Ugu akhris badan\nMarka loo eego Xeerka Badbaadada onlaynka, isticmaale kasta oo UK jooga ee raba inuu galo mareegahaas waa inuu caddeeyaa inay ka weyn yihiin 18 sano. Da'daan waxa lagu xaqiijin karaa iyadoo la isticmaalayo tignoolajiyada sida aqoonsiga wejiga.\nWaxa Pornhub ay leedahay waa calaamad kale oo muujinaysa in isticmaaleyaasha UK ay beddeleen habka ay u isticmaalaan internetka tan iyo markii uu sharciga dhaqan galay.\nSida lagu sheegay warbixin ay soo saartay Ofcom, oo ah maamulaha isgaadhsiinta ee Ingiriiska, tirada booqashooyinka bogagga internetka ee akhlaaqda xun ayaa hoos u dhacay saddex meelood meel saddexdii bilood ee ugu dambeeyay.\nSida laga soo xigtay Ofcom, sharcigu wuxuu ku guuleystey inuu gaaro ujeedadiisa ugu weyn, taas oo ah in laga hortago carruurta inay si fudud u helaan waxyaabaha xun xun.\n\"Xeerarkayada cusub waxay soo afjarayaan xilligii da'da internet-ka, halkaasoo goobo badan iyo apps aysan samaynin wax baaritaan ah oo wax ku ool ah si loo hubiyo in carruurta aysan isticmaalin,\" ayay hay'addu ku tiri hadal ay soo saartay.\nOfcom ayaa sidoo kale BBC-da u sheegtay in dadka isticmaala VPN-yada gudaha UK ay gaareen 1.5 milyan maalin kasta bishii Luulyo, balse hadda ay hoos u dhacday illaa hal milyan tan iyo markii sharcigan la dhaqan geliyay.\nDhanka kale, cilmi baaris ay sameysay shirkadda amniga internetka ee CyberNews ayaa muujineysa in ku dhawaad ​​11 milyan oo Apps oo VPN ah lagala soo degay Google Play iyo App Stores gudaha UK sanadka 2025.",
  "date": "2025-10-31",
  "scraped_at": "2025-11-02T07:42:06.467887+00:00",
  "category": "news",
  "text_hash": "63c3dd402ae9e21203d4ad635de10bb8e3d6514b13cf5c4ad989557e1bd86f8b",
  "minhash_signature": "807998,13721723,31001180,19965106,283645,2116455,16665909,3297988,22142877,41435610,6985537,8978590,12396599,611611,10471815,7074468,1501753,342682,21282666,9847103,8008660,9179647,1594751,4436629,10159061,23118772,8718120,5551806,13209737,5388701,7745529,3843889,12126974,4289595,5618227,3350372,32177077,17946640,1218917,16479579,1306829,227081,27666852,1818873,1596655,2262237,10909935,3613350,317203,3665603,8312247,19040965,6007782,11388120,995397,3411431,32092863,809471,9741577,12863969,7353860,3012680,12852227,5833390,7158487,16465292,4377801,5322382,7238279,53214795,106894,19342483,14830466,10759515,8814120,16559835,1343873,5502131,4428665,20306880,3842415,2220625,8844122,12118572,35075963,18768005,27559301,6226352,11396474,9075026,11424737,33985669,4620117,2269668,3155307,794244,34862108,50584279,1492760,970920,15553167,39996966,8002543,54288024,11105580,16928553,11966414,17152936,10985100,28532050,4653487,14679388,9592891,17067371,12742673,210411,2673840,12442481,5029726,55692462,5146429,2899897,2677,1767258,18805174,39139878,1805453,17686576"
}