{
  "url": "https://www.bbc.com/somali/articles/c1dgx16xp70o",
  "title": "Sida qoraal bakhtiyaa-nasiib ah ka dib uu ugu dhammaaday farxad waligeed ah",
  "text": "Donovan Shears, wuxuu fariin qoraala u diray number si bakhtiyaa-nasiib ah sanadkii 1998-dii balse taasi waxay beddeshay noloshiisa.\nWuxuu helay telephonkiisii ugu horreeyey markuu jiray da'ada siddeed iyo tobban jir markaas oo u ogaaday fariimo dirida.\nWuxuu ku nasiib saday number wuxuuna u diray fariin isagoo leh \"hello\" taas oo xaaskiisii mustaqbalka Kirsty ay dib ugu soo qortay \"hi\"\n\"Waqtigaas keli ah wuxuu horseeday in ka badan 20 sano oo jacayl, qosol, iyo iskaashi ah,\" ayay tiri.\nDhowr fariimood oo uu u diray numbaro aanu garayn, wuxuu ka dirayey isagoo jooga Coventry pub, halkaas oo uu ka shaqaynayey habeenkaas, Kirsty oo ku sugnayn Cleethorpes, ayaa ahayd qofka kaliya ee hal mar u soo jawaabtay.\nAfar sano ka dib, lamaanaha ayaa isku guursaday Scotland, halka ay ka soo jeedo Kirsty. Hadda waxay haystaan laba caruura oo da'doodu kala tahay lix iyo sagal sano jir.\nEnd of Ugu akhris badan\nKirsty, waxa ay sheegtay in ay uga jawaabtay fariinta Donovan  iyada oo u malaynaysa in uu yahay qof ay garanaysay, balse nambarkiisa aanay ku kaydsan telefoonkeeda.\nIyagoo la hadlayey BBC CWR, waxay soo xasuusteen sidii ay markii ugu horreysay ugu kulmeen xarunta tareenada ee magaalada Coventry  iyo siday u markii ugu horreysay u yeesheen haasaawahoodii goob lagu caweeyo oo markaas caanka ahayd, Colosseum, oo hadda loo yaqaan The Kasbah.\nDonovan ayaa yiri \"Waxaan bilaabay inay si bakhtiyaa-nasiib ah fariimo u diro. Anigoo tusaya saaxiibaday.\n\"Waxaan soo qaaday afarta number oo ugu horreysa si la mid ah sidaydii  ka dibna saddexda number ee ugu dembaysa sibakhtiyaa-nasiib ah. waxay ahayd ilaa shan ama lix number oo kala duwan, ka dibna kuma firkin wax kale,\"\nKristy ayaa Iyana tiri \"Waxaan fariimo isu diri jirnay maalinta oo dhan ka dibna waxay noqotay mid aad iyo aadu badan ka dibna waxaan go'aansanay in aan taleefoon isku dirno\"\n\"Waxaan isku diri jirnay fariimo si badan, telefoonkayga kharashkiisu wuxuu ka badnaa 250 gani bishii. Waxay u malaynayaa intaasi ay ahay markii aan go'aansaday inaan is wacno\"ayuu hadalkiisa sii raaciyey Donovan.\n\"Dareenku wuxuu bilaabay inuu horumaro, waxayna lahayd lahjad Scottish ah oo aad u qurux badan, taasoo sidoo kale i soo jiidatay.\"\nLabada lamaane ayaa ugu dambeyntii kulmay ilaa lix bilood ka dib markii Donovan uu diray qoraalkii ugu horreeyay.\n\"Waxaan ku iri gabar walaashey ah, waa inaan aado oo aan la kulmo ninkan, waxayna u egtahay, 'Wuxuu noqon karaa qof kasta', waxaanan ku iri, 'Haa, waan ogahay', laakiin waxaan ahaa runtii 18 sano jiro an marnaba ka fekerin wax ku saabsan caawaaqibka,\" ayey tiri Kirsty.\n\"Kaliya waxaan fuulay tareen oo waxaan imid Coventry.\"\nDonovan,wuxuu sheegay inuu ka cabsi qabay inuu talaabada koowaad qaado, laakiin Kirsty aad ayey ugu kalsooni badnayd.\n\"Inta kale waa taariikh\" ayuu yiri\n\"Waxaan xasuustaa markii an ka soo laabtay habeenkeenii koowaad ee bannaanka, kaliya waa is laab galinay, waxay ahayd wax mujiso oo kale ah\"\n\"Waa haweeney cajiib ah, aad ayay u caqli badan tahay, si fiican ayaan isu naqaannaa, waa saaxiibkayga ugu fiican iyo sidoo kale xaaskayga.\"\nIn ka badan 20 sano laga bilaabo maalintoodii weynayd, labada qof ayaa ka qayb qaadan doona cusboonaysiinta nidarka ee Coventry Cathedral ee Maalinta Jacaylka, oo ay soo qabanqaabisay BBC CWR.\nDonovan, wuxuu sheegay inay rajeynayaan inay u dabaaldegaan maalintaas qoys ahaan.\n\"Waxaan wilkeyga u soo qaaday Suud le'eg  shalay, dhab ahaantiina wuuu jeclaaday,ka dibna gabadhayda, waxay leedahay, 'Waxaan rabaa inaan arko hooyaday oo labisan', ma sugi karto,\" ayuu raaciyay.",
  "date": "2025-01-26",
  "scraped_at": "2025-11-02T07:43:06.681116+00:00",
  "category": "news",
  "text_hash": "78e8db9fa1c1f3c78e2f13e3cb54138115f2b692f09fe7c4e452e9a7b256cfa9",
  "minhash_signature": "738738,25369260,129876,1027094,9704126,16638844,1016526,4909165,50698865,725850,2908209,1832541,7986418,10198341,7221883,8991447,1649161,5266189,4646179,467555,1556434,3426969,7470357,12108401,15200664,7258575,16586581,7778848,5936513,5986649,6887085,10299859,18471178,10537177,5426308,16857319,6200058,1728050,2167745,6432345,1733481,2236442,4933996,10375777,11596289,6308267,3375392,8878444,4848575,3717648,11923863,1233666,122793,7041116,970694,4578253,6134379,1192583,4627123,1389641,427737,15106222,7824126,10170677,8650068,999982,5897146,1754010,7429390,11714141,1983052,2473158,2945433,2375048,1313177,7669774,10064257,8204200,11011889,4503021,5827388,2189899,4745292,14061327,1752510,14123851,6716364,20188307,5577016,15180593,14347706,17411096,883023,2370249,12586960,8329859,5036027,8978812,1873066,992063,4938002,7809690,1111862,4378721,13760749,3957559,26177648,1925442,11394830,8875455,52188212,5595615,5771701,12029318,17039951,658133,1681838,3311558,1022363,1063087,8939110,21259993,2611904,6256499,18592164,3349482,3715337,3623474"
}