{
  "url": "https://www.bbc.com/somali/articles/c78x70v2mr2o",
  "title": "Boqorad ku guuldarreysatay inay ninkeeda ka hor istaagto inuu la guursado",
  "text": "Xigashada Sawirka, AFP\nMarwada 1-aad ee boqorka qowmiyadda Zuluga Koonfur Afrika Misuzulu kaZwelithini ayaa ku guuldarreysatay in ay saygeeda ka hor istaagto qorshe uu markii 3-aad ku guursan lahaa.\nBoqorad Ntokozo kaMayisela, ayaa maxkamad ka dacwootay si ay ninkeeda uga joojiso aroos u ugali lahaa todobaadkan dabayaaqadiisa, laakiin maxkamadda ayaa ku gacansayrtay doodeeda, ka dib markii ay qiil ku filan weydey.\nBoqorka ayaa xaaskiisa ku guursadey sharci madani ah ka hor intii aan la caleemo-saarin 2021, waana sababta ay maxkamadda u aaddey, iyada oo ku doodeysa in maadaama guurkoodu ka horreeyey xilka boqortinimada uusan naag kale la guursan karin.\nXaakimka maxkamadda  oo lagu magacaabo Bongani Mngadi ayaa go'aankii uu ku diiddey joojinta guurka cusub ee boqorka wuxuu ku sheegyay in maadama boqoraddu horay u ogolaatay in lala guursado aysan u furneyn dood kale.\nSida laga sheegay maxkamadda horteeda, lammaaneyaasha ayaa sannadkii la soo dhaafay ku heshiiyey in ay guurkooda u beddelaan mid dhaqan, si ay boqorka ugu suurowdo in uu labeysto. Laakiin heshiiskaas ayaa sida la sheegay burey markii boqorku furriin dalbaday, isagoo ku andacoonayo in xiriirkoodu gaarey meel aan laga soo celin karin.\nBoqor Misuzulu, ayaa ku adkeysanaya in uu gar iyo gardarraba guursan doono gabadha uu calmaday oo lagu magacaabo Nomzamo Myeni, taas oo uu sheegay in aad u jecel yahay.\nEnd of Ugu akhris badan\nWaxaa xusid mudan in guurka xaasaska badan uusan Koonfur Afrika dambi ka aha haddii xeerka dhaqanka loo cuskado, sidaas oo ay tahay sharcigu wuxuu dhigayaa in marka ninku rabo in uu gododleeyo looga baahan yahay in uu guurkii madaniga ahaa buriyo ama uu u rogo guur dhaqameed.\nIllaa hadda ma cadda in aroosku u dhici doono sidii qorshuhu ahaa, waxaase soo baxaya warar lagu faafiyey warbaahinta Koonfur Afrika oo tibaaxaya in xafladdii arooska dib u dhac ku yimid sababo aan la shaacin awgood.\nBoqorka Zulugu ma leh awood siyaasadeed oo rasmi ah, doorka boqortooyaduna wuxuu ku kooban yahay magac-u-yaal, laakiin sidaas oo ay tahay wuxuu saameyn xooggan ku leeyahay bulshada dhexdeeda, isagoo sannad walba qaata miisaaniyad ku kacaysa malaayiin doollar.\nDuubka boqornimo ee Misuzulu ayaa indhawaalaba waxaa hareeyey eedo la xiriira kartidiisa hoggaamineed, ku waas oo uga imaanaya bulshada iyo dowladdaba. Waxaana tan iyo markii uu xilka qabtay Oktoobar 2022 uu qaaday tillaabooyin qar-iska-tuur ah oo keenay in mararka qaar muran la geliyo boqrnimadiisa\nMurankan ugu dambeeyey ayaa ku soo beegmay xilli ay taagnaayeen fadeexado hareeyey boqorka tan iyo markii uu xilka qabtay labo sano ka hor.\nDhawaan ayey ahayd markii uu xilka ka eryey labo kaaliye oo aad ugu dhawaa, ku waas oo u uku jirey Ra'isul Wasaarihiisi, taas oo dhiillo ka dhex oogtey golihiisa. Sababtoo ah wallow uu yahay boqorka beesha, haddana ma leh awood u uku qoro ama ku eryo xubnaha guddiga sare ee boqortooyada oo ku yimaada cod loo dhan yahay.\nBoqorka oo lagu xanto in yahay nin damac badan ayaa jagada kula wareegey si lamafilaan ah, ka dib markii aabihiis Goodwill Zwelithini uu kedis ah ugu geeriyoodey cudurka  Covid bishii Maarso 2021. Boqor Goodwill ayaa ahaa boqorkii ugu cimriga dheeraa qowmiyadda Zulu, wuxuuna korsiga boqortooyada ku fadhiyey muddo 50 sano ah, taasina waxay dhabbaha u xaartey in uu talada la wareego wiil aan taajka loo carbin.",
  "date": "2025-01-20",
  "scraped_at": "2025-11-02T07:50:07.345360+00:00",
  "category": "news",
  "text_hash": "8309e0cce18ef27b525d266298c175f6da2347fbd6280a4582f1eb7b080208f4",
  "minhash_signature": "9712849,1851573,2244376,6403973,18453596,4543937,17499904,27898333,2321661,1241414,10030500,7274940,662089,52707093,7565538,5994278,3259352,2928601,2889056,7262850,9289744,13686258,3261968,9693497,35271690,2365697,7201983,4575584,486206,28042817,13402631,182169,20526497,9743202,1245786,10575956,12676785,5628937,12241074,63335143,6565032,21408913,9182207,19256004,5825693,2370038,23631214,15952745,1397164,9152701,429459,1062168,3414387,16978541,13203740,12480870,2529702,1118631,24271757,1094586,3221940,31958107,12974552,1135814,13027010,911600,1905146,6071316,6966622,1171737,1092801,5032849,13065275,1424430,837027,1202725,10002201,9280134,185681,17650085,6847792,12154439,2844315,23048709,1534408,1259915,16210605,1540038,1889362,4184799,754846,13610508,11795642,13571642,1513604,12744256,4784700,28508988,2430326,230613,12250000,8053632,2975258,828640,7002799,15251836,1974722,9586432,4647304,20697631,6774578,3593991,7767305,197838,17195989,7493107,11293778,6399721,11919352,12244657,953807,2870158,6189717,8906015,18427622,14884338,398258,8766148"
}