{
  "url": "https://www.bbc.com/somali/articles/cy9pnvy95gro?at_medium=RSS&at_campaign=rss",
  "title": "Shil argagax leh : sidee ayey kaligeed ugu badbaaday diyaaraad lagu wada dhintay?",
  "text": "Xigashada Sawirka, Annette Herfkens\nAnnette Herfkens, oo ah maalqabeenad u dhalatay dalka Holland ,ayaa fasax dalxiis ah ugu maqnayd dalka Vietnam iyada iyo ninka ay u doonneyd, markii diyaarada ay la socdeen ay ku burburtay duur cidlo ah, halkaasi oo ay ku geeriyoodeen dhammaan dadkii la socday diyaaradda.\nWaxay ahayd sanadkii 1992-dii. Annette Herfkens iyo saaxiibkeed ay u doonneyd, Willem van der Pas, oo loo yaqaannay Pasje, waxay u socdaalayeen xeebta loo dalxiis tego ee ku taala dalka Vietnam.\nAnnette waxay ka shaqaynaysay qaybta maaliyadda ee magaalada Madrid, caasimadda Spain. Waxay xiriir fog la lahayd Passage laga soo bilaabo sanadkii1979-kii, xiligaas waxaa ay ahayd arday saaxiibkeedna, isku fasal ayay dhiganayeen.\nAnnette iyo Pasje ayaa ka soo safrayay magaalada Ho Chi Minh ee dalka Vietnam, waxayna ku sii jeedeen xeebta Nha Trang, markii diyaaradda ay la socdeen wajahday cimilo ad u daran, waxayna ku dul dhacday meel fog, gaar ahaan buuro ceeryaamo qariyay oo kaynta Vietnam ku taala.\nDiyaaradda ayaa si ba'an u burburtay, waxaana ku dhintay 30 qof oo rakaab ah iyo dhammaan shaqaalihii diyaaradda oo u uku jiray ninkii ay Annette u doonneyd oo ay aadka u jeclayd.\nAnnette iyadoo dhawac ah ayay keymo ku noolayd muddo siddeed maalmood ah. Waxa soo gaaray dhaawac oo qeybo kamid ah jirkeeda ah, dhaawacyadaas oo ay aad ula xanuunsatay, xitaa heer ay gaartay inay socon weydo.\nEnd of Ugu akhris badan\nWay fuuq-baxday biyo la'aan darteed. Waxay sidoo kale aad ugu murug saneyd geerida qofkii ay dunida u jeclayd.\nMarkii dambe roob ayaa yimid, oo biyaha roobka ayay ku noolayd. Markii la marayay maalinkii 6-aad, waxay ku dhowaatay dhimasho. Waxay meel fog ka aragtay qof xiran dhar midabkiisu Orange yahay, way qeylisay, way is raaceen oo sidaa ayay kaga baxday keymihii.\nDhibaatadii ay ka martay inay muddo 8 maalmood ah ku noolaato keymaha ayaa markan so oaf-jarmay.\nXigashada Sawirka, Annette Herfkens\nWaxay ahaayeen saaxiibo aad isugu dhow, oo ku noolaa hal guri oo ardaydu degaan. Wax yar ka dib waxay bilaabeen hasaawo. Waxay labadoodaba ogaadeen inay isu qalmaan oo jacalkoodu markan dhab yahay.\nMarkii Pasje uu qorsheeyay fasax dalxiis oo Vietnam ah, waxay wada socdeen 13 sano. Muddo lix bilood ah, labadooduba waxay ka shaqaynayeen wadamo kala duwan. Pasje waxaa uu ka shaqeynayay bangi ku yaala Vietnam, halka Annette ay ganacsi ku lahayd Spain.\nDiyaarada ay saarnaayeen ayaa la qorsheeyay inay ka baxdo magaalada Ho Chi Minh 7-da subaxnimo si ay ugu amba baxdo aagga xeebta ee Vietnam.\nWaxay ahayd diyaarad yar oo nooceedu yahay Yakovlev Yak-40 oo Soofiyeedku sameeyay.\nXigashada Sawirka, Annette Herfkens\nDiyaaradda ayaa dhacday 5 kadib oo ay hawada ku jirtay. Saaxiibkeed oo ay aragto, waxaa ugu dambeysay markii ay diyaaraddu dhaceysay.\nSi tartiib tartiib ah ayay u soo kabsatay, maadaama ay aad ugu naxday geerida ninkii ay u doonneyd.\nAnnete waxay ahayd gabar yar, qeybta maaliyadda Madrid ayay sidoo kale u shaqeyn jirtay, safarkeeduna aad ayuu u badnaa, waxayna inta badan u safri jirtay magaalooyinka iyo London.",
  "date": "2025-10-30",
  "scraped_at": "2025-11-02T07:34:07.500875+00:00",
  "category": "news",
  "text_hash": "6530d65f25376e0865f1fe2361f9e91e6518852f833d878c9de2a171f9b1a98b",
  "minhash_signature": "9112443,26238611,1522269,7985216,17841731,5867441,20853906,12931536,14896551,4694835,4088267,3194265,2802101,21052951,3587242,15377810,32120541,10774366,13653201,6152918,1046135,8530007,567859,24938012,10841755,31175876,9836654,11838509,202920,5655063,15385471,2749343,14328130,664000,1458236,1227750,11186349,3787951,13924671,9804316,6175971,915919,3213517,6521526,21348995,15153194,11916691,6634813,3513017,7360483,8312050,20098260,2760496,2698096,3422927,15391650,6947903,7195205,2347747,5574623,10248849,10644114,14606887,1194619,2497653,6662649,8544462,1501725,7590835,5930309,7114493,14492338,3203929,2741008,625951,14651003,11719426,28866140,5384999,8238183,7449355,8945818,4724319,713424,13701066,4050264,6456217,4783014,5071193,46598,8289096,45934295,6616822,3223781,3290133,8005163,13681720,4901868,18927638,5208810,10727703,9430461,17651011,26464417,2189432,1870823,2056262,15372549,8413495,7537418,1726896,499360,12347178,42437,9558729,1204801,686418,1971371,9808603,19480751,7664956,5653770,4423697,2318608,4831545,10229012,168668,24354523"
}