{
  "url": "https://www.bbc.com/somali/articles/cy6q7jd991qo",
  "title": "M﻿axaad ka taqaannaa Mahad Karate, hoggaamiyaha awoodda badan ee Mareykanku raadinayo?",
  "text": "Xigashada Sawirka, Social Media\nMahad Karate waa mid ka mid ah hoggaamiyeyaasha ugu awoodda badan ee ururka Al-Shabaab oo iyaga iyo dadka deegaanka oo kaashanaya ciidamada dowladda uu dagaal ku dhexmarayo qeyb ka mid ah gobollada Soomaaliya.\nHoggaamiyahan ayaa loo arkaa in uu kaalin weyn ku leeyahay dagaalkaas, oo xooggiisu ka socdo gobolka Hiiraan. Dhowr jeer ayuu ururku soo weeraray gobolkaas toddobaadyadii ugu dambeeyay ka dib markii dadka deegaanka oo is-abaabulay iyo ciidamada dowladda ay ka qabsadeen dhul ballaaran oo muhiim u ahaa kooxdan.\nH﻿addaba, waa kuma hoggaamiyahan, oo maxaynu ka naqaan noloshiisa Shabaab kahor, iyo hadda ba?\nWaa uu magacyo badan yahay, laakiin kan rasmiga ah waa Cabdiraxmaan Maxamed Warsame. Waxa uu caan ku yahay magaca Mahad Karate. Sida ay shaacisay dowladda Mareykanka, waxaa la rumeysan yahay in uu ku dhashay magaalada Xarardheere ee gobolka Mudug.\nWaxa uu dhashay intii u dhaxeysay sanadihii 1957 1962-dii. Waa ku xigeenka hoggaanka ururka Al-shabaab, waxaa na la sheegay inay hoos tagaan qeybta awoodda badan ee sirdoonka kooxdan ee Amniyaadka loo yaqaanno iyo xitaa qeyb ka mid ah maamulka dhaqaalaha ee kooxdan.  Mareykanku waxay sheegeen in uu ku hadlo afafka Soomaali, Carabi iyo Sawaaxili.\nXigashada Sawirka, AP\nKahor Al-Shabaab iyo burburkii doaladdii Soomaaliya, waxa uu Mahad ka tirsanaan jiray sirdoonkii Soomaaliya ee dowladdii kacaanka, sida dad kala duwan oo aqoon u leh Mahad u sheegeen BBC.\nEnd of Ugu akhris badan\nMa ahan isaga oo keliya, laakiin rag kale oo badan oo ka tirsanaan jiray ciidamadii dowladdii Kacaanka ayaa ka hor burburka iyo ka dib ba ku biiray ururrada Islaamiga ee hubeysan ee Soomaaliya.\nKuwoodda ugu magaca dheer waxaa ka mid ah Xasan Daahir Aweys, oo ahaa hoggaamiye sare oo ka tirsanaa ururkii Itixaad oo mar ahaa kan ugu ballaaran, ugu na awoodda weyn ururrada islaamiga ah ee Soomaaliya. Waxaa la rumeysan yahay in uu Mahad ka mid yahay aas-aaseyaasha kooxda Al-Shabaab, laakiin ma ahan nin magaciisa iyo muuqiisu ba ay aad u shaac baxeen billowgii kooxda.\nWaxa uu ku eedeysan yahay in uu door weyn ka qaatay weerarro iyo qaraxyo ay kooxdu ka geysatay dalalka deriska ah oo ay Kenya iyo Ugaandha ka mid yihiin.\nWaxaa ka mid ah weerarkii sanadkii 2015 ka dhacay Jaamacadda magaalada Gaarisa ee gobolka  Waqooyi-Bari Kenya, kaasi oo ay ku dhinteen ku dhawaad 150 qof.\nXigashada Sawirka, Reuters\n‘Shan milyan oo doolar ayaa dulsaaran madaxiisa’\nKadib weerarkii Jaamacadda Gaarisa, dowladda Mareykanka ayaa duldhigtay shan milyan oo doolar madaxa Mahad Karate. Lacagtaas waxaa loo balanqaaday ciddii keenta xog horseedi karta in lasoo qabto ama la dilo.\nSi la mid ah, waxa ay Mareykanku lacag dhan Lix milyan oo doolar ku doonayaan madaxa hoggaamiyeha Al-Shabaab Axmed Diiriye, oo bedelay Axmed Godane oo Mareykanku ku dilay duqeyn 2014-kii. Laakiin Mareykanku weli kuma guuleysan doonistooda. Sidaas oo ay tahay, marar kala duwan ay dowladaha Soomaaliya iyo Kenya shaaciyeen dilka hoggaamiyaha qarsoon, Mahad Karate.\nHorraantii bishan, dowladda Soomaaliya iyo Mareykanka oo iskaashanaya ayaa duqeyn ku dilay Cabdullaahi Nadiir oo lagu tilmaamay in uu ahaa ninka la qorsheynayay inuu la wareego hoggaanka sare ee Al-Shabaab, kadib Axmed Diiriye, hoggaamiyaha xilligan.\nXigashada Sawirka, AFP\n‘Karate iyo Al-Shabaab ka hor’\nSida uu BBC u sheegay, Janaraal Yuusuf Siyaad Indhacadde oo ay isyaqaanayn Mahad Karate Shabaab kahor, waxa uu ninkan ka tirsanaa jiray ururkii hubeysnaa ee Itixaad, oo loo arko halka uu kasoo bilowday saanqaadka xagjirnimo ee badi hoggaamiyeyaasha al-Shabaab.\nUrurkaas ayaa maamulkii ugu horreeyay oo Islaami ah ka hirgeliyay gobolka Gedo kahor inta aysan ciidamada dowladda Itoobiya gudaha usoo gelin gobolkaas bilowgii sagaashanaadkii si ay ula dagaalamaan kooxdan.\nWaxa uu sidoo kale ururkaas oo mar maamuli jiray qeybo ka mid ah deegaannada Puntland halkaas dagaal ku dhexmaray ciidamadii jabhada SSDF ee uu aasaasay madaxweynihii hore ee Puntland iyo Soomaaliya ba Korneel Cabdulaahi Yusuf Axmed.\nWaxa uu Mahad Karate ka qeybgalay dagaaladdii dhexmaray ururkaas iyo jabhadii xilligaas jiray, ee ka dhacay qeybo ka mid ah Soomaaliya.\nK﻿adib burburkii Itixaad, Yusuf Indhacadde iyo dad kale oo kala duwan ayaa BBC u sheegay in uu Mahad Karate u guuray dalka Kenya, isaga oo ku noolaa magaalada Nayroobi.\nIndhacadde waxa intaas ku daray in Mahad Karate uu ka mid ahaa Koox Soomaali ah oo tagay Afghanistan, halkaas oo la rumeysan yahay inay tababar kusoo qaateen. Waxaa kooxdaas ka mid ah ahaa Aadan Xaashi Ceyrow oo ahaa hoggaamiyihii ugu horreeyay ee al-Shabaab, Axmed Godane oo bedelay Ceyrow iyo xubno kale.\nXigashada Sawirka, SOCIAL MEDIA\nMahad Karate iyo Noloshii Nayroobi\nDad kala duwan, oo xog-ogaal ah oo magacyadooda qariyay sababo amni dartood, waxay BBC u sheegeen in Mahad Karate oo ka shaqeyn jiray shirkad lacagaha xawisha in lagu xiray magaalada Nayroobi kahor inta uusan ku biirin al-Shabaab. Waxa uu xarrigaas dhacay kadib weerarkii argagixiso ee Mareykanka lagu qaaday bishii September 2001dii. Waxaa laga soo xiray xaafadda Islii.\n“Waxaa la sheegay in tuhun soo galay. Sidaas ayaa lagu xiray kadibna qareen ayaa loo qabtay, muddo kadib na waa la sii daayay ”, ayuu yiri mid ka mid ah dadka aan la hadlanay, oo si dhow ula socday arrinkan. Siideynta kadib, waxaa la sheegay in Mahad uu tagay Itoobiya halkaas oo uu uga sii gudbay Soomaaliya. Ma jiro dukumeentiyo iyo xog rasmi ah oo dhanka dowladda Kenya ah oo xaqiijinaya ama beeninaya arrinkan.",
  "date": "2022-10-14",
  "scraped_at": "2025-11-02T07:59:07.667562+00:00",
  "category": "news",
  "text_hash": "0f2adc853ad83b5569ab711dfb8c51fc0b590f47a2b2e10a39fb905bfb5ae7c2",
  "minhash_signature": "347385,1212103,2147681,6916072,374660,2758311,6203556,4153390,903323,4194441,9057702,3901088,6069786,3566172,7831123,3245666,1142966,3630222,4960825,1265416,6723976,670344,493005,5750040,2149864,13309,5080583,3509491,576857,10753328,7518102,10016870,872513,1326624,6344945,697401,4878597,6756323,524275,4202107,20714658,858929,1656704,131132,8099829,786674,17942908,4279711,1222676,492060,5932307,8186461,4646073,4330801,12302185,5255990,3022472,15715817,850614,2945745,1139390,8457226,2208150,4695426,781790,514575,950913,4924770,7837536,7318093,8662180,2356508,5842005,1289544,115695,590170,8409733,6899924,2291864,1891575,1731742,2008856,3016825,12552806,3087750,2430187,623112,2763278,9584780,27240581,376708,395161,5291839,3278330,7884027,12402354,2127772,16492388,443240,462300,10003490,26112663,3898353,7773423,5638931,9170496,3113744,11914660,8623564,19498403,992688,15777022,1570370,1235267,9880756,13494,3501562,7414025,7482945,409774,11422834,3127349,11472464,9616211,668486,2522082,5990101,3223884"
}