{
  "url": "https://www.bbc.com/somali/articles/cjel8vg8lqdo",
  "title": "Sagaal shey oo ay dumarku allifeen balse aadan ogeyn",
  "text": "Xigashada Sawirka, Getty Images\nHaddii lagu weydiiyo dadka ugu caansan adduunka ee wax ikhtiraacay waxaa kuguu soo dhacaya shaqsiyaad ay ka mid yihiin Thomas Edison oo sameeyay nalka iyo Alexander Graham Bell oo ah ninka sameeyay taleefoonka.\nMaxaad ka ogtahay haweenka wax allifay sida Mary Anderson ama Ann Tsukamato?Waxaa suuragal ah in aadan aqoon magacyadan, balse haweenkan waxay sameeyeen aalado wax weyn ku kordhiyay seyniska oo aan maalin kasta isticmaalno.\nXigashada Sawirka, HANNAH EACHUS\nKaddib markii ay ku biirtay ciidamada badda Mareykanka dagaalkii labaad ee adduunka, Grace Hopper waxaa loo diray in ay sameyso kombayuuter cusub oo lagu magacaabo Mark1\nWaxay hormuud ka aheyd in barnaamijyo loo sameeyo kombayuuterka sanadkii 1950-kii. Waxay sameysay luuqada kombayuuterka taas oo amarada ka dhigta luuqad uu kombayuuterka uu aqrin karo. Taasi waxay ugu dambeyn noqotay wax weyn oo lagu kordhiyay sida ay kombayuuterada u shaqeeyaan.\nHopper waxay sidoo kale gacan ka geystay erayga sida weyn loo yaqaan ee ah \"de-bugging\"  kaas oo macnihiisu yahay in uu saxo khaladaadka oo ilaa hadda adduunka si weyn looga adeegsado.\nGrace kombayuuterada ayey ka shaqeyneysay ilaa ay shaqada ka fariisato, waxayna noqotay sarkaalkii ugu da'ada weynaa ee ciidamada badda Mareykanka ka shaqeeya. Markii ay shaqada ka fariisaneysay waxay jirtay 79.\nEnd of Ugu akhris badan\nDr Shirley Ann Jackson waa haweeney u dhalatay Mareykanka oo cilmiga fisigiska taqaan. Cilmibaaristii ay sameysay laga soo bilaabo 1970-kii ayaa horseeday in la arko numbarka ku soo wacaya iyo in qofka marka uu taleefoon ku hadlayo uu sugo qofka kale ee soo wacaya.\nHal abuurkeeda isgaarsiinta waxa uu keenay in inta kale ay awood u helaan in ay soo saaraan Fax la qaadi karo, xargaha fibre optic loo yaqaan iyo saxamada cadceeda ku shaqeeya.\nWaxay aheyd haweeneydii ugu horeysay Mareykanka ee shahaadada PhD ka qaadata machadka tiknolojiyada ee Massachusetts iyo sidoo kale waxay noqotay haweeneydii ugu horeysay Mareykanka ee hoggaamisa kooxda ugu sareysa cilmibaarista jaamacada.\nXigashada Sawirka, Hannah Eachus\n1903-dii Mary Anderson oo booqaneysay magaalada New York ayaa dareentay in darawalka uu ku qasban yahay in uu furo daaqadaha si barafka muraayada hore u dhalaalo.\nMarkasta oo daaqada la furo qofka baabuurka saaran wuxuu dareemaa qabow. Markaa kaddib Anderson waxay la timid xal ah cinjir af leh oo muraada ka nadiifya barafka. Sanadkii 1903-dii ayaa lagu abaalmariyay in ay iyadu tahay qofka alifay ee ka faa'idaya aaladaas.\nAnderson marna faa'ido kama helin wixii ay aliftay, xitaa kaddib markii ay noqdeen qalab gaari kasta lagu dhajiyo.\nBatariyada cimrigoodu uu dheeryahay ayaa tamarsiiyay dayaxgacmeedyada loo diro hawada sare. Aad ayeyna muhiim u yihiin.\nOlga D Gonzalez-Sanabria waxay asal ahaan ka soo jeedaa dalka Puerto Rico, waxayna aliftasy farsamadii lagu sameeyay batariyadan sanadkii 1980-kii. Markii dambe waxay maamule ka noqotay xarunta cilmibaarista ee Nasa Glenn.\nCochrane waxay dooneysay mashiin alaabta u dhaqa si ka dhaqsiyo badan qofka shaqaalaha ee u shaqeynayay kaas oo ay adag tahay in uu ciladoobo.\nMashiinka ay sameysay wuxuu ahaa mid sida lugta u wareegaya kaas oo ku xiran matoor wareejiya, wuxuuna noqday mashiinkii ugu horeeyay ee isticmaala biyaha xoogga u tuurmaya.\nCochrane ninkeeda wuxuu ahaa in qamriga aad u caba, wuxuuna kaga dhintay deyn badan oo iyada laga doonayay in ay bixiso, taasna waxay ku dhalisay in wixii ay aliftay 1886-dii in ay ka faa'ido iyadoo sameysatay warshad soo saarta qalabkaas.\nXigashada Sawirka, Hannah Eachus\nMarie Van Brittan Brown oo aheyd kalkaaliso inta badan guriga kaligeed joogi jirtay ayaa la timid fakar ah in ay dareento ammaan iyadoo gurigeeda joogta.\nIyada iyo ninkeeda Albert ayaa sameeyay markii ugu horeysay qalabka ammaanka ee guryaha lagu xiro.\nSababta ku dhalisay in ay qalabkan sameeyaan ayaa ka timid sanadkii 1960-kii xiligaas oo dambiyadu bateen iyadoo booliskuna uu soo daahayay.\nQalabka ay sameeyeen waxa uu ahaa mid adag oo leh kaamero taas oo ku xiran albaabka guriga. Waxayna kala soconayeen shaashad u taalay qolkeeda jiifka taas oo laheyd gambaleel.\nXigashada Sawirka, Hannah Eachus\nTsukamoto wixii ay soo saartay waxay horseedeen in horumar weyn laga gaaro fahamka nidaamka uu u shaqeeyo dhiiga bukaanada qaba Kansarka taas oo keeni karta in laga daaweeyo cudurka.\nSanadkii 1991-dii ayaa Ann Tsukamoto lagu abaalmariyay wixii ay dunida ku soo kordhisay.\nTsukamoto waxay waxay sameysay cilmibaaris kale oo ku saabsan unugyada sida ay u koraan.\nStephanie Kwolek waxay sameysay fibre-ka fudud ee loo isticmaalo jaakadaha xabada celiya iyo qalabka kale ee dagaalka loo xirto.\nIlaa markii ay sameysay 1965-tii, qalabkaas oo ka xoog badan shan jibaar biraha, waxa uu badbaadiyay nolol badan, waxaana si joogto ah u isticmaala militeriga.\nNin lagu magacaabo Charles Darrow ayaa inta badan loo tiriyaa in uu alifay ciyaaraha sida jarta oo kale ah ee looxa lagu dheelo balse sharciyada lagu dheelo ciyaarahaas waxaa aliftay Elizabeth Magie.\nNin lagu magacaabo Charles Darrow ayaa inta badan loo tiriyaa in uu alifay ciyaaraha sida jarta oo kale ah ee looxa lagu dheelo balse sharciyada lagu dheelo ciyaarahaas waxaa aliftay Elizabeth Magie.\nMagie waxay dooneysay in ay soo bandhigto dhibaatooyinka hanti-goosadka iyadoo dadka dheelaya ciyaarta ay wax ku kala gadanayaan lacago aan sax aheyn.",
  "date": "2025-07-19",
  "scraped_at": "2025-11-02T07:54:07.544600+00:00",
  "category": "news",
  "text_hash": "0099b07cb192cd70b38483836b9d4ba034c0ed8b9c871dd8e6421aeba509cd27",
  "minhash_signature": "17105109,501774,10797337,25015774,14964764,6328264,11489096,4648382,1197336,14731766,9372440,4374040,21459476,6207214,727938,5216909,1485936,1380213,9120498,377064,3946842,2787876,3177616,4436629,3137403,6582295,3937769,9535144,335006,44303,6335813,3099039,5145165,2412120,4464259,374328,1226459,5597215,3497660,12302410,14982854,262620,8588460,5405112,11920891,1470623,7560908,1695249,926976,14911292,2024499,499821,1780679,13874932,1657095,2144769,1877717,19265996,2299056,961930,1964458,445805,7886965,1447226,5962382,16452465,3046894,4170397,325646,5168562,18776356,20073531,11020636,672543,78686,3606049,10991092,9819743,4147059,7600270,4344214,1397984,15760924,1411787,11270274,4929413,760739,4657169,5020058,11675932,30843780,9100168,13526046,16416855,5180684,22160923,3696506,2022488,2281609,2223933,11235136,5580227,4545074,16216962,2314220,312422,2174051,3575342,556584,6344826,11772338,187566,11639625,6086722,659421,899793,144036,3525709,1218680,2955948,1557765,2870158,2748834,314306,2507320,1189619,6364709,3983402"
}