{
  "url": "https://www.bbc.com/somali/articles/c7841ly125eo",
  "title": "Kooxda Muqdisho City oo ka hadashay falkii carada dhaliyay ee qaar ka mid ah taageeryaasheeda kula kaceen calanka Kenya",
  "text": "Xigashada Sawirka, MOGADISHU FC\nQaar ka mid ah dadka Kenyaanka ee isticmaala baraha bulshada ayaa caro ka muujiyay ka dib markii Garoonka Nyayo lagu arkay koox dhalinyaro ah oo ku tumanaysa calanka Kenya, xilli ay ciyaar ka socotay.\nDhalinyaradan oo la sheegay in ay ahaayeen Soomaali ayaa la arkayay iyaga oo mid ka mid ah uu ku joogsanayo calanka dalka Kenya.\nSabtidii, kooxda kubadda cagta ee Booliiska Kenya ayaa garoonka Nyayo kula ciyaartay kooxda Muqdisho City Club kulan ka tirsan isreeb-reebka koobka horyaallada qaaradda Afrika ee CAF.\nXigashada Sawirka, Muqdisho city club\nKooxda Muqdisho City Club ayaa sheegtay in aad uga xun yihiin falka ay ku kaceen dhalinyaradaasi sheegay in ay taageersanayeen kooxdooda.\nGuddoomiyaha Muqdisho City Club Abuukar Maxamed Sheekh oo BBC la hadlay ayaa xusay in ay falkaasi u arkaan mid aad u xun islamarkna ay raaligalin ka bixinayan.\nAbuukar ayaa farta ku fiiqay in markii uu muuqaalka soo baxay ay aad uga xumaadeen dhacdadaasi.\nEnd of Ugu akhris badan\n\"Waan ka xumahay dhacdadii ka dhacday garoonka Nyanyo oo ahayd in dhalinyaro Soomaaliyeed ay ku istaaeen calanka Kenya, waxaana ka aragnay oo kali ah baraha bulshada markii aan muuqaalka aragnay-na aad ayaan uga xumaannay annagoo ah maamulka kooxda,\" ayuu yiri Abuukar.\n\"Wixii dhacay haddii aan nahay dhammaan umadda Soomaaliyeed waan ka xunnahay raalligalin buuxda ayaan ka bixinaynaa gaar ahaan kooxda Muqdisho City Club waxay raaligalin buuxda siinaysaa kooxda Kenya booliis iyo guud ahaan shacab waynha Kenya dhacdadi ka dhacday garoonka Nyayo waxaan leenahay waan ka xunahay raaligalin buuxdana waan ka bixinaynaa,\" ayuu yiri Abuukar\nXigashada Sawirka, MOGADISHU FC\nGuddoomiyaha  ayaa sheegay in aysan jirin wax xiriir ah oo ay la soo sameeyeen xiriirka kubadda cagta ee Caf islamarkaana dhacdadaasi ay ahayd mid si lama filaan ah u dhacday.\n\"Wax xiriir ah nalama soo sameynin Caf anagana lama sameynin. Dhacdadaasi dhacdo lama filaan ayay ahayd qof fileysay ma jirin, taageerayaashana waa iska xamaasadeysan yihiin waana dhalinyaro aad u da'yar ilaa haddana cid nagala hadashay majirtay haddii ay ahaan lahay Caf ama dowladda Kenya\" ayuu intaa ku daray.\nAbuukar ayaa dhanka kale ugu baaqay in ciyaaraha soo socda looga baahan yahay taageerayaasha in ay u dhaqmaan si xeerka kubaddu yahay islamarkaana ay taageeradooda ku muujiyaan sacab iyo sawaxan, balse aysan ku kicin fal ka baxsan anshaxa.\n\"Waxaan ugu baaqayaa dhammaan taageerayaasha Muqdisho City Club meel kasta oo ay adduunyada ka joogaan in ay muujiyaan wanaag, qalbi wanaag iyo akhlaakh, ciyaaruhu waa is dhex-gal waa dad is jecel ma aha naceyb,\" ayuu yiri.\nKooxda Booliiska Kenya ayaa ciyaartii dhacday Sabtidii  3-1 uga badisay kooxda Muqdisho City Club oo ka timid Soomaaliya.\nCiyaaraha imika ka socda Kenya ayaa ah kulamo ka tirsan isreeb-reebka koobka horyaallada qaaradda Afrika ee CAF.\nCAF Champions League, horayna u ahaan jiray Koobka Kooxaha Horyaallada Afrika, waa tartan kubbadda cagta ah oo sannadle ah oo uu qabto xiriirka kubbadda cagta Afrika ee CAF, waxaana ku tartamaya kooxaha heerka koowaad ee Afrika, iyadoo lagu go'aamin doono tartanka.\nNaadiyada Masar ayaa heysta tirada ugu badan ee guulo (19 koob), waxaa ku soo xiga Morocco oo leh 7, sidoo kale Masar ayaa leh tirada ugu badan ee kooxaha ku guuleystay, iyadoo afar naadi ay qaadeen horyaalka. Tartankan ayaa waxaa ku guuleystay 26 kooxood oo 12 ka mid ah ay ku guuleysteen in ka badan hal jeer.\nXigashada Sawirka, HonMosiria/X\nMadaxa deegaanka ee Ismaamulka Nairobi Geoffrey Mosiria ayaa cambaareeyay falkii ay ku kaceen taageereyaasha Soomaalida ah.\nIsagoo ka hadlayay muuqaal lagu wadaagay barta uu ku leeyahay X, Mosiria waxa uu muujiyay niyad jab weyn, isaga oo ku tilmaamay falkaas mid ixtiraam darro ah oo lagu hayo Kenya iyo dadkeeda.\nWuxuu xusay \"in kubbada cagtu ay tahay ciyaar midaysa, haddana taageerayaashu waa inay ixtiraamaan astaanta qaranka, gaar ahaan marka lagu martigeliyo waddan shisheeye.\"\n\"Waxaa jira waxyaabo aad u sahashan karto kaftan, laakiin waa inaad ixtiraamtaa calanka Kenya, garoonka Nyayo, waxaan ku arkay qaar ka mid ah taageerayaasha Gen Z, qaar ka yimid wadamada deriska ah, oo ku tumanaya calanka Kenya oo xitaa u adeegsanaya siyaabo lagu wiiqayo, taasi waa xushmad la'aan astaan ​​qaran oo ka tarjumaysa midnimadeenna shacab ahaan,\" ayuu yiri.\nWaxaa kale oo uu sheegay in midabbada calanku ay leeyihiin macno weyn ayna tahay in la sharfo, ee aan lagu jeesjeesin.\nXigashada Sawirka, SOCIAL\nSharciga Kenya ayaa ilaalinaya calanka qaranka sida uu qabo xeerka calanka, astaanta iyo magacyada (Cap. 99).\nDastuurku (Qodobka 9aad) waxa uu u aqoonsan yahay calanka in uu yahay astaan ​​qaran, balse dembi kama dhigayo fal-dambiyeedka sida ku tumashada calanka.\nCap. 99, si kastaba ha ahaatee, wuxuu dembi ka dhigayaa \"aflagaaddo, jeexjeexid ama ixtiraam darro\" lagula kaco calanka ama calaamad kasta oo qaran.\nDembiileyaasha ayaa wajahaya ganaax aan ka badnayn Sh5,000 ama xaqig aan ka badnayn lix bilood, ama labada oo la isugu daro.",
  "date": "2025-09-23",
  "scraped_at": "2025-11-02T07:19:05.405688+00:00",
  "category": "news",
  "text_hash": "afa3bbd5b4c7a0513bb6694bd570963c779c8364f58620f4d21b021e66e59d46",
  "minhash_signature": "6187852,4044197,2147681,882483,2700870,2169488,22376281,49438,5110364,3275972,5450447,4010237,572254,582758,9479378,5010802,6252625,4674485,1780478,3593338,1315719,2929944,4955368,2778819,3521999,6859786,10422483,2347575,9962425,2005974,1252203,77238,5871632,4605682,3015969,5655461,6568104,5596375,6376383,2917138,716521,345293,1491791,6638867,4279138,5319194,4570318,20916572,7607713,5024424,5993012,1014690,3035961,2557254,20798054,1426072,1410990,1200570,9967463,10749053,227649,21439501,20572344,10114366,13719082,4856291,2278421,20404664,10290131,10446053,98670,4929096,6683475,1553289,3560258,3717689,833114,1768542,10578985,4750479,5373375,15780300,4175754,4936320,2026413,6721289,3860482,24048864,6219389,3711971,1048581,5343238,15393426,6284214,6247613,915564,856282,4065990,1492760,4730961,1260008,6335057,272755,3377384,16267041,3174220,48142,10659010,3437643,8194532,6008374,6511756,231968,5580700,5125344,3660436,2474818,507237,10020028,1066670,3308937,8975441,7495414,2613930,4785408,3211363,9172485,310301"
}