{
  "url": "https://www.bbc.com/somali/articles/cly939n178xo",
  "title": "Waa kuma Raila Odinga, hoggaamiyihii mucaaradka Kenya ee geeriyooday?",
  "text": "Xigashada Sawirka, Reuters\nRa'iisul Wasaarihii hore ee Kenya Raila Odinga ayaa ku geeriyooday dalka Hindiya isaga oo ay da'diisu tahay 80 sano.\nRaila ayaa geeriyooday xilli lagu daweynayay isbitaal ku yaalla Hindiya, sida laga soo xigtay ilo qoys.\nOdinga, ayaa ifka kaga tagay xaas iyo saddex caruur ah.\nRaila Amolo Odinga (wuxuu dhashay 7 Janaayo 1945)\nRaila Odinga wuxuu ku dhashay Isbitaalka Maseno Church Missionary Society Hospital, ee Maseno, Degmada Kisumu, ee Gobolka Nyanza 7 Janaayo 1945. Sidoo kale taageerayaashiisu waxayu yaqaaniin Agwambo, waa siyaasi Kenyan caan ka ahaa muddo dheer.\nRaila oo ahaa 80 jir ayaa lagu xasuusan doonaa doorkii uu ka qaatay dib u soo celinta dimuqraadiyadda xisbiyada badan iyo ilaalinta xuquuqda aadanaha ee Kenya.\nEnd of Ugu akhris badan\nWuxuu ahaa Ra'iisul Wasaarihii ugu dambeeyay ee Kenya, Waxaa la doortay 2008, waxa uuna hogaaminayay dawlad wadaag ah 2008 ilaa 2013.\nXigashada Sawirka, AFP/GETTY\nRaila Odinga waxa uu ahaa nin aad uga soo dhex muuqday siyaasadda Kenya iyo Afrika, isaga oo dhiirri galiyay jiil dhan oo qaaradda ah.\nWaxaa uu dhawaan u tartamay xilka gudoomiyaha midowga Afrika oo markii dambe uu ku guuleystay Maxamuud Cali Yuusuf oo ah hadda ah gudoomiyaha midowga Afrika.\nOdinga ayaa shan jeer ku guul darreystay tartanka madaxwaynanimada  Kenya, waxaana ugu dambeysay doorashadii 2022-ka.\nRaila waxaa dhalay madaxweyne ku xigeenkii koobaad ee dalka Kenya, Jaramogi Oginga Odinga.\nIn ka badan 20 sano ayuu xildhibaan ka ahaa xaafadda isku raranta ah ee ugu wayn Afrika ee Kibera.\nMr Odinga waxa uu leeyahay dad aad u jecel, taageerayaashiisuna waxay ku naanaysi jireen \"Baba\" (Aabbaha), \"Agwambo\"  iyo \"Tinga\" (Cagaf) - oo laga soo minguuriyay astaantii xisbigiisa ee doorashadii 1997-kii.\nWaxa uu dib uga soo noqday dalka dibaddiisa ka dib markii ay dib u yagleeleen siyaasadda xisbiyada badan ka hor inta aan loo dooran xildhibaan. Waxa uu door muhiim ah ka ciyaaray soo afjaridda tobanaan sano oo xukunkii xisbiga Kanu ka dib markii uu taageeray Mwai Kibaki oo u tartamayey madaxtinimada 2002dii.\nMarkii ugu horraysay ee uu madaxweynenimo isku dayay waxay ahayd 1997-kii, markaas oo uu galay kaalinta saddexaad.\nOdinga iyo taaageereyaashiisu waxay rumaysan yihiin in laga boobay guushii uu gaaray 2007-dii, markaas oo uu hogaaminayay xisbiga ODM, isaga oo la tartamay Kibaki.\nDoorashadaas ayaana ahayd middii horseedday rabshadihii qabaa'ilka ku salaysnaa ee sababay in ay dhintaan 1,300 oo ruux, ayna ku baro kaceen 600,000.\nXigashada Sawirka, AFP\nWuxuu soo noqday ra'iisul wasaarihii ugu horreeyay ee Kenya, jagadaas oo la abuuray kaddib heshiiskii qaran ee lagu gaaray in la soo afjaro rabshadihii ka dhashay doorashadii 2007-2008, halkaasoo uu dowlad awood qeysi ah uu la dhistay madaxweyne Mwai Kibaki.\nMr Odinga ayaa ah siyaasi caan ku ah dhisidda isbahaysiyada siyaasadda.\nWaxa uu hore u ahaa maxbuus siyaasadeed, waxana uu haystaa rikoorka in uu yahay maxbuuskii ugu muddada dheeraa ee Kenya. Halgankii uu kaga soo horjeeday kalitalisnimada hal xisbi waxa la xiray laba jeer (laga bilaabo 1982 ilaa 1988 iyo 1989 ilaa 1991) intii lagu jiray xukunkii Daniel Arap Moi.\nKadib isku day afgambi oo dhacay kowdii Agoosto ee sanadkii 1982 dii, Raila Odinga waa la xiray waxaana ku dhacay xukunno kala duwan, oo ay ka mid tahay khaa'inul waddannimo oo ah tii loo xiray iyada oo an cadeyn loo hayn.\nGuddiga dib u heshiisiinta iyo cadaaladda dhabta ah ayaa loo sheegay sanadkii 2011 in Odinga uu xariir la lahaa maskaxdii ka dambeysay afgambiga. Odinga mar walba wuu iska diidaa in uu ku lug lahaa afgambiga.\nWaxa uu xirnaa lix sano ka dib markii lagu eedeeyay in uu ku lug lahaa isku daygii afgambi ee 1982-kii, ka dibna mar kale ayaa loo xiray in uu dabada ka riixayo dimoqraadiyad hoos timaada xukunka hal xisbi.",
  "date": "2025-10-15",
  "scraped_at": "2025-11-02T07:27:05.761613+00:00",
  "category": "news",
  "text_hash": "4bdb19fd126ff25a534360fb36b140370bdc841a2c09a90ea8c4d8876a14f65d",
  "minhash_signature": "1601351,20639015,16512379,774370,2478618,14239041,2510378,9760737,3966871,4654051,2357238,637657,2472779,1527237,3494043,1100624,8612212,10774366,3779146,6320346,1991854,2201934,2623630,4565357,36868268,4165458,2960429,34767811,8611214,4839376,10180750,7793402,7414410,4288782,8921410,16276864,12333680,2820412,899403,3175453,6155751,38735864,8369690,13142025,118124,3938675,1406767,5800846,317203,23648615,464913,16683233,6518493,8237146,3364599,9587049,10786584,847300,10223313,5604777,4423078,4495839,15718941,17354743,1262907,1180061,1394607,5582603,778508,9111978,1696064,3089610,293361,16805314,17882958,7231659,6532334,14147160,3913645,3501303,966969,1454270,4450639,999969,9050703,12733841,12614222,4601132,2977499,1638173,2702250,528144,370661,194087,14309372,8116896,9935128,11662337,1227304,4247534,935821,580593,33375090,2787500,640641,2965879,5464116,4849185,1918524,8264880,444848,2231780,1604640,10000258,2260651,7622930,268885,1185210,5060406,15995563,2442449,36238,9093619,7267555,1941164,2646577,4280972,4657579"
}