{
  "url": "https://www.bbc.com/somali/articles/cq83kzpzd2wo",
  "title": "Maxaan ka naqaannaa Mufti Xaaji Cumar Idriis, wadaadka ay geeridiisu gilgishay Itoobiya?",
  "text": "Xigashada Sawirka, FANA\nMagaalada Addis Ababa ee dalka Itoobiya waxaa ku geeriyooday Mufti Xaaji Cumar Idiriis oo ahaa madaxweynihii hore ee golaha Arrimaha Islaamaka Itoobiya, islamrkaana ahaa caalim si weyn looga yaqaanno dalkaasi.\nGeerida wadaadka ayaa timi kaddib in muddo ah  uu xanuun la jiifay sida lagu sheegay war-qoraal ah oo lagu baahiya bar uu golahaasi ku leeyahay internet-ka.\nMarxuun Xaaji Cumar ayey si weyn u tabiyeen geeridiisa warbaahinta dowladda Itoobiya iyadoo madaxda dalkaasi ay ka tacsiyeeyeen geeridiisa.\nMadaxweynaha dalka Itoobiya Taye Atsek Selassie, ayaa qoraal uu soo dhigay bartiisa X, sheegay in caalim Xaaji Cumar lagu xasuusan doono \"waxqabadkiisii wanaagsanaa\"\nRa'iisul Wasaaraha Itoobiya Abiy Axmed oo ka tacisyeeyey geerida marxuunk ayaa ku tilmaay inuu wax badan qabtay intii uu hoggaaminayey Golaha Arrimaha Islaamka ee Itoobiya \"Mar walba waxaan xasuusan doonaa waxqabadka Haji Umer intii uu hogaaminayay golaha, gaar ahaan isku soo dhoweynta dhinacyada kala duwan iyo sidii uu u ansixiyay Shuurada Sare ee Arrimaha Islaamka.\" Ayuu yiri Abiy.\nSheekh Haji Ibraahim Tufa, madaxweynaha Golaha Sare ee Arrimaha Islaamka ee Itoobiya, ayaa ku tilmaamay in Xaaji Cumar Idris uu  noloshiisa oo dhan ugu huray barashada diinta, adeegga ruuxiga ah, iyo dadaallada uu ugu jiray midnimada Muslimiinta.\nEnd of Ugu akhris badan\nSida la mid ah madaxda Itoobiya culimada diimaha kale ee dalkaas ayaa ka tacsiyey iyagoo ku tilmaamay inuu ahaa shaqsi ummadda oo dhan u adeegi jiray.\nXigashada Sawirka, FANA\nSheekh Cumar Idriis waxa lagu  xasuustaa erayo la falgalay hab-nololeedka dadka Itoobiyaanka oo ay ugu mudan yihiin kuwo uu kaga hadli jiray is caawinta iyo midnimada.\n\"In aad qof caawiso, waxa kaaga filan in uu qof yahay\" waa mid ka mid ah hal-ku-dhegyada uu ka tagay wadaadkan geeriyooday.\nOraahdaas caanka baxday oo marar badan lagu adeegsaday fagaarayaal kala duwan waxa uu sheekhu ula jeeday in caawimaaddu aanay ku xidhnayn diin, dhaqan, aragti iyo aamminaad kale oo qof la caawinayaa uu ramaysan yahay.\nHadalladaas waxay sidoo kale hadal qabsi u noqday qaar ka mida madaxda Itoobiya oo marka ay khudbadaha jeediyaan adeegsada hadallada uu horrey u yiri Caalim Cumar.\n\"Shacabka Itoobiya ma kala garanayaan qowmiyadda iyo diinta, laakiin siyaasiyiinta ayaa kala qaybsan.\" Xaaji Cumar Idiris\nXigashada Sawirka, SOCIAL\nSida uu BBC-da u sheegay Sheekh Junayd Xamse, guddoomiye ku-xigeenka  Golaha Sare ee Arrimaha Islaamka Itoobiya, oo aqoon u lahaa Muftiga ayaa ku tilmaamay nin kaalin weyn u lahaa arrimah horumarinta Islaamka ee dalka Itoobiya.\n\"Wuxuu runtii ka mid ahaa culimadii waaweynaa ee dalka, wuxuu muddo ka mid ahaa mu'asaaska dalka, wuxuu dadaal badan galiyey xalaqaadka cilmiga \"\nXaaji Cumar ayaa soo noqday madaxweynaha majliska culimada, golahi fatwada, isagoo sanadkii 2019-kiina loo doortay madaxweynaha Golaha Arrimaha Islaamka Itoobiya oo muddo soo hayey xilkaas.\nSida Junaydi xusay Xaaji Cumar ayaa ka mid ahaa guddi uu Ra'iisul Wasaaraha Itoobiya dhisay oo samaysay dadaallo badan oo ku saasanaa isbaddelkii arrimah islaamka ee dalkaasi iyo dhismaha shuruuc iyo xeerar.\n\"Golaha arrimaha Islaamku wuxuu iska ahaa hay'ad laysan sharci kolba loo cusboonaysiiyo lixdii bilood ama sanadkii, laakiin intii joogay ayuu baarlamaanka dalku ay fadhiisten golahana u ansixiyey hay'ad qaanuuni ah oo sharci ah\"ayuu BBC-da u sheegay Junaydi.\nMufti Xaaji Cumar Idris, ayaa noqday Muftigii ugu horreeyeey oo Ra'iisul Wasaare Abiy Axmed guddoonsiiyo shahaado Sharaf Dr, ah oo ay siisay jaamacad Addis Ababa sanadkii 2011-kii\nMufti, Xaaji Cumar Idriis ayaa ku caan ahaa inuu dadka ugu yeero in la is caawiyo, midnimada la ilaashado lagana shaqeeyo samalka.\nSida uu BBC-da u sheegay Sheekh Junayd Xamse, guddoomiye ku-xigeenka  Golaha Sare ee Arrimaha Islaamka Itoobiya, marxuunka ayaa la tilmaamaa inuu  ku dhashay deegaanka Jineto, oo ka tirsan maamulka Amxaarada ee dalka Itoobiya.\nMuddadadii dheerayd ee ka shaqaynayey cilmiga diinigaa iyo hoggaaminta goloyaal kala duwan oo Islaamka Itoobiya mufti Cumar Idriis ayaa kasbaday in dadka Itoobiyaanku jecladaan hadalladisii u badnaa is kaalmeynta iyo isku duubnimada.",
  "date": "2025-10-20",
  "scraped_at": "2025-11-02T08:00:07.562207+00:00",
  "category": "news",
  "text_hash": "2cad7ccae9521e34a24d9d275c431292f785a041efa2b899bac0d5b65d3cf335",
  "minhash_signature": "12139804,5257326,2147681,12062948,1102227,378372,10738103,6286335,1045122,4080253,37006217,5564862,5930506,11957284,5853897,11604399,15928456,4770858,9033016,4938769,1002078,9100553,2792684,2137324,5243419,26355128,20220574,12307415,1916563,351455,12407885,1716405,7584333,2420681,68496,13213969,26506685,18632847,1090215,12165604,16111605,20094196,616185,755307,2905469,4892736,4867142,1168202,3860907,5701135,2689814,1189729,4328065,211855,14202851,14632578,11472582,52457663,7585403,7353426,2147937,9597218,5080193,13786185,1246920,9787954,5276430,3235649,440037,6239304,6477986,862021,1041954,2012167,6939579,11318281,8229706,32953126,2031643,9436387,8565763,4628869,9612587,475783,1747422,876426,13847320,7271228,15781973,21434660,879411,8387284,8584869,7782277,1227122,484016,13185176,2011015,1492760,4415858,2799680,160610,9606613,14009795,8415734,3514299,15746671,14264420,1444185,3234254,2641075,2920885,5459727,8605831,5676644,5152761,3528372,381538,3746773,4519595,1281483,9232222,4021963,2731233,6623475,544796,605915,2655148"
}