{"url": "https://www.bbc.com/somali/articles/ckkrxrvr977o", "title": "Daawo: Xal ma noqon karaa howlgal militari oo ay Israa'iil ku qaaddo Gaza?", "text": "End of Ugu akhris badan", "date": "2023-10-18", "scraped_at": "2025-11-02T07:12:06.157162+00:00", "category": "news", "text_hash": "e99724db988bbf79cc2cf2cb87462c72cd9438e8c94662ad132a5546934864f8", "minhash_signature": "590423101,225549837,1358711249,1305802652,1096828000,1101176913,307520631,1808316038,1069953685,94186960,599186810,554705533,344072148,125455273,1144828114,259496667,835491798,10774366,248542714,192354309,566334503,1018056389,1043562977,1828994060,377967423,301276238,1220034153,1329076634,920660964,132609289,304193632,63720068,1134019418,759365114,184168917,464971550,260381339,557137118,658568650,383455633,126845195,3037416948,121602235,838585226,2367109902,3484463052,504403822,2465259716,2020152565,426663197,279110807,1645687870,311975989,125256285,1864559652,932249590,360844682,2554564383,113065523,599514037,1274945438,462277147,339293925,765486621,699431134,355333267,2246789629,460522482,677039394,1662383694,146927425,114367534,14953688,1571072496,1527002802,300341640,1006863054,1356935220,379105086,712189090,2185743305,418167770,1041117631,715706791,1066717887,876707032,762312208,1609876699,731723504,1377055379,144532034,479424952,2189914935,2402961417,1019686823,657467031,269006423,369808177,2118055750,1509331982,1284694429,817548507,1082850889,113936613,57866124,1344645652,133600992,870196651,1136837706,91780336,705735734,518314358,181411183,1910144220,265728472,271041610,320474235,386487574,109411105,246288050,367272034,1948829866,1619297715,174752160,2178371421,1531631883,660896960,1146094694"}
{"url": "https://www.bbc.com/somali/articles/cew4kpeqnz2o", "title": "Cabsida laga qabo garaadka macmalka (AI) ee caqliga badan oo cirka isku shareertay ayadoo lagu baaqayo in la joojiyo", "text": "Xigashada Sawirka, Getty Images\nSida ay qortay wakaaladda Wararka ee Reuters  koox ay ka mid yihiin shaqsiyaad caan ka ah warbaahinta midigta fog ee Mareykanka sida Steve Bannon iyo Glenn Beck ayaa saxiixay bayaaan ku baaqaya in la joojiyo horumarinta garaadka macmalka ah ee aadka u garaad sareeya (superintelligent AI) ilaa iyo inta dadweynuhu si cad u dalbanayaan, isla markaana cilmigu u sameeyo waddo ammaan ah oo la raaco, sida ay sheegayaan ururada aan macaash doonka ahayn ee abaabulay hindisahan.\nQorshahan, oo sidoo kale ay saxiixeen hal-abuurayaal teknoolojiyadeed sida Geoffrey Hinton iyo Yoshua Bengio, waxaa soo diyaariyey Machadka Future of Life Institute, kaasoo in ka badan toban sano ka shaqeynayay wacyigelinta khatarta ay sheegayaan in ay Garaadka macmalka ahi u leeyahay aadanaha.\nMachadkan oo la aasaasay 2014, waxaa si hore u taageeray maamulaha guud ee Tesla, Elon Musk, iyo barnaamij-yaqaan/maalgashade teknoolojiyeed Jaan Tallinn.\nDad badan oo ka tirsan warshadaha teknoolojiyadda iyo dowladda Mareykanka ayaa ka soo horjeeda hakinta noocan ah, iyagoo ku doodaya in cabashadani tahay mid aan sal lahayn oo caqabad ku ah hal-abuurka iyo kobaca dhaqaale.\nXigashada Sawirka, Getty Images\nSi kastaba ha ahaatee, taageerada ay muujinayaan shaqsiyaad sida Bannon waxay muujin kartaa kororka walaaca laga qabo AI-da ee ka dhex jirta dadka garabka midigta ah, xilli dad badan oo xidhiidh la leh Silicon Valley ay xilal muhiim ah ka hayaan maamulka Madaxweyne Donald Trump ee xisbiga Jamhuuriga.\nSteve Bannon iyo Glenn Beck kama aysan jawaabin dalab ku aadan in ay faalo ka dhiibtaan arrintaan. Dad kale oo saxiixay bayaanka waxaa ka mid ah Steve Wozniak, oo ka mid ahaa aasaasayaashii shirkadda Apple, Madaxweynihii hore ee Ireland Mary Robinson, iyo aasaasaha Virgin Group Richard Branson, sida uu sheegay machadka.\nEnd of Ugu akhris badan\nDhanka kale sida uu qoray warsidaha The Guardian ee kasoo baxa dalka Ingiriiska Harry iyo Meghan, ayaa ku biiray hal-abuurayaasha hormuudka u ah ka hortagga Garaadka macmalka ee xeeldheeraha (superintelligent AI).\nHarry iyo Meghan waxay ka mid yihiin dadka saxiixay bayaanka ku baaqaya in \"la mamnuuco horumarinta garaadkan macmalka ah ee tayadiisu sarayso.\"  Habkaan oo loo yaqaanno (ASI) ayaa ah nidaamyo AI ah oo aan weli la horumarin, kuwaasoo la filayo inay ka sare mari doonaan aadanaha dhanka garaadka iyo shaqooyinka maskaxeed oo dhan.\nBishii Luulyo, Mark Zuckerberg, oo ah maamulaha guud ee Meta shirkadda hooyada u ah Facebook kana mid ah hormuudka horumarinta AI-ga ee  dalka Mareykanka ayaa sheegay in horumarinta garaadka macmalka ah ee xeesha dheer (superintelligence) ay \"hadda muuqato oo la arki karo.\"\nSi kastaba ha ahaatee, qaar ka mid ah khubarada ayaa sheegay in hadalka la xidhiidha ASI (Artificial Superintelligence) uu yahay mid ka tarjumaya tartanka u dhexeeya shirkadaha teknoolojiyadda ee sanadkan oo keliya ku bixiyay boqolaal bilyan oo doollar horumarinta AI, halkii uu ka ahaa horumar dhab ah oo la gaaray dhanka farsamada.\nXigashada Sawirka, Reuters\nFLI (Future of Life Institute) ayaa soo saartay codeyn qaran oo Mareykanka laga sameeyay, taasoo muujisay in ku dhowaad saddex-meelood laba (¾) dadweynaha Mareykanka ay doonayaan in si adag loo xakameeyo horumarinta AI-ga casriga ah. Lix qof oo ka mid ah tobankii la wareystay ayaa aaminsan in AI ka ka sarreeya garaadka aadanaha aan la samaynin ilaa laga caddeeyo inuu yahay mid ammaan ah oo  la xakameyn karo.\nSahaminta oo lagu wareystay 2,000 oo qof oo waaweyn oo Mareykan ah ayaa sidoo kale muujisay in kaliya 5% ay taageersan yihiin sida ay hadda wax u socdaan oo ah in si xawli leh oo aan xakameysnayn loo sii horumariyo AI-ga.", "date": "2025-10-22", "scraped_at": "2025-11-02T07:13:05.195109+00:00", "category": "news", "text_hash": "89b199d67edaa974c4e683724df98870d1b0380d160c196c33276b75b216a0e3", "minhash_signature": "9627572,17437564,5262930,722194,259976,3849739,3927035,13576654,5144632,12347629,490075,1652974,8761954,900886,1425722,977854,1840098,2071683,10389077,6062655,13851223,3501607,9869162,4436629,209615,11321496,2716838,27696074,1351823,4032591,11590687,4520975,1099990,608781,9218914,2510263,6649850,5259113,5937404,466453,1437476,687729,5686214,666679,4547467,4892736,2485647,1116809,7276634,5241689,8692533,3314293,15244621,539592,2121838,5063289,11498618,10405097,1175858,10249981,3701339,1514126,7608082,13226089,7230447,9080103,4971772,11472693,8192443,28231491,542836,1627580,14953688,8041406,3972483,2021094,2994126,1843970,13786069,11200101,3932457,1132743,2127277,8365238,1176071,3513156,2831064,9023027,7845983,23193639,24754996,5980459,3680875,9961850,3836776,8256507,132539,6582396,1492760,10501398,651865,2435270,19056908,2387112,1980004,10828018,201589,3922122,19362030,22722821,2793136,5554563,7988770,1028065,8437286,1069999,22685416,217286,15214769,3100845,4555058,3423680,7937827,30065,23191515,25608464,81448,6590003"}
{"url": "https://www.bbc.com/somali/articles/czdrr010r9jo", "title": "Waa tuma Saamiya Xasan, madaxweynaha mar kale loo doortay Tanzania?", "text": "Xigashada Sawirka, Photothek via Getty Images)\nMadaxweynaha Tanzania, Samia Suluhu Hassan ayaa guul weyn ka gaadhay doorashadii dalkaasi iyadoo heshay ku dhawaad 98% codadka, sida ay subaxnimadii maanta oo Sabti ah ku dhawaaqeen guddiga doorashooyinku.\n\"Waxaan halkan kaga dhawaaqayaa in Samia Suluhu Xasan loo doortay Madaxweynaha Tanzania iyada oo ka socota xisbiga CCM,\" ayuu yiri Guddoomiyaha Guddiga Doorashooyinka, Jacobs Mwambegele, isagoo ka hadlaya telefishinka qaranka.\nGuddoomiyaha INEC, Jacobs Mwambegele, ayaa sheegay in Samia Suluhu Hassan ay ku guuleysatay oo ay heshay 31,913,866 codod oo ka mid ah 32,678,844 codod oo la dhiibtay.\nNatiijooyinkan ay ku dhawaaqday INEC waxay siinayaan Suluhu awood buuxda oo ay ku maamusho muddo shan sano ah.\nXigashada Sawirka, .\nSaamiya Suluhu Xasan oo 65 jir ah waxay ahayd madaxweyne ku xigeenka Tanzania tan iyo 2015-kii, waxayna xilka madaxtinnimada la wareegtay ka dib markii uu dhintay madaxweynihii dalkaas, John Pombe Magufuli sanadkii 2021.\nWaxay noqotay haweeneydii ugu horreysay ee qabata xilka ugu sarreeya ee Tanzania. Sidoo kale waxay noqotay madaxweynihii labaad ee Tanzania ee ka soo jeeda Zanzibar.\nEnd of Ugu akhris badan\nMadaxweynihii ka soo jeeday Zanzibar ee xilka kaga horreeyay wuxuu ahaa Cali Xasan Mwinyi, kaas oo dalkaa hoggaaminayay muddo 10 sano ah - 1985 illaa 1995.\nWaana markii ugu horreysay oo Tanzania uu ka dhintay madaxweyne xilka hayay, laguna beddelay madaxweyne ku xigeenka.\nXigashada Sawirka, Getty Images\nSannadkii 2015-kii, xilligii ololihii doorashada, kooxdii ay Saamiya Suluhu Xasan ay hor keceysay ee xisbiga CCM, waxaa lagu soo bandhigay heeso ay qaadeen fannaaniin caan ah. Waxay u tartameysay xilka madaxweyne ku xigeenka.\nMarkii hore dad badan ayaa kaga baqayay dumar ahaan iyo sida haweenka loo xushmeeyo - balse si ay ugu muuqato qof dadka u dhow, waxay ka dalbatay in ay hal magac ugu yeeraan - waxay ahayd Hooyo ama Mama.\nMarkaa wixii ka dambeeyay, ololeheedii doorasho wuxuu noqday mid dad badan soo jiitay - si ka duwan musharrixiintii kale ee ka soo horjeeday.\nDad badan oo reer Tanzania ah, magaca Saamiya Suluhu Xasan, wuxuu u noqday mid ay aad u garanayaan ka dib markii loo magacaabay in ay u tartanto xilka madaxweyne ku xigeenka, sannadkii 2014-kii.\nXilligii Tanzania ay hirgelineysay dastuurka cusub - ka dib markii la dhammeeyay latashigii dadwaynaha - Mama Saamiya waxaa loo xilsaaray meelmarintiisa ee dhanka golaha Baarlamaanka.\nMaaddaama Baarlamaanka si toos ah uu telefishinnada shacabka ugala hadlaayay - oo dad badan oo reer Tanzania ah u hamuun qabeen in ay helaan xog dhameystiran - Saamiya wejigeeda wuxuu noqday mid dastuurka ku lamaanan, waxaana meeshaas ka soo muuqatay awooddeeda hoggaamin.\nTaa waxay ahayd muuqaalkii shacabka ay ka haysteen. Sidoo kale gudaha baarlamaanka waxaa looga arkayay in ay tahay qof deggan, xitaa marka ay doodo kulul jireen.\nKa dib waxay hanatay xilka guddoomye ku xigeenkii xisbiga talada haya, maadaama uu sidaa dhigayo sharciga xisbiga, ayna ahayd qofka ugu firfircoonaa ee ka soo jeedo Zanzibar.\nSikastaba, dad badan ma aysan fileynin in madaxweynihii isbedel doonka ahaa ee geeriypooday, John Magufuli, uu Saamiya ka dhigto madaxweyne ku xigeen, sannadkii 2015-kii.\nIn kastoo khibrad 15 sano oo heer wasiir ah ay lahayd, baarlamaanka na ay ka mid ahayd, haddana dad badan ma aysan u arkeynin in Magufuli uu xulan doono iyada.\nMarkii xisbiga talada haya ee CCM uu doorashada ku guuleystay, sannadkii 2015-kii - taa oo ahayd middii ugu adkeyd ee xisbigaas uu galay - Saamiya waxay dhigtay taariikh cusub, waxayna noqotay madaxweyne ku xigeenkii ugu horreeyay ee dumar ah ee Tanzania yeelatay.\nXigashada Sawirka, FACEBOOK\nSaamiya waxay seygeeda, Hafidh Amiir, is guursadeen sannadkii 1978, waxayna isu dhaleen afar canug.\nWiilkeeda ugu caansan Wanu, waa xubin ka tirsan baarlamaanka Tanzania.\nSaamiya waxay Maamulka iyo Maareynta ka kala baratay Jaamacadaha Manchester ee Britain iyo Mzumbe oo ku taalla Tanzania.\nMarkii ugu horeysay ee dowladda ay u shaqeysay waxay ahayd sannadkii 1977, ka dib sare ayey u sii kacday, waxayna noqotay Sarkaal dhanka qorsheynta qaabilsan, muddadii u dhexeysay 1987 illaa 1988.\nSidoo kale, waxay noqonay Madaxa Barnaamijyada Hay'adda Cuntada Adduunka (WFP) ee Zanzibar, 1998 illaa 1999.", "date": "2025-11-01", "scraped_at": "2025-11-02T07:14:05.589789+00:00", "category": "news", "text_hash": "81ea98ff3ab1a319cc9a2d9b802e9a25bef5ff0092fe2e4627feabed7f4e61d9", "minhash_signature": "1119842,764810,2841417,7347511,3423257,8240857,3690418,5119088,22474941,42445965,2062701,30425887,1040845,10744196,13116562,1412202,119613,629986,4140402,15225689,5703836,8298790,9561667,4436629,2250616,9180401,23385151,5647429,7622293,2299413,2780624,7858893,1316653,1834901,5221845,717524,6468964,5597215,1392040,2687334,13233275,6749878,1911682,1832574,5694973,1956066,4062791,18918090,2306818,758546,5290641,2660199,5710219,7667944,1332756,13314302,8152502,17378979,3486355,1676858,8890228,13364714,4545245,7175999,3071084,8961530,4971772,1714434,8004083,7435400,6916661,3106861,8562671,24554121,15650350,3529860,2994126,21975984,2522218,9820163,791477,809472,10954073,3723347,14130,1497037,58771,970746,819426,14669719,78295,10074407,793195,739866,26486807,11568435,10004566,5879794,1227304,8041442,1037886,928253,4154878,5876214,5794473,149241,5954065,6522464,7192285,15723863,567861,2696837,2824842,2215815,8132101,2868311,15867402,4832086,7404030,9619630,8009540,201463,12259584,3010239,2125646,3609808,208854,1943850"}
{"url": "https://www.bbc.com/somali/articles/c24l7e72dzgo", "title": "Sanae Takaichi: Waa tuma \"Haweeneyda Birta ah\" ee raysal wasaaraha ka noqotay Japan?", "text": "Xigashada Sawirka, Getty Images\nSanae Takaichi ayaa baarlamaanka Japan wuxuu u doortay ra'iisul wasaare, iyadoo noqonaysa haweeneydii ugu horreysay ee xilkaas qabata.\nHaweeneydan 64-jirka ah ayaa ku guuleystay aqlabiyad muuqata Isniintii – 237 cod ayay ka heshay Aqalka Hoose ee awoodda badan iyo 125 kale oo cod oo ay ka heshay Aqalka Sare – iyadoo noqotay hoggaamiyaha xisbiga talada haya ee Liberal Democratic Party (LDP).\nIyadoo ah muxaafid aad u adag oo aad ula dhacsan ra'iisul wasaarihii hore ee Ingiriiska Margaret Thatcher, Takaichi ayaa la wareegaysa xilka xilli dhaqaale oo adag iyadoo Japan ay la daalaa dhacayso kor u kaca qiimaha nolosha iyo dadweynaha niyad jabsan.\nIn kasta oo ay afar nin ka adkaatay si ay ugu guulaysato tartanka LDP horraantii bishii Oktoobar, haddana waddadii ay u mari lahayd shaqada ugu sarreysa ayaa u muuqatay in la xannibay markii xisbiga LDP ee muddada dheer ay wada shaqaynayeen isbahaysiga, xisbiga Komeito, uu kala laabtay taageeradii.\nLaakiin heshiis daqiiqaddii u dambeyay habeennimadii Isniinta ay la gashay xisbi kale oo mucaarid ah ayaa badbaadiyay. Iyada iyo LDP waxay wajihi doonaan codbixiyaasha 2028ka soo socda.\nXigashada Sawirka, SOCIAL\nWaa Ra'iisul Wasaarihii afaraad keliya muddada shantii sano ee la soo dhaafay, ka dib markii kuwii iyada ka horreeyay ay muddo xileedkooda lasoo afjaray iyadoo ay la degeen fadeexado.\nEnd of Ugu akhris badan\nWaa wasiir hore oo dowladeed iyo baraamij sameeye telefishin, sidoo kalena mar bay ka ahayd durbaan-tumeyaal koox heesa muusigga culus.\nHadda waxay wajahayaan caqabadda ah inay hoggaamiso kaliya xisbi la tacaalaya sidii uu kalsoonida codbixiyeyaasha u soo ceshan lahaa kaddib fadeexado iyo khilaafyo midig-fog ah – balse sidoo kale waddan wajahaya heerka dhalashada carruurta oo aad u hooseeya iyo xiisado siyaasadeed oo sii kordhaya oo caalamka ah.\nSanae Takaichi waxay ku dhalatay gobolka Nara sanadkii 1961. Aabbaheed wuxuu ahaa shaqaale xafiis, halka hooyadeedna ay ahayd askari booliis. Siyaasaddu aad bay uga fogeyd nolosheedii ay kusoo kortay.\nMar ay ahayd durbaanle aad u xiiseysa muusigga loo yaqaan \"heavy metal\", waxay caan ku ahayd inay sidato ulo fara badan, maaddaama ay uluhu jebi jireen inta lagu guda jiro tumidda durbaanka si xoog leh.\nSidoo kale, waxay ahayd quuse-badeed iyo  qof jecel baabuurta– gaarigeedii ay aadka u jeclayd ee Toyota Supra hadda waxaa lagu soo bandhigay matxafka Nara.\nKahor inta aysan gelin siyaasadda, Sanae Takaichi waxay si kooban uga shaqeysay soo jeediso barnaamij telefishin.\nHimiladeeda siyaasadeed ee Sanae Takaichi, waxay soo bilaabatay 1980-meeyadii, xilliga uu xumaaday xiriirka ganacsi ee u dhexeeyay Mareykanka iyo Japan. Iyadoo go'aan ku gaartay inay fahanto sida Mareykanku u arko Japan, waxay ka shaqeysay xafiiska haweeneydii dimuqraaddiga ahayd ee Patricia Schroeder, oo ahayd xildhibaanad si weyn uga hadasha dhaliilihii ay u jeedisay Japan.\nTakaichi waxay aragtay Maraykanka oo isku dhex geynaya luqadaha iyo cuntooyinka Japan, Shiinaha, iyo Kuuriyada, iyadoo arkaysay sida Jabbaan badanaa loola xiriiriyo Shiinaha iyo Kuuriyada Koonfureed.\n\"Haddii Japan aysan is difaaci karin, masiirkeedu mar walba wuxuu noqon doonaa mid ku tiirsan ra'yiga aan qotodheerayn ee Maraykanka,\" ayay ku soo gabagabeysay.\nXigashada Sawirka, Getty Images\nWaxay u tartantay doorashadii baarlamaanka ee ugu horreysay sanadkii 1992 iyada oo madax-bannaan ahayd, balse ma aysan guuleysan.\nDadaal badan oo ay samaysan, sanad ka dib ayey ku guuleysatay kursi, waxayna ku biirtay Xisbiga LDP sanadkii 1996. Tan iyo markaas, waxay ku guuleysatay inay noqoto xildhibaan 10 jeer, hal mar oo keliya ayaa laga adkaaday, waxayna dhistay sumcad ka mid ah codadka muxaafidka ah ee xisbiga.\nWaxay sidoo kale soo qabatay  xilal sare oo dowladeed, oo ay ku jiraan wasiirka badqabdka dhaqaalaha, wasiirka dowlad-goboleedka ee ganacsiga iyo warshadaha, iyo xilka wasiirka arrimaha gudaha iyo isgaarsiinta oo ay muddo rikoor ah soo qabatay.\nSanadkii 2021, Takaichi waxay markii ugu horreysay  tartan u gashay hoggaaminta  xibiga LDP, balse way ku guuldaraysata, waxaana ka guulaystay Fumio Kishida. Waxay mar kale isku dayday sanadkii 2024, markaas waxay hogaamisay wareegga koowaad ee codbixinta, balse ugu dambeyn way guuldaraystay  iyadoo Shigeru Ishiba uu kaga guuleystay.\nSanadkan oo ahaa isku deygeedii saddexaad, ayey xaqiijisay guusha, tan ayaa iyada dabcan ka dhigaysa inay noqoto haweeynadii ugu horreysay ee Ra'iisul Wasaare ka noqota dalka Japan kadib markii uu barlamaanku meelmariyay magacaabiddeeda.\n\"Hadafkaygu waa inaan noqdo Haweeneyda Birta ah,\" ayay u sheegtay koox carruur ah oo iskuul ah intii ay ololaheeda dhowaa socday.\nTakaichi waa haweeney si adag uga soo horjeedda fikirka casriga ah, waxayna muddo dheer ka soo horjeedday sharciga u oggolaanaya dumarka guursaday inay magacooda hooyo sii haystaan, iyadoo ku adkaysanaysa in taasi dhaqanka dhaawacayso. Sidoo kale, waxay ka soo horjeeddaa guurka dadka isku jinsiga ah.\nSi kastaba dhawaan ayey muujisay dabac intii lagu guda jiray ololaheeda waxay ballanqaadday inay khidmadaha ilaaliyaha carruurta ka dhigi doonto qayb ahaan mid canshuurta laga dhimo, sidoo kalena soo jeedisay in shirkadaha bixiya adeegyada daryeelka carruurta ee gudaha loo sameeyo dhimista canshuurta.\nXigashada Sawirka, Bloomberg via Getty Images\nQoyskeeda iyo waaya-aragnimadeeda shaqsiyadeed waxay xoojinayaan hindiseheeda siyaasadeed: ballaarinta adeegyada isbitaallada ee caafimaadka haweenka, siinta shaqaalaha taageerada qoyska aqoonsi weyn, iyo hagaajinta doorashooyinka daryeelka bulshada gabowga ee Japan.\n\"Anigu si shaqsi ah waxaan mar saddex jeer nolosheyda soo noqday kalkaaliso iyo daryeel bixiso,\" ayay tiiri.\n\"Taasi waa sababta go'aankaygu uu uga sii adkaaday sidii loo yarayn lahaa tirada dadka qasbanaaday inay shaqadooda ka tagaan sababo la xiriira daryeelka, tarbiyadda carruurta, ama carruurta oo diida inay iskuulka aadaan.\"\n\"Waxaan rabaa inaan abuuro bulsho aysan dadku iska dhiibin xirfadahooda.\"\nXigashada Sawirka, Getty Images\nTan iyo markii la asaasay xisbiga LDP, sanadkii 1955-tii, wuxuu xukumayey siyaasadda Japan, laakiin hadda wuxuu dhumiyey taageeradiisa, iyadoo ay sabab u tahay niyad-jabka ka dhashay dhaqaalaha gaabiska ah, hoos u dhaca tirada dadka, iyo xanaaqa bulshada.\nTakaichi waxay ka tirsan tahay dhinaca midig ee LDP, doorashadeeda LDP waxay rajeynaysaa inay ku soo ceshato cod-bixiyayaasha xagjirka ah ee u jeestay xisbiga Sanseito ee midigta fog.\nXisbiga Sanseito, oo ku tartamaya hal-ku-dhegga \"Jabbaan Marka Hore,\" ayaa dhawaan ka soo kacday hal kursi ilaa 15 kursi, iyagoo ka jiiday cod-bixiyayaasha xagjirka ah. LDP waxay lumisay inta badan kuraasta labada aqal ee baarlamaanka.\nTakaichi lafteeda ayaa qirtay dhibaatada khudbad ay jeedisay ka dib markii ay ku guuleysatay wareegga koowaad ee codbixinta: \"Waxaan si gaar ah uga helnay dhaleeceyn adag taageerayaasheena asaaska ah, xagjiriinta, iyo xubnaha xisbiga.\"\n\"LDP waa inay isbedeshaa danta Jabbaan ee hadda iyo mustaqbalka. Mar walba waxaan horay u dhigeynaa danaha qaranka waxaanan maamuli doonnaa dalka iyadoo la ilaalinayo dheelitirnaan.\"", "date": "2025-10-21", "scraped_at": "2025-11-02T07:15:05.383419+00:00", "category": "news", "text_hash": "0fced819d8ef99bb32d688a6aef2aa9da08c69f3174513a61527f9bf62028ba4", "minhash_signature": "3462105,6441728,9917805,4492304,3201435,2142890,1806497,5551946,2144830,20181094,3019282,653683,9289538,2687749,9358532,4501466,3722802,4337241,1020892,3984719,692113,46833,3760464,4436629,9340216,27642918,4795570,3291175,2995661,538548,6958181,4678731,3023875,8107578,6293391,7773643,1970066,2820412,3275588,140861,3774772,317314,495068,726122,1274520,5195918,17313880,7307794,4081249,10662252,5502835,654850,4869352,6620645,2272582,1033153,1597893,2525894,1429468,10271167,721687,1789291,2098208,5122119,732862,4701272,10230522,5537199,760267,2225471,1996031,211554,307809,1858749,2084606,331581,14213397,14605134,2004977,9695325,960440,1833445,5006446,7158501,6615958,6101490,422700,93710,7286183,619186,14354115,5060466,2448468,1637043,317736,2046670,5223962,1165427,1492760,20313,50577,3976487,12677196,263064,4893994,4873585,2536508,1142311,10619,3181617,3087797,3560565,12272773,4137779,820037,3226547,1236303,58715,6235640,4777135,209199,14158216,15903162,431331,1928421,6390172,1212322,5275679"}
{"url": "https://www.bbc.com/somali/articles/c98np5j70wro", "title": "Muxuu tababaraha Liverpool ka yiri qaab-ciyaareedka Maxamed Saalax?", "text": "Xigashada Sawirka, Getty Images\nTababaraha Kooxda Liverpool Anel Slot ayaa sheegay in waxa ugu dambeeya ee uu ka welweli karo ay tahay qaab ciyaareedka Maxamed Saalax. Waxa uu ahaa Saalax gool dhaliyaha ugu sarreeya xilli ciyaareedkii hore isaga oo dhaliyay 29 gool, isla markaana sameeyay caawinta 18 goor, taasi oo kooxdu ku qaaday horyaalka Premier League.\nXilli ciyaareedkan ayaa 33 sano jirka reer Masar uu dhaliyay saddex gool oo kali horyaalka Premier League.\nLiverpool ayaa weeraryahanno cusub kusoo iibsatay £415 milyan, iyada oo haatan weli wajahaysa guul darrooyin ugu bilowday xilli ciyaareedkan cusub.\nKa dib afar guul darro oo isku xigta oo ay ku jirto Manchester United ee Axaddii hore ka dhacday Anfield, Slot ayaa kursiga kaydka fariisiyay Saalax kulankii ay 5 iyo 1 uga baddiyeen kooxda Eintracht Frankfurt ciyaar ka tirsan horyaalka Champions league Arbacadii.\nMar wax laga weydiiyay qaab ciyaareedka Saalax ayuu Slot ku jawaabay ''Waxa ugu muhiimsan waa inuu mar walba goolal dhaliyo. Shayga ugu dambeeya ee aan ka welwelsanahay waa in Mo mar kale uu goolal dhalinayo. Wuxuu taasi sameeyay noloshiisa oo dhan, waxaan filayaa inuu dib u bilaabi doono toddobaadyada iyo bilaha soo socda.''\nSlot ayaa kulankaasi soo safay saxiixyada cusub ee kooxda Alexander Isak, Hugo Ekitike iyo Florian Wirtz, balse dhaawac muruqa ah oo gaaray Isak qaybtii hore ayaa Saalax siinaysa in mar kale lagu celiyo safka hore ee kooxda marka ay Liverpool ay Premier League ku wajahdo kooxda Brentford Sabtida.\nEnd of Ugu akhris badan\nSaalax ayaa hadda lix kulan oo xiriir ah Premier League aan dhalin gool aan rigoore ahayn.\nSlot ayaa yiri ''Ciyaartooyda kubbada cagta mararka qaar waa ay seegaan fursadaha- isaguna waa bini'aadam. Kaliya ma aynu nihin kuwo caadeystay inay arkaan Saalax oo gool seegaya.''\nTababaraha Liverpool ayaa intaas ku daray in isbeddelladii xagaaga oo ay ku jiraan tagitaanka Trent Alexander-Arnold ee Real Madrid ay sababi karaan hoos u dhaca qaab ciyaareedkiisa. ''Waxaa laga yaabaa inuu saamayn ku yeesho (maqnaanshaha Alexander-Arnold) sababta oo ah wuxuu Liverpool oo dhan la ciyaaray isaga, laakiin weli wuxuu sameeyay iskudayada meelo uu goolal ka dhalin karo.'' Ayuu yiri Slot.\n''Guud ahaan, isbeddellada kooxda ka dhacay waxa ay keeneen xagaaga in dhammaan ciyaartooyda ay mar kale is fahmaan. Waxaa suutagal ah in taasi ay qayb ka tahay.''\nXigashada Sawirka, Getty Images\nWakhtigan oo kale xilli ciyaareedkii hore waxa uu Saalax lahaa 7 gool iyo 7 caawin ah, halka xilli ciyaareedkan uu leeyahay 3 gool iyo 3 caawin ah oo kaliya.\nGuulaystihii sannadkii hore ee kabta dahabka Premier league ayaa haatan 8 gool ka hooseeya goolasha weerar yahanka Manchester City Erling Haaland.\nCiyaartooyda ay isku kooxda yihiin Cody Gakpo iyo Ekitike ayaa labaduba dhaliyay  goolal ka badan kuwa Saalax, in kasta oo uu hoggaanka kaga hayo labadooda marka dhanka caawinta la eego.\nWaxaan war xun u ahayn Saalax in uu abuuray 19 fursadood oo gool ku dhallan karay xilli ciyaareedkan oo ka yar labo kuwii uu abuuray 12kii kulan ee xilli ciyaareedkii hore, wuxuu bixiyay baasyo isdaba joog ah oo furan in ka badan intii hore.\nWaxaa kale oo muuqata in ciyaartooyda Liverpool ay ku dhibtoonayaan inay kubadda gaarsiiyaan Saalax sidii hore, iyada oo taabashadiisa kubbada celcelis ahaan aad u yaraatay.\nXilli ciyaareedkan wuxuu celcelis ahaan sameeyay 6.2 taabasho ee gudaha sanduuqa goolka, halka xilli ciyaareedkii hore uu ahaa 9.6, wuxuuna sameeyay 1.6 gooysmo ah oo kaliya, in ka yar kala bar tiradii hore.\nSababta ayaa noqon karta daafacyada oo si dhow u ciyaaraya, isku dhacyada ciyaartooyda cusub ama wakhtiga sameynta kubbada, laakiin xaqiiqdu waa inuu celcelis ahaan dhamaystiray kali ah 0.3 gooysmo ah kulan kasta, taas oo muujinaysa hoos u dhaca muuqda.\nIn kasta oo 12 kulan xilli ciyaareedkan aysan ahayn tiro weyn oo lagu cabbiro, haddana Saalax weligii ma yeelan xilli uu celcelis ahaan leeyahay tiro yar oo toogasho ah iyo goolal aan ahayn rigoore sida xilli ciyaareedkan.\nSaxiixyada cusub ee Liverpool iyo qaabka cusub ee ciyaarta ayaa sidoo kale saamayn ku yeelan kara iyo tagitaankii Trent Alexander-Arnold.\nLabadooda xiriirkii xoogganaa ee dhanka midigta ay ka wada ciyaarayeen ayaa ahaa mid aad u guulaystay. Xilli ciyaareedkii hore Alexnder-Arnold wuxuu Saalax siiyay 147 baas, taas oo ahayd 39 baas in ka badan ciyaartooy kasta oo Premier League ah.\nTirakoobka Opta ayaa muujinaya in 33dii kulan ee ay labadooduba wada ciyaareen xilli ciyaareedkii hore Saalax uu dhaliyay 27 gool, celcelis ahaan 3.5 toogasho oo goolka ah, halka taabashadiisa Sanduuqa goollka ay ahayd 10.5.\nKulamada 12ka ee uusan ciyaarin Arnold tan iyo xilli ciyaareedkii hore iyo kan hadda. Saalax waxa uu dhaliyay 4 gool oo kali ah, laba kamid ahna waa rigoore, isaga o oleh celcelis ahaan 2.3 toogash iyo 7.2 taabasho guud ahan sanduuqa.", "date": "2025-10-25", "scraped_at": "2025-11-02T07:16:05.495093+00:00", "category": "news", "text_hash": "e5de5fb9010f909416d6f4d33fb1b9c2ceb550c8a0e54f20d09bf6ebb0717505", "minhash_signature": "7058401,13181095,19703593,11497344,177913,1439576,783212,4979672,1035390,6554291,1334726,6018549,7671267,9417170,1984733,8973774,4758217,4966421,28748256,8125519,2901358,3268464,4082095,3273063,7480057,6577230,93358,4808262,13076280,2175422,18232551,9658822,334373,16852408,1823951,1325495,7973724,786429,411369,2300016,7200795,4902962,9561761,2177596,3208559,3465751,949232,4840885,4669086,3660964,576752,222498,2243191,956061,512906,1359414,6969977,8242811,565660,5162662,4379569,1987018,6605000,6731638,3723348,4410370,8437529,6529204,11605852,1396561,5182014,10608564,1206571,2401655,15192114,2472549,2994126,2273631,14629417,18477497,14650480,437414,1427337,3026429,9715808,1877014,1420862,2780630,4210529,683793,4221786,9377462,13165795,9706104,8984424,5359588,2259323,6582396,725210,13863447,892398,5963305,5481334,5909261,950449,3253093,1783027,1523470,1555594,5841554,2299445,13767211,5879817,3752285,4440238,1858515,610914,192368,751369,3474604,10765356,5373885,18508129,1077119,1578972,2703937,635452,2555223"}
{"url": "https://www.bbc.com/somali/articles/cqjejvlv1klo", "title": "Waa tuma Fartuun Cumar, fannaanaddii hore ee Mareykanka ku geeriyootay?", "text": "Xigashada Sawirka, SOCIAL\nAlle ha u naxariistee waxaa dalka Mareykanka ku geeriyootay fannaanad hore Fartuun Cumar.\nFartuun ayaa muddooyinkii dambe ku xanuunsaneed dalkaas, halkaas oo ay xalay ku geeriyootay, sida ay shaaciyeen ehelkeeda iyo fannaaniinta ku nool Mareykanka oo in dhoweyd la socday xaaladdeeda caafimaad.\nFartuun oo hore u shaacisay inay fanka ka baxday ayaa mar uu dhowaan wareysi uu ka qaadayay mid ka mid ah telefishannada Soomaalida waxa ay sheegtay iny ku dhalatay magaalada Muqdisho ee caasimadda Soomaaliya.\nFartuun Cumar noolasheeda inta badan waxay ku qaadatay dalka Mareykanka oo ay ku kortay.\n\"Fartuun waxay ku dhalatay Soomaaliya gaar ahaan magaalada Mudisho noolasheyda inta badan waxaan ku koray dalka Mareykanka,\" ayay ku sheegtay wareysigaasi horey loogu qaaday.\nHeesaha ay horey u qaadday waxaa ka mid ahaa\nEnd of Ugu akhris badan\nFartuun kama soo jeeddo qoys faneed sida ay sheegtay, balse tan iyo yaraanteedii waxay jecleyd fanka oo ay aad u daneyn jirtay.\n\"Fankeyga waxaan soo galay ilaa 2005-tii ilaa 2006-dii, fankeygu qurbaha ayuu ku bilaabmay, qoyskeyga taariikh uma laha fanka oo qof fannaan ah nagama dhalan laakiin aniga ayaa ilaa carruurnimadii fanka aad u jeclaa,\" ayay intaa ku dartay.\nSida ay sheegtay waxa ay fankeeda ka billowday gobolka Ohio ee dalka Mareykanka.\n\"Fanka waxaan ku soo galay waxaan soo dagay magaalo Ohio la yiraahdo oo ay Soomaalida ku badan tahay, waxaan ka soo guuray magaalo Soomaalida ku yar tahay halkaasi oo aan fanka ka billaabay\" ayay intaa ku dartay.\nHeestii ugu horeysay oo ay iyadu leedahay ee ay qaaddo ayaa waxay ahayd heesta Samir oo ay wda qaadaan fanaanka Guuleed taasi oo soo baxday 2008-dii, waana mid ka mid ah heesaha ay caanka ku ahayd.\n\"Heestii iigu horreysay waxay ahayd heesta Samir oo ahayd hees muuqaalkeeda ay ilaa hadda dadka aad u wada jecel yihiin aniga iyo Guuleed, waxaana noo dhiibay abwaan Axmed Heykal,\" ayay tiri Fartuun.\nFartuun ayaa wareysi ay horey u bixisay waxa ay sidoo kale ku sheegtay in qoyskeeda markii ay fanka ku soo biireysay aysan ku faraxsaneyn, balse  aysan caqabad ku noqon fankeeda.\n\"Allxamdulilah wax dhib ah kalama kulmin qoyska oo sida qoysaska qaar ma dhihin waan ku deyrinnay iyo ha nugu soo noqonin laakiin ilaa hadda raali kama aha,\" ayay hpre u tiri Fartuun.\nXigashada Sawirka, Baraha bulshada\nAlle haa u naxariistee Fartuun Cumar ayaa sanadkii 2016-kii shaacisay inay ka baxday fanka isla markana wixii xilligaa ka dambeeyay waxay ka fariisatay fanka.\nWaxay xilligaasi ay fanka ka baxaysay ka mid ahayd fanaaniinta aadka loo jecel yahay heesaheeda, balse waxay sheegtay inay go'aansatay inay fanka ka \"towbad keentay\".\n\"Waxaan rabaa inaan maanta idinla wadaago go'aan aan qaatay oo ah inaan fanka gabi ahaantiiba isaga haray alxamdulillah, aniga oo Alle u towbad keenay iyo anigii oo qoys noqday.\" Ayay ku tiri muuqaal kooban oo ay baraha bulshada soo galisay.\nWixii intaa ka dambeeyay, fanaannada ayaan inta badan lagu arkin fagaaraha, iyadoo sanadihii ugu dambeeyay la sheegay inay xanuunsaneyd.", "date": "2025-10-11", "scraped_at": "2025-11-02T07:17:05.496669+00:00", "category": "news", "text_hash": "8c540a960ac60a34ed231dd16196496b4d7b6d83461ed2ddd21950c253577c14", "minhash_signature": "4572062,317662,9392738,3267484,25996911,7484274,11984528,2045612,4057860,15081646,9509280,1281067,947679,31175836,9606389,15806757,22574761,10774366,7757046,105404,122773,5724808,8144269,92160,5947851,4901709,587410,7923410,11525126,10244325,2572275,2766025,2774422,11665302,7048641,4653198,8539788,5743222,4296917,9715341,3171558,11113035,5022522,2041384,10189587,368659,2430363,4852437,4848575,1808654,18208278,6423737,10838596,4802319,8643845,9888046,1772093,780814,4356103,11959823,1715360,14608727,1291917,1453230,1595423,292269,7336916,26791467,27544456,20443124,9125275,10642666,14147240,449905,2328726,27698452,5828577,17666123,15391213,2435125,1552855,4947461,3539725,13300359,19058658,2450155,13927463,2880616,9541098,1070399,1452480,5775098,7408729,17781098,4511944,16588687,5370107,15063159,1492760,6979091,563699,1946766,2058810,5822629,10775265,27446590,30231889,29569268,4143950,40075927,6565682,3407386,8901641,20221453,13553104,1231044,2203416,9092007,1952496,746668,1342093,708141,6562767,21875,1507506,33570540,4163284,3819597"}
{"url": "https://www.bbc.com/somali/articles/c24lqvvmj76o", "title": "Qoys Soomaali ah oo 'si naxariis leh' u koriyay haramcad kadibna ku wareejiyay hay'adda duurjoogta Kenya", "text": "Xigashada Sawirka, KWS\nTuulada Kursi ee Degmada Wajeer, sida ay sheegtay Wakaaladda Adeegga Duurjoogta Kenya (KWS), qoys samejecle ah ayaa  ayaa maan iyo bogaadin ku muteystay daryeelka bedbaadinta haramacad dhal ah oo ay meel cidla ka heleen, ka dibna ay si kalgacal leh u korsadeen muddo ku dhowaad laba sanoah.\n,Qoyskaan Soomaaliyeed ayaa ku wareejiyay haramcadka Hay'adda Duurjoogta, ka dib baaritaan iyo daryeel caafimaad oo ay sameeyeen.\nBashiir Cabdi Xuseen oo ah aabbaha qoyska xannaaneeyey xayawaanka, ayaa dib u milicsanaya sida ay ku soo heleen haramcadka yar ayaa BBC-da u sheegay in laba sano ka hor ay ahayd markii ay qaar ka mid ah caruurtiisu ku arkeen duurka isaga oo baahi badani ka muuqato.\n\"Maalin maalmaha ka mid ah ayaa ilmo yar yar oo aan dhalay waxay igu dheheen aabbow meeshan bahal bakhti ah ayaa yaalla. Bahalkii sidaas markaan u eegeyba waxaan arkay bahalkan yar oo macluulsan oo geedka salkiisa ku jira. Hooyadiis oo bakhti ahna wey ag taallay. Markaas ka dibna waan soo qaaday isaga liita\".\nXigashada Sawirka, AFP\nBashiir wuxuu sheegay in markii uu xayawaanka dhasha ah guriga keenay ay dad badani kula yaabeen dugaag uu sito, balse uusan hadalkooda dheg jalaq u siin ee uu billaabay in uu xannaaneeyo intii uu ka korayey.\n\"Durbadiiba waxaan billaabay in aan saliinge caano ku siiyo maadaama uu dhallaan ahaa. Markii uu soo tabareystayna waxaan u sameeyey weel gooni ah oo uu caanaha ku cabo. Muddo ka dib markii uu korayna waxaan ku billaabay in aan hilib siiyo\", ayuu yiri Bashiir oo hadlayey tacabkii uu geliyey haramacadkii rajayga ahaa.\nEnd of Ugu akhris badan\nBashiir oo ka hadlayey habdhaqanka haramacadka uu korsaday, ayaa sheegay in uu qoorta xarig uga xiray si uusan u baxsan, maadaama uu bahalku asal haan duurjoog ahaa. Sidaas oo ay tahayna uu si wacan ula qabsaday nolosha qoyska islamarkaana uu xoolaha iyo carruurta iskala ciyaari jirey.\nMuddo labo sano ah oo uu daryeelayey ka dib, Wakaaladda KWS ayaa ka war heshay xawaanka dadka la nool, babadeedna kala wareegtay iyadoo u cuskaneysa Xeerka Ilaalinta iyo Maamulka Xayawaanka Duurjoogta oo mamnuucaya in rabaayad ahaan loo haysto xawaan duurjoog ah.\nBashiir oo wax laga weydiiyey sida uu dareemay markii laga qaatay haramacadkii uu soo korsaday ayaa sheegay in uu isagu dowladda ku wargeliyey in uu bahalka yar hayo, islamarkaana uu ku faraxsan yahay in uu noloshiisi dabiiciga ahayd ku koro. Balse wuxuu dhanka kale niyadjab ka muujiyey in dowladdu aysan siin magdhowgii uu mudnaa, maadaama ay iska kaxaysatay xawaan uu ku soo tiil iyo tacab beelay.\n\"Nimankii ii yimid waxay ii sheegeen in maadaama aan bahalka koriyey muddo 2 sano iyo 3 bilood ah, islamarkaana uu iga qabo xoolo aan ka yareyn 13 neef oo aan u qalay, xaquuq aan ku leeyahay, sidaas darteedna marka Nairobi la geeyo oo la baaro dib la igala soo hadli doono. Laakiin sidii horayba loo yiri 'aqli dowlo iyo indho quraanjo midna lama arkee', weli waxba kama hayo\".\nHayadda Duurjoogta oo ka hadlaysey halka uu ku dambeeyey haramacadkii yaraa waxay sheegeen \"in ayadoo la ilaalinayo xaquuqda xayawaanka duurjoogta ah u leeyihiin ku negaanshaha bay'ada dabiiciga ah, hadda lagu hayo iyadoo loo carbinayo in uu nolosha duurka la qabsado.\nHaya'adda oo warka la xiriira xayawaankan ku daabacay bartooda X, ayaa bogaadiyey falkan \"naxariista leh\" ee qoyskani ku xannaaneeyeen dhasha haramacadka, iyagoo dhanka kale dadweynaha xasuusiyey baahida loo qabo nabad ku wada noolaanshaha dadka iyo duurjoogta.", "date": "2025-10-23", "scraped_at": "2025-11-02T07:18:05.436113+00:00", "category": "news", "text_hash": "d7fc1d6dde0c71c7cf038813e9e12a5b992a2757c0a5f30f5a3a4b45528527a6", "minhash_signature": "14980786,7957029,503833,4203681,15510524,3303497,15639845,3851437,3471593,11085088,933999,15338488,8091181,33234392,4146194,8473687,1361319,7433927,21103373,2264880,2833686,3757039,3352325,25424769,1795734,7144912,13935591,25196175,16011163,3229567,5649010,18182744,3563417,1994272,8479697,2797274,11313970,6374995,5987777,11674086,584653,18370586,2578332,3648019,1273908,4056570,10227940,1003703,1173169,90740,25652023,33279932,13694729,4295132,2028244,5635016,8829435,3756633,4691115,3513913,16254276,916303,14619530,11172849,5971586,3653133,5045629,1319088,15593006,4905803,5025034,2799689,14953688,1108967,2454801,23505476,2978183,15928837,2417193,3817790,3532126,4097513,13685708,11715100,7797677,2984167,6445021,4383872,5751134,7112203,2869629,15230186,4229205,4748468,1677632,5772699,3682716,2737732,1492760,11646131,19906775,19772368,2393573,6753951,30681969,2908104,13228891,18551437,13454990,5588858,4684214,2576726,1980557,162252,1565782,29312081,11787617,7942286,11920536,28519601,3360053,551585,1504120,37743331,10492764,6695128,8630371,31684446"}
{"url": "https://www.bbc.com/somali/articles/c7841ly125eo", "title": "Kooxda Muqdisho City oo ka hadashay falkii carada dhaliyay ee qaar ka mid ah taageeryaasheeda kula kaceen calanka Kenya", "text": "Xigashada Sawirka, MOGADISHU FC\nQaar ka mid ah dadka Kenyaanka ee isticmaala baraha bulshada ayaa caro ka muujiyay ka dib markii Garoonka Nyayo lagu arkay koox dhalinyaro ah oo ku tumanaysa calanka Kenya, xilli ay ciyaar ka socotay.\nDhalinyaradan oo la sheegay in ay ahaayeen Soomaali ayaa la arkayay iyaga oo mid ka mid ah uu ku joogsanayo calanka dalka Kenya.\nSabtidii, kooxda kubadda cagta ee Booliiska Kenya ayaa garoonka Nyayo kula ciyaartay kooxda Muqdisho City Club kulan ka tirsan isreeb-reebka koobka horyaallada qaaradda Afrika ee CAF.\nXigashada Sawirka, Muqdisho city club\nKooxda Muqdisho City Club ayaa sheegtay in aad uga xun yihiin falka ay ku kaceen dhalinyaradaasi sheegay in ay taageersanayeen kooxdooda.\nGuddoomiyaha Muqdisho City Club Abuukar Maxamed Sheekh oo BBC la hadlay ayaa xusay in ay falkaasi u arkaan mid aad u xun islamarkna ay raaligalin ka bixinayan.\nAbuukar ayaa farta ku fiiqay in markii uu muuqaalka soo baxay ay aad uga xumaadeen dhacdadaasi.\nEnd of Ugu akhris badan\n\"Waan ka xumahay dhacdadii ka dhacday garoonka Nyanyo oo ahayd in dhalinyaro Soomaaliyeed ay ku istaaeen calanka Kenya, waxaana ka aragnay oo kali ah baraha bulshada markii aan muuqaalka aragnay-na aad ayaan uga xumaannay annagoo ah maamulka kooxda,\" ayuu yiri Abuukar.\n\"Wixii dhacay haddii aan nahay dhammaan umadda Soomaaliyeed waan ka xunnahay raalligalin buuxda ayaan ka bixinaynaa gaar ahaan kooxda Muqdisho City Club waxay raaligalin buuxda siinaysaa kooxda Kenya booliis iyo guud ahaan shacab waynha Kenya dhacdadi ka dhacday garoonka Nyayo waxaan leenahay waan ka xunahay raaligalin buuxdana waan ka bixinaynaa,\" ayuu yiri Abuukar\nXigashada Sawirka, MOGADISHU FC\nGuddoomiyaha  ayaa sheegay in aysan jirin wax xiriir ah oo ay la soo sameeyeen xiriirka kubadda cagta ee Caf islamarkaana dhacdadaasi ay ahayd mid si lama filaan ah u dhacday.\n\"Wax xiriir ah nalama soo sameynin Caf anagana lama sameynin. Dhacdadaasi dhacdo lama filaan ayay ahayd qof fileysay ma jirin, taageerayaashana waa iska xamaasadeysan yihiin waana dhalinyaro aad u da'yar ilaa haddana cid nagala hadashay majirtay haddii ay ahaan lahay Caf ama dowladda Kenya\" ayuu intaa ku daray.\nAbuukar ayaa dhanka kale ugu baaqay in ciyaaraha soo socda looga baahan yahay taageerayaasha in ay u dhaqmaan si xeerka kubaddu yahay islamarkaana ay taageeradooda ku muujiyaan sacab iyo sawaxan, balse aysan ku kicin fal ka baxsan anshaxa.\n\"Waxaan ugu baaqayaa dhammaan taageerayaasha Muqdisho City Club meel kasta oo ay adduunyada ka joogaan in ay muujiyaan wanaag, qalbi wanaag iyo akhlaakh, ciyaaruhu waa is dhex-gal waa dad is jecel ma aha naceyb,\" ayuu yiri.\nKooxda Booliiska Kenya ayaa ciyaartii dhacday Sabtidii  3-1 uga badisay kooxda Muqdisho City Club oo ka timid Soomaaliya.\nCiyaaraha imika ka socda Kenya ayaa ah kulamo ka tirsan isreeb-reebka koobka horyaallada qaaradda Afrika ee CAF.\nCAF Champions League, horayna u ahaan jiray Koobka Kooxaha Horyaallada Afrika, waa tartan kubbadda cagta ah oo sannadle ah oo uu qabto xiriirka kubbadda cagta Afrika ee CAF, waxaana ku tartamaya kooxaha heerka koowaad ee Afrika, iyadoo lagu go'aamin doono tartanka.\nNaadiyada Masar ayaa heysta tirada ugu badan ee guulo (19 koob), waxaa ku soo xiga Morocco oo leh 7, sidoo kale Masar ayaa leh tirada ugu badan ee kooxaha ku guuleystay, iyadoo afar naadi ay qaadeen horyaalka. Tartankan ayaa waxaa ku guuleystay 26 kooxood oo 12 ka mid ah ay ku guuleysteen in ka badan hal jeer.\nXigashada Sawirka, HonMosiria/X\nMadaxa deegaanka ee Ismaamulka Nairobi Geoffrey Mosiria ayaa cambaareeyay falkii ay ku kaceen taageereyaasha Soomaalida ah.\nIsagoo ka hadlayay muuqaal lagu wadaagay barta uu ku leeyahay X, Mosiria waxa uu muujiyay niyad jab weyn, isaga oo ku tilmaamay falkaas mid ixtiraam darro ah oo lagu hayo Kenya iyo dadkeeda.\nWuxuu xusay \"in kubbada cagtu ay tahay ciyaar midaysa, haddana taageerayaashu waa inay ixtiraamaan astaanta qaranka, gaar ahaan marka lagu martigeliyo waddan shisheeye.\"\n\"Waxaa jira waxyaabo aad u sahashan karto kaftan, laakiin waa inaad ixtiraamtaa calanka Kenya, garoonka Nyayo, waxaan ku arkay qaar ka mid ah taageerayaasha Gen Z, qaar ka yimid wadamada deriska ah, oo ku tumanaya calanka Kenya oo xitaa u adeegsanaya siyaabo lagu wiiqayo, taasi waa xushmad la'aan astaan ​​qaran oo ka tarjumaysa midnimadeenna shacab ahaan,\" ayuu yiri.\nWaxaa kale oo uu sheegay in midabbada calanku ay leeyihiin macno weyn ayna tahay in la sharfo, ee aan lagu jeesjeesin.\nXigashada Sawirka, SOCIAL\nSharciga Kenya ayaa ilaalinaya calanka qaranka sida uu qabo xeerka calanka, astaanta iyo magacyada (Cap. 99).\nDastuurku (Qodobka 9aad) waxa uu u aqoonsan yahay calanka in uu yahay astaan ​​qaran, balse dembi kama dhigayo fal-dambiyeedka sida ku tumashada calanka.\nCap. 99, si kastaba ha ahaatee, wuxuu dembi ka dhigayaa \"aflagaaddo, jeexjeexid ama ixtiraam darro\" lagula kaco calanka ama calaamad kasta oo qaran.\nDembiileyaasha ayaa wajahaya ganaax aan ka badnayn Sh5,000 ama xaqig aan ka badnayn lix bilood, ama labada oo la isugu daro.", "date": "2025-09-23", "scraped_at": "2025-11-02T07:19:05.405688+00:00", "category": "news", "text_hash": "afa3bbd5b4c7a0513bb6694bd570963c779c8364f58620f4d21b021e66e59d46", "minhash_signature": "6187852,4044197,2147681,882483,2700870,2169488,22376281,49438,5110364,3275972,5450447,4010237,572254,582758,9479378,5010802,6252625,4674485,1780478,3593338,1315719,2929944,4955368,2778819,3521999,6859786,10422483,2347575,9962425,2005974,1252203,77238,5871632,4605682,3015969,5655461,6568104,5596375,6376383,2917138,716521,345293,1491791,6638867,4279138,5319194,4570318,20916572,7607713,5024424,5993012,1014690,3035961,2557254,20798054,1426072,1410990,1200570,9967463,10749053,227649,21439501,20572344,10114366,13719082,4856291,2278421,20404664,10290131,10446053,98670,4929096,6683475,1553289,3560258,3717689,833114,1768542,10578985,4750479,5373375,15780300,4175754,4936320,2026413,6721289,3860482,24048864,6219389,3711971,1048581,5343238,15393426,6284214,6247613,915564,856282,4065990,1492760,4730961,1260008,6335057,272755,3377384,16267041,3174220,48142,10659010,3437643,8194532,6008374,6511756,231968,5580700,5125344,3660436,2474818,507237,10020028,1066670,3308937,8975441,7495414,2613930,4785408,3211363,9172485,310301"}
{"url": "https://www.bbc.com/somali/articles/c3dnk48m50ro", "title": "Newcastle oo sahaminaysa soo celinta Elliot Anderson - Xanta kubadda cagta", "text": "Xigashada Sawirka, Getty Images\nNewcastle United ayaa sahamineysa inay Elliot Anderson dib ugu soo celiso kooxda, madaxa Bayern Munich ayaa sheegay inuusan jirin wax lagu burburin karo qandaraaska Michael Olise, dhanka kalana Harry Maguire ayaan weli Manchester United u soo bandhigin wax heshiis cusub.\nNewcastle United ayaa sahmisay suurtogalnimada ay dib ugu soo celin karto ciyaaryahanka khadka dhexe ee England Elliot Anderson, oo 22 jir ah, ka dib markii ay ka iibiyeen Nottingham Forest sanadkii 2024 kii.\nAgaasimaha ciyaaraha ee Bayern Munich Max Eberl ayaa sheegay in 23 jirka garabka uga ciyaara France Michael Olise, kaasoo lala xiriirinayo kooxo badan, aysan jirin wax lagu burburin karo qandaraaskiisa, kaasoo soconaya ilaa June 2029. Waxaa sidaas qoray (Talksport).\nManchester United ayaa weli xiiseyneysa 24 jirka qadka dhexe ee daafaca Jarmalka Angelo Stiller, laakiin qiimaha Stuttgart ee 24 jirkaan ayaa la filayaa inuu ka badan yahay € 50m (£ 43.5m). (Sky Sports Germany), ayaa sidaas qortay.\nCiyaaryahanka khadka dhexe ee Atletico Madrid Conor Gallagher ayaa sidoo kale bartilmaameed u ah Manchester United, kuwaas oo u arka 25-sano jirkaan bedelka suurtagalka ah ee xiddiga kale ee England Kobbie Mainoo, oo 20. jir ah (Insider Football), ayaa sidaas qortay.\nDaafaca dhexe ee England Harry Maguire ayaa laga yaabaa inuu si bilaash ah uga tago Manchester United marka uu qandaraaskiisu dhaco xagaaga soo aadan, iyadoo kooxda Old Trafford aysan weli u soo bandhigin 32 jirkaan heshiis cusub.\nEnd of Ugu akhris badan\nAston Villa iyo Newcastle United ayaa ka mid ah kooxaha doonaya 21-jirka FC Porto iyo xulka Spain Samuel Omorodion, kaasoo horay ugu dhawaaday inuu ku biiro Chelsea, isla markaana wadahadalo la yeeshay Nottingham Forest.\nDaafaca reer England Fikayo Tomori ayaa wadahadalo heshiis kordhin ah kula jira AC Milan, 27 jirkaan ayaa sheegay inuusan dooneynin inuu ka tago kooxda Serie A.\nWeeraryahanka Faransiiska Jean-Philippe Mateta, oo 28 jir ah, ayaa loo maleynayaa inuu doonayo inuu ka tago Crystal Palace, iyadoo Manchester United, Newcastle United iyo Tottenham ay macquul tahay inuu tago.\nWest Ham ayaa isha ku heysa 24 jirka weerarka uga ciyaara Netherlands Joshua Zirkzee waxaana laga yaabaa inay isku dayaan inay amaah ugala soo wareegaan Manchester United bisha Janaayo.\nBorussia Dortmund ayaa laga yaabaa inay amaah ku dirto 20 jirka khadka dhexe ee Ingariiska Jobe Bellingham, kaasoo ay kala soo wareegeen Sunderland xagaagii hore.\nCiyaaryahanka khadka dhexe ee Ingariiska Samuel Alker, oo 16 jir ah, ayaan weli aqbalin inuu heshiis xirfadle ah u saxiixo Leeds United marka uu 17 jirsado bisha Maarso, waxaana xiiseynaya Borussia Dortmund iyo Bayer Leverkusen.", "date": "2025-10-24", "scraped_at": "2025-11-02T07:20:05.565555+00:00", "category": "news", "text_hash": "dc9e49535b30a09259d4f3edf5c4bc3efb79e1b010ccc664552015bf4c523c43", "minhash_signature": "509544,18407664,6338208,2746040,5452920,11862853,15265364,27988889,8852498,15184040,1145370,6578165,6077770,4424234,10982931,5383791,5481930,4062296,12904305,1856941,31695474,49446920,847683,1339642,3108632,4480477,9123105,7075104,686140,4346229,25326198,3135013,9427707,3026661,7935059,721272,50156172,14958010,10398977,370408,12562601,2282156,8589460,14373894,12082623,2706217,33460635,26301871,1122405,21201245,954838,8551042,11722281,1103079,5042889,14501986,7983056,32286,10603716,2111061,368207,5617451,242581,3081545,3728226,32562901,13888875,4605778,9778522,9550226,7232328,4024583,4214880,1278150,12777473,9589268,2994126,3942616,19042229,28983112,16296480,14974153,5023678,19906091,9000924,11074820,5981758,12472589,9839426,12273077,24998698,25444754,11389886,6176650,15624447,5178219,2514873,6582396,1492760,339509,23213095,2169920,2705666,3728429,2463104,18598923,168127,8716798,13655421,33096725,22315314,5543966,3879637,23528967,24330821,1430292,14700058,22421335,1841939,32474283,15522870,31874327,10463869,14451477,11269667,22784702,2874510,11653236"}
{"url": "https://www.bbc.com/somali/articles/cpw5xwp001yo", "title": "Daawo: Warbaahinta ay dumarka keliya ka howlgalaan ee abaalmarin caalami ah u sharraxan", "text": "Soomaaliya waxaa sanadkii hore laga hirgaliyay markii ugu horreysay warbaahin loogu magac daray Bilan oo maqal iyo qoraal ah oo diiradda lagu saarayo warrarka la xiriira haweenka iyo xadgudubyada loo gaysto.\nBarnaamijka warbaahintan dhammaantii dadka ka shaqaynaya waa dumar, laga bilaabo tifafaftiraha, soo saarayaasha iyo weriyayaasha warbixinnada sameynaya.\nBarnaamijkan oo ay maalgalinayso hay’adda horumarinta qaramada midoobay ee UNDP ayaa si gaara loogu eegi doonaa warbixnada adag iyo kuwa jilicsan ee saameeya dumarka.\nHaatan ayay u sharraxan yihiin abaalmarin caalami ah.", "date": "2023-10-03", "scraped_at": "2025-11-02T07:21:05.360843+00:00", "category": "news", "text_hash": "76d9a2ed96196521f85b32841188ff39af3a216178455d2cc219ff8c68046101", "minhash_signature": "18490340,34450734,21227763,9250498,11925775,5709428,26912023,19956159,114768647,335525651,68947099,32229228,52369765,105057130,38450751,44831742,6432459,96009563,149170592,15360301,51148704,2929426,13464211,138984196,87065855,109670245,60671677,17919979,6861026,113781955,1983464,1180288,21008631,14430529,8991437,30585708,197679535,85986799,85578136,22772582,34901682,10122897,19190474,132853202,19235825,168856469,17386764,1265372,17535552,12542303,10624147,13253570,42616423,58278889,9805527,1519383,54549108,42180985,20173203,100767252,49083240,37999269,76123835,34959571,25976452,20365646,32528002,52281784,16082552,58277759,55663615,67946601,10046417,4718899,31749584,120217809,11515471,5963932,46460284,144607577,53873211,49684178,20235242,28845031,36137911,3718962,29877458,18796512,27058329,76863393,19571397,118764182,123328659,57855207,22508368,15852154,5892727,33045345,14878650,39993396,20534348,37459006,18568699,7823699,29169785,45514422,110025285,12352073,36115803,16901236,1258676,42029652,24318247,47378633,19190430,31162866,2987825,25045293,101882669,14149810,104053870,43535925,391895,27113031,45971302,95273167,48792864,13537489"}
{"url": "https://www.bbc.com/somali/articles/cp3dnp3jgdgo", "title": "Boqorkii Sacuudiga ee uu dilay wiil uu adeer u yahay 50 sano ka hor", "text": "Xigashada Sawirka, C Maher/Daily Express/Hulton Archive/Getty Images\n25-kii March 1975-kii, waxaa caasimadda Riyaad lagu dilay Boqor Sacuudiga Faysal. Waxa toogtay wiil uu adeer u yahay ooku dhex-toogtay gudaha qasriga boqortooyada.\nMarkii rasaasta la ridayay waxaa ag taagnaa wasiirkiisa shidaalka Axmed Zaki Yamani.\nSannadkii 2017, Dr Mai Yamani, oo ah gabadh uu dhalay wasiirkii hore ee Shidaalka scauudiga  ayaa la hadashay BBC.\n\"Weligay ma hilmami doono maalintaas, xanuunkaas jirkeyga ayuu saaqay, wali waan xasuustaa, aabbahay. Bal qiyaas qof bini'aadam ah oo ag taagan lataliyihiisii, sayidkiisii, saaxiibkii, oo xabbad af-saar looga dhigay.\"\nBoqor Faysal ayaa saddex xabbadood oo is xig xiga lagu dhuftay, ka dib markii uu foorarsaday si uu u dhunkado gacanta wiil uu adeer u yahay oo salaamay.\nAabaha Dr Yamani oo muddo15 sano ah ahaa wasiirka daacadda u ah Boqor Faysal ayaa warbixin siinayey boqorka, waana sababta uu dhinaciisa ugu u taagnaa.\nEnd of Ugu akhris badan\nBoqor Faysal oo ahaa boqorkii saddexaad ee boqortooyada sacuudiga  ee qaniga ku ah shidaalka , waxa uuna ahaa wiil saddexaad.\nMarkii la toogtay boqorka waxaa  loola cararay Isbitaal, balse wax yar ka dib wuu dhintay.\nXigashada Sawirka, Claude Salhani/Sygma/Getty Images\nDhowr mayl meel magalada u jirta maalintaas, Mai Yamani oo 18 jir ah ayaa ku sugaysay aabaheed.\n\"Waxaan fadhiyay gurigii aabbahay oo ay ku wareegsan yihiin buugaagtiisa. Wuu soo galay, isaga oo ay ka muuqato wajigiisa xanuun iyo murugo iyo a xanuun badan. Wuxuu si toos ah ugu gudbay qolka cuntada oo waxaa uuna dhawaaqay afka labadiisa isaga hal kelmad oo ahayd - 'Balaayo'.\"\nKani ma ahayn ninkii ana naqaana oo ahaa  nin ku caan baxay degenaan iyo aamusanaan, ka dibna wuxuu u sheegay inantiisii ​​wixii dhacay.\n\"Waxa ahayd10-kii subaxnimo wefti Kuwait ah oo arrimaha shidaalka ah ayaa joogay, waxayna doonayeen inay la kulmaan boqor Faysal oo jooga qasriga, aabbahay oo ahaa wasiirka shidaalka ayaa u soo galay inuu boqorka warbixin siiyo,\" ayay tiri.\n\"Amiirkaas oo ahaa mid la yaab leh oo ay isku magac yihiin, Faysal [Ibu Musaed] oo boqorku adeer u yahay, ayaa weftiga ku dhex milmay wasiirkii shidaalka ee Kuwait, ka dibna wuu i isku duubay wiilka uu adeerka u yahay si uu u salaamo.\n\"Wiilkii adeerka uu u ahaa ayaa bistoolad yar jeebka kala soo baxay oo ku toogtay boqorka, saddex xabbadoodna madaxa ayuu kaga dhuftay, aabbahayna meel aad ugu dhow ayuu taagan yahay.\"\nSida ay sheegayaan wararka qaar wakhtigaas, gacankudhiiglaha ayaa sida muuqata u sheegay booliiska in Yamani uu u taagan yahay meel aad ugu dhow uuna u maleeyay inuu isagana uu dili doono.\nYamani waxa uu isbitaalka u qaaday boqor Faysal, halkaas oo la  xaqiijiyay geerida boqorka.\n\"Intaas ka dib, wax walba waa ay aamuseen, waddooyinka Riyadh waxay ahaayeen kuwo faaruq ah, [waxaa jiray] aamusnaan.\"\nFaysal waxa uu boqor ka noqday Sucuudiga sannadkii 1964-tii, isaga oo xukumayay \" Saxare le'eg Galbeedka Yurub \", waxaana Ingiriisku uu ku ammaanay inuu yahay\"saaxiibka cusub ee Carbeed\", shaqadiisa waxay ahayd \"inuu casriyeeyo mid ka mid ah dalalka ugu dib-u-dhacsan Bariga Dhexe\", sida uu weriyaha BBC-da David Dimbleby u sheegay xilligaas - laakiin ma sameyn karaa isaga oo aan lumin kursigiisa?\nMid ka mid ah wiilasha gaar ahaan curadka Cabdulcasiis Al Sacuud, Faysal waxa uu u halgamay ololihii aabbihii ee ahaa in la mideeyo jasiiradda Carabta taas oo horseedday in la aasaaso boqortooyada magaceedu yahay Sucuudiga, 30 sano ka hor xilligaasi.\nCabdulcasiis Al Sacuud, Faysal markii dambe waxa uu ra'iisal wasaare ka noqday walaalkii ka weyn oo boqor noqday markii aabbahood dhintay.\nMarkii uu Faysal laftiisu boqor noqday, waxa uu caan ku ahaa siyaasi caqli badan, cibaado badan, hawlkar ah iyo isbedel-doon, waxa uu ahaa nin ka hawlgeli jiray caasimadaha dibadda ee adduunka oo dhan.\nWaxa kale oo loo arkayey in uu yahay masuul doonaya in uu u isticmaalo shidaalka cusub ee la helay si uu u Sacuudiga uga hirgaliyo dawladnimada casriga ah, waxbarashada, caafimaadka iyo nidaamka garsoorka dalka Sucuudiga uu sibadal ku sameeyo.\nLaakiin dib-u-habaynta boqor Faysal ayaan mar walba ka farxin dadka muxaafidka ah ee ku jira mad-habta adag ee Islaamka ee qoyskiisu ay isbahaystaan.\nMarkii bartamihii 60-aadkii uu Faysal furay telefishinkii ugu horreeyay ee Sacuudi Carabiya, ayaa weerar hubeysan lagu qaaday dhismaha, kaasoo uu hoggaaminayay wiil wlaal la ahaa  ninkii markii dambe dilay.\nBoqor Faysal waxa uu sidoo kale hirgaliyay waxbarashada gabdhaha.\nDr Yamani ayaa yiri: \"Boqoradda Iffat [xaaskiisa labaad] waxa ay waxbarashada gabdhaha ka bilowday boqortooyada Sacuudiga.\n\"Aad baan ugu hanweynahay inaan ka mid ahaa 9-kii hablood ee ugu horeeyay ee wax ka barata dugsigeedii, boqor Faysal waxa uu ku qanciyay hay'adaha diinta in aad haweenka wax barataan oo ay noqdaan hooyooyin wanaagsan, waxaana la oran jiray Daar Al Xanan oo ah dugsigii jilicsanaanta.\nXigashada Sawirka, Bettmann Archive/Getty Images\nYamani waxa uu bilaabay in uu u shaqeeyo boqor Faysal 1960. Tani waxay ahayd mid aan caadi ahayn maadaama uu ahaa nin aqoon sare iyo qareen, balse aan ka tirsanayn qoyska boqortooyada Sucuudiga.\nBoqor Faysal ayaa akhriyey maqaallo uu qoray kuwaas oo indhihiisu qabteen oo soo jiitay.\n\"Aabahay waxa uu furay xafiiskii ugu horeeyay ee sharciga ka dibna waxa uu bilaabay in uu qoro maqaaladii ugu kicinta badnaa ee uu ku dalbanayo dimoqraadiyad iyo dawlad wanaag, waxa u saxeexay qof la yidhaahdo Abu Mai, oo ah aabbe gabadh la yidhaahdo Mai, sababtoo ah anigu waxa aan ahaa curadkiisii, markaa Faysal oo markaas boqorka ahaa ayaa yiri waa ayo ninkani? Sababtoo ah wuxuu raadinayey lataliye sharci.\"\nBoqor Faysal waxa uu markii dambe Axmed Zaki, ama Sheekh Yamani sidii uu ku caan baxay ka dhigay wasiirka shidaalka.\nWaxa ay si wada jir ah boqorka iyo dadkii la shaqeynayay ​​u dejiyeen siyaasad ay markii ugu horreysay si buuxda u siisay Sucuudigu in uu si buuxda u maamulo hantida faraha badan ee uu ku helay shidaalka, kana dhigo mid awood u leh oo lagula xisaabtamo dunida Carabta iyo caalamkaba.\nSannadkii 1973-dii, ka dib dagaalkii u dhexeeyay Israa'iil iyo dalalka Carabta ee ay deriska yihiin, Sucuudigu, oo hadda ah dalka ugu badan ee soo saara shidaalka  adduunka, ayaa horseeday ololihii shidaalka loogu adeegsaday markii ugu horreysay  sida hub siyaasadeed oo kale.\nShidaalka la geeyo wadamada taageera Israel waa la dhimay, taasoo oo ka dhigtay qiimaha Shidaalka mid sareeya  adduunka. Waxaa uu ahaa Sheekh Yamani qofka loo soo dhiibay oo baahiyay.\n\"Waxa aan rabno waa ka bixitaanka ciidamada Israa'iil gebi ahaanba dhulka Carabta ee la haysto. Ka dibna waxaad heli doontaa shidaalka heer la mid ah, wxaa uu halkaas jeediyay Sebtembar 1973.\"\nWaxa uu qiray in kororka baaxadda leh ee ku yimid qiimaha shidaalka ay ka dhigan tahay isbeddel ku yimaada isu-dheelitirka awoodda adduunka ee u dhexeeya waddamada soo koraya, kuwa wax soo saara iyo waddamada horumaray ee warshadaha leh.\nIsbeddelkaas ku yimid miisaanka awoodda waxa la aqoonsaday markii, 1974-kii (sanad ka hor intaan la dilin), Boqor Faysal wxaa loo aqoonsaday ninka sannadka ugu saameynta badan ee majaladda Time.\nDr Yamani ayaa tiri: \"Ma garanayno sababta dhabta ah ee loo dilay boqorka, marka laga reebo in gacan ku dhiiglaha uu ahaa nin dhibsaday, aniga oo 18 jir ah xilligaas, waxaan dareemay xanuunka aabbahay, weli waan xasuustaa.\"\nSheikh Yamani ayaa 11 sano oo kale ahaa wasiirka shidaalka ee Sucuudiga, ilaa 1986-dii.\nDr Yamani waxa ay u sii gudubtay jaamacad ku taalla dalka Maraykanka, waxayna noqotay haweenaydii ugu horreysay ee ka soo jeedda Sucuudiga ee PhD ka qaadata Oxford.\nWaxay qortay buugaag badan oo ku saabsan aqoonsiga Carabta waxayna sidoo kale la taliye u noqotay bangiyada sida Goldman Sachs iyo shirkadaha shidaalka sida Shell.", "date": "2025-10-17", "scraped_at": "2025-11-02T07:22:05.428053+00:00", "category": "news", "text_hash": "719ba38ea5f7c0536b3c2400c1406c0577c1fac6ca2413df8e04ea733b8d1845", "minhash_signature": "3273954,326403,427176,13411730,758347,1610317,876964,2930933,4266885,1087221,435048,702095,306341,318763,9000988,157413,7931555,5388887,3527905,303314,5440322,4250698,737103,5430019,3412188,3327435,3566180,3575606,1094060,3115697,5992410,9047085,38984,2011482,1882829,5122444,634355,7269220,4905659,6950974,805258,276833,46621,2957978,4970266,1386249,9862535,282330,3123243,3525984,2175283,3326261,2715671,2958550,761523,756850,4945686,391765,1718492,170734,8523986,1895227,2628939,2736766,3183686,2525003,2493089,657010,2131651,576338,827239,9301586,5267856,872345,2956709,206006,1627527,13692141,1739408,2708673,4127004,441541,1336348,4088799,1595163,6899998,1007441,2084049,2329198,7615159,1294765,5477997,799145,2879173,659758,356890,1412156,2022488,1118325,3349502,5913569,2599733,3927538,5093839,797460,5304025,14909764,9087071,7564552,4396102,1497776,1192921,2041391,13316183,1413606,2708734,2407718,3311558,1917737,3222704,192050,3453828,5968211,6403121,3698090,317105,2095137,1190519"}
{"url": "https://www.bbc.com/somali/articles/czr817elv71o", "title": "Daawo: Madaxweynaha Faransiiska ma xaaskiisaa dharbaaxday mise waa jaceyl uun?", "text": "Muuqaal la soo duubay ayaa muujinaya xilliga Emmanuel Macron ay wejiga gacanta uga riixday xaaskiisa markii ay caga dhigteen Hanoi, Vietnam fiidnimadii Axadda.\nMuuqaalkan, Brigitte Macron ayaan si weyn uga muuqan kaamirada, iyada oo gacmaheeda oo keliya ay ka muuqdaan marka ay riixayso Macron.\nMadaxweynaha Faransiiska ayaa markii hore u muuqday mid naxay, laakiin si deg deg ah ayuu isu soo ururiyay oo uu ugu sgacan-haatiyay kamaradaha hoos yaallay.\nIlo laga helay Elysee ayay soo xigatay warbaahinta Faransiiska iyaga oo sheegay in waxa kaamiradu qabatay ay ahayd \"daqiiqad uu madaxweynaha iyo xaaskiisa ay kaftamayeen kahor inta aan safarka la bilaabin\" Macron wuxuu sheegay inay \"kaftamayeen oo kaliya sida aan mar walba samayno\".", "date": "2025-05-27", "scraped_at": "2025-11-02T07:23:05.513782+00:00", "category": "news", "text_hash": "a37432bb6a047ed42907c86f9ff9c71a533d75cf061956bef6c2042a682951b8", "minhash_signature": "13724374,14707301,28626394,36195540,2512443,7516531,77614078,57704713,97317183,22053351,18990029,21958570,48876765,21184442,24564269,5751282,29506267,64704794,4264676,35315019,8351577,89152548,3547155,2340980,46854345,1028499,15937782,31597798,13406018,55573132,22817004,39942494,174987812,159325899,5823912,41427342,43189074,25368457,50667130,13153857,24194879,29094665,495068,2681594,47335916,84637710,51424739,38382238,2409876,18154922,45176565,9930908,37211299,81857495,43242766,6997272,31111978,63883966,31380911,41789565,20144616,8535661,8644257,3170266,11819118,151569479,9762282,46193490,2435054,9752779,64047548,54858866,62587619,12380426,9138083,35583371,9365305,41062667,108038562,564363,46092054,95767366,107019112,23574698,205663856,21436315,45849529,73285337,23599792,793247,79522025,3072872,44646725,20863449,22141044,136469994,22254362,8203622,11520899,65019611,769127,166262587,69663065,64920432,33389817,27489821,15353044,9181997,8173693,120842266,204122929,61722247,4975818,27800482,34146404,7169933,32619775,6782897,117537162,48821934,1287469,19047632,14189877,4549617,41624919,13632183,113081715,39399542"}
{"url": "https://www.bbc.com/somali/articles/c5ykgvegyrmo", "title": "Deegaan Soomaaliyeed oo jaangooyey kharashka ku baxa guurka. Ciddii diidda maxay mutaysan kartaa", "text": "Xigashada Sawirka, Getty Images\nOdayaasha dhaqanka iyo maamulka degmada Xamaro ee gobolka Erer ee Dowlad Deegaanka Soomaalida iyo qaybo ka tirsan bulshada deegaanka ayaa soo saaray go'aanno ku saabsan qiimaha iyo lacagaha ku baxa guurka. Go'aannadaas ayaa lagu mamnuucay waxyaabo badan oo laga bixiyo gabadha loo geed-fadhiisanayo\nSheekh Cabdiraxmaan Rashiid waa madaxa golaha arrimaha Islaamka ee degmadaasi waxa uu BBC-da uga warramay sababta keentay go'aanada la soo saaray iyo waxa ku soo kordhay bulshada.\n\"Waxa jiray in muddo ah waxyaabo ku soo kordhay guurkii caadiga ahaa ee la yaqiinay, marka taas ayaa saldhig u ahayd in aan shirno oo aan go'aamo ka soo saarno guur xumada iyo waxyaabaha waayadan dambe ku soo kordhay bulshada gaar ahaan degmada Xamaro\".\nSheekh Cabdiraxmaan ayaa sheegay in waxyaabo badan ay soo ku kordheen guurka waqtiyadan dambe kuwaas oo ah wax cusub oo culeyska ku ah dadka is guursanaya.\n\"Waxybaaha aan mamnuucnay waxaa ka mid ah sida dhar la bixiyo marka gabadha loo fadhiisanayo, qaad iyo sigaar oo iyagana waajib laga dhigay iyo geel la qalayo guurka ka hor\" ayuu yiri Sheekh Cabdiraxmaan oo intaas ku daray \"gabaatiga oo waagii hore xubin sharafeed ahaa sida odayaasha dhaqanku noo sheegen waxaa ku kordhay in la bixiyo geel la yiraahdo Gabaati oo oo aan yarad aheyd oo xaafada la siiyo oo geelaas in muddo ah la iska haysto kaddibna ninkii lahaa loo celiyo\".\nDhaqanka in gabadha xoolo laga bixiyo ma ahan wax ku cusub bulshada balse sida sheekhu sheegayo waxyaabo dheeri ah ayaa soo baxay taas oo keentay in dhaqankii hore meesha ka baxo\nEnd of Ugu akhris badan\n\"Hadii dhaqankii hore layska haysanayo, oo aan aad looga sii guureynin, oo waxyaabo cusub aan la keeneyn, iska caadi bay noqon laheyd, oo bulshada wax badan mey dareenteen, laakiin waxaa dhacday in fasaadkii uu batay, guurkii uu adkaaday\" ayuu yiri sheekha oo intaas ku daray in \"dhaqamo badan lagu soo daray dhaqankii hore, wixiina ay isla sii adkaadeen, taasna ayaa keentay in dhibaato kale dhalinyaradi u baxdo\".\nSheekh Cabdiraxmaan oo sharaxay waxa ay sida rasmiga ah uu diidan yihiin ayaa sheegay in ay joojiyeen waxyaabaha dheeriga ah.\n\"Waxaan gabi ahan joojinay wixii gabbaa la oran jiray gabihii, dharkaas iyo waxyaabaha raad raaca, waxaan ugu talo galnay in si xalaal ah oo haboon laysu guursado, loona wada dhaqmo, loona dhiso reer xalaal ah\".\nSi loo fuliyo go'aamada soo baxay waxa uu sheegay Sheekh Cabdiraxmaan in ciqaabayo cidii u hoggaansami weyda.\n\"Wixii aan soo saarnay cidii ka hortimaada waxaa u yaal xeer ciqaabeed xarig iyo hanti isugu jira\".\nXigashada Sawirka, Getty Images\nMa ahan markii ugu horeysay ee go'aamo laga soo saaro nidaamka guurka meelo ka mid ah gobolada Dowlad Deegaanka Soomaalida. Hore ayaa loo soo saaray in dhaqamdaas la joojiyo taasna ma dhaqan galin.\nSidoo kale Bulshada ku dhaqan magaalada Godey ayaa hore ugu heshiiyay in ay hoos u dhigaan kharashka ku baxa guurka. Goa'ankaas ayey dadka deegaanka sheegeen in ay uga gol leeyihiin sidii dhallinyarada loogu fududeyn lahaa guurka xilli sanadihii ugu dambeeyay uu soo badanayay kharashka ku baxa aroosyada.\nHaween ku nool Godey oo BBC-da hore u weydiisay rayigooda ku saabsan in la dhimo qiima guurka iyo aragtidooda waxay sheegeen in aysan faa'ido ku jirin guurka oo la raqiisiyo.\nMid ka mid ah haweenka ayaa tiri, \"Ninka waxa uu leeyahay, qiimo iiguma fadhidid, wuuna furi gabadha, furitaankana degdeg buu noqon, adigoo iska fadhiya ayaa gurigaaga warqada laguugu keenayaa, markaad dhadho maxaa jirana, horeba qiima iiguma fadhin baa lagu dhihi\". Gabar kale oo ayaa iyadana tiri, \"Waxaan qabaa in ragga ay xoolo badan gabadha ka bixiyaan si ay gabadha ugu fara adeegaan, gabadhana ay hadhow reerkeeda u dhaqato\".\nGabdho kalena waxay qabaan in guurkii hore adkaa taasna ay keeneysay in furiinka yaraado.\nWiilal kale ayaa qaba in ay haboon tahay in guurka la raqiisiyo si qof walba uu u awoodo in uu guursado.\nMa ahan oo kaliya dhulka Soomaalida meelaha looga hadlo guurka iyo dhaqaalaha ku xeeran. Al-azhar ayaa hore u soo saartay hindise la xiriira gurka.\nHindidisaha ay soo bandhigay Azhar waxaa ujeeddadiisa lagu sheegay in \"lagu ciribtiro caadooyinka xun-xun iyo dhaqamada guurka\", iyadoo la rajaynayo in wax la fududeeyo, lagana hortago buunbuuninta iyo kharashka badan ee la galo, gaar ahaan xilligan oo xaaladda dhaqaale ee dunida ay aad u liidato.\nWuxuu hindisuhu ka kooban yahay dhowr weji. Tan ugu horreysa waa xafladda meherka, oo la doonayo in lagu koobo arrimaha ugu muhiimsan sida: \"In la akhriyo Suurat Al-Faatixa iyo in lagu casuumo oo keliya qaraabada ugu dhow ama xubnaha qoysaska labada dhinac ama in ay meesha tagaan oo keliya labada is guursaneysa iyo waalidka.\nMarxaladda labaad ee talada ay saameyneyso waa isu-diyaarinta guurka: \"Koorso degdeg ah oo loogu talagalay lammaanaha isqaba oo arrimaha qoyska ah, in lagu heshiiyo qiimaha dahabka ee markaas, balse aan lagu saleyn garaam.\"\nHalka marxaladda saddexaad ay tahay habraacyada guurka oo ay ku jiraan in aan lacag lagu bixin sawirro la galo, bisha malabka in meesha laga saaro, iyo in laga maarmo labbiska waalidka labada dhinac.\nDhammaan arrimahan waxay muujinayaan culeyska dhaqaalaha guurka ku hayo dhallinta guur-doonka ah.", "date": "2025-05-19", "scraped_at": "2025-11-02T07:24:05.603992+00:00", "category": "news", "text_hash": "c6ab532e181a9372eddb3466391fc0735d1882d47bb51f55cebf46501eba5775", "minhash_signature": "5033251,9851725,4583403,2553029,750885,8069540,218421,6511282,1362655,279347,5459251,6283743,1998,20062865,390162,3047012,2714111,3630222,11189497,1644733,12042731,816494,601374,489468,4926126,163152,4870013,5226785,7335499,946072,7866952,3692934,4121618,1324323,6811499,5324779,3427741,566051,1216278,21792244,10167688,12972340,671316,196318,6772679,860050,600733,503735,3089016,1302600,2749077,7063794,9597743,6681089,1487467,7832366,413474,614406,5569637,4092131,2872189,4606610,15992869,3996889,6492943,839306,1813998,5266978,4793900,6654915,9679569,681059,633357,3718019,4249289,456400,1043735,8311379,4395806,1654251,2920236,674822,6568892,6941085,8161447,4818115,9989026,8697032,3521974,4148100,6671205,13007667,1763611,14097109,3121162,958177,724184,6582396,1492760,10206037,400861,8917590,8734663,774319,1889354,4101129,17243022,15452287,2054750,1443833,492848,1669605,11972236,3086930,4718512,5542502,11577420,6339707,1800579,508588,13871233,4988143,8448611,16525675,2862121,4410117,57147,11879458"}
{"url": "https://www.bbc.com/somali/articles/c3vnz3x2061o?at_medium=RSS&at_campaign=rss", "title": "'wuxuu ku dhacay dhulka isaga oo mindidu weli wadnaha kaga taagan tahay'", "text": "Xigashada Sawirka, Derbyshire Police\nHaybe Cabdiraxmaan Nuur ayaa toorri la dhacay nin la yidhaadho Gurvinder Johal oo da'diisu ahayd 37 jir. Waxa uu kaga dhuftay wadnaha, sida ka muuqata weerar ay duubtay kamaradda CCTV-ga. Weerarku waxa uu ka dhacay Lloyds Bank oo ku yaalla waddada St Peter, Derby, saacaddu markay ahayd 2:30 xilliga maxalliga ah, maalintii ay taariikhdu ahayd 6-dii May.\nMr. Haybe ayaa la sheegay in uu dalka UK ku yimid doon yar kaddib markii uu dhowr sano ku sugnaa  qaybo kale oo Yurub ka mid ah.\nArbacadii ayaa lagu xukumay xabsi qaadnaya ugu yaraan 25 sannadood.\nQoyska wiilkooda la dilay oo joob-joog ka ahaa maxkamadda ayaa ku tilmaamay in uu ahaa shaydaan saddex carruur ah dhaafiyay aabbahood.\nXigashada Sawirka, Family handout\nMaxkamaddu waxay dhagaysatay in dilaaagu markii hore uu 2016-kii ka tagay Soomaaliya una safray Liibiya, markaas oo loo soo diray 1,800 doollar si uu ugu raaco doon tagaysa Yurub.\nTaariikhdu markii ay ahayd Oktoobar 2024-kii ayuu galay dalka Ingiriiska, iyada oo la rumaysan yahay in uu mukhalasiinta siyay lacag dhan €400 (£352). Waxa uu hore u joogay Talyaaniga, Faransiiska, Jarmalka, Luxembourg iyo Netherlands.\nEnd of Ugu akhris badan\nLouis Mably KC ayaa maxkamadda u sheegay in Haybe uu si sharci-darro ah u iibin jiray sigaarka intii uu ku noolaa xeryaha Faransiiska iyo Talyaaniga, islamarkaana uu isagu ahaa cidda qorshaysay safarka uu ay kaga baxday €400 ee uu ku tagay dalka Ingiriiska.\nGarsooraha Shaun Smith oo ku dhawaaqay xukunka maxkamadda ayaa yidhi: \"Waxaad si cad oo dadweynahu wada arkayaan u dishay [Mr Johal].\"\n\"Waxaad samaysay falkaas adigoo mindi wata, inaad doorato Mr Johal oo aad wadnaha mindi kaga dhufato– nin aanad weligaa aqoon, waxay ahayd fal naxdin iyo qalbi-jab ah.\n\"Tani waxay ahayd filin daawashadiisu naxdin tahay oo dhab ah oo uu ka naxay qof walba oo daawaday.\"\nNinkan 47-jirka ah ayaa codsaday magangalyo bishii Oktoobar sannadkii hore, isla markii uu UK yimid. Codsigiisa waxaa diiday Xafiiska Arrimaha Gudaha, bishii January 2025 -kii\".\nWuxuu markii dambe racfaan ka qaatay go'aankaas, waxaana ju socotay dib-u-eegis  xilligii uu dilku dhacayay.\nMa jirin dambi hore oo uu Haybe ka gaystay dalka UK, laakiin waxaa laga qabtay magaalada Derby 13kii December 2024-kii markii uu la murmay nin kale.\nMaxkamaddu waxay ogaatay in Haybe uu \"u orday waddada \" oo uu madaxa ku dhuftay ninkaasi, islamarkaana dadka Ingiriiska ugu yeedhay\"cunsuriyiin.\"\nDacawad-oogaha ayaa sidoo kale waxa uu ku eedeeyay in jabiyey daaqad ku taal dukaanka taleefannada ee Derby bishii Abriil.\nHaybe oo ay maxkamaddu ku heshay in uu cabbay saddex dhalo oo khamrada vodka iyo 10 dhalo oo biir maalintii uu dilka gaysanayay.\nLaga soo bilaabo subaxdii iyo horraantii galabnimada ayaa Haybe wuxuu muujiyey xanaaq wuxuuna ku hanjabay in uu naftiisa dilo iyo inuu dadka kale layn doono.\nIsaga oo faahfaahin ka bixinayay sidii uu dilku u dhacay ayaa Mr Mably KC wuxuu yidhi: \"Haybe wuu istaagay oo wuxuu galay bangiga. Waxii gudaha ka dhacay waxaa arkay dhowr macaamiil ah iyo shaqaale bangiga ka tirsan, waxaana dhacdada duubtay CCTV.\"\nWaxuu la soo baxay mindi, isaga oo aan bixin wax digniin ah iyo xilli loogu diyaargaroobo weerarkiisa. Waxa uu kala eegtay wadnaha.\nCidna si wacan uma ay ogaan karin waxa dhacay, maaddaama la galay xaalad jahawareer ah.\nNinka dilka gaystay ayaa markaas kaddib waxa uu bilaabay in uu si tarttib ah uga baxo bangiga oo uu bannaanka u lugeeyo. Waxa uu u muuqday nin deggan. Taas ayaana keentay in lagu jahawareero in ay wax dhaceen iyo in kale.\nMr Johal wuxuu ku dhacay dhulka isagoo mindida weli wadnaha kaga taagan tahay. Shaqaalaha bangiga ayaa wacay 999. Inkastoo la isku dayay in la badbaadiyo, haddana, Mr Johal waxa la sheegay in uu isla goobta ku dhintay saacaddu markay ahayd 3:16.\nMaxkamaddu waxa ay ogaatay in uu Nuur keliya ku sugnaa gudaha bangiga muddo aad u kooban.\nMaxkamaddu waxay laga hor sheegay in Haybe markii dambe la raadceeyay oo la qabtay dhowr saacadood kaddib, markii boolisku heleen isagoo hurda qolka jiifkiisa.\nBishii May 2023, waxa lala xidhiidhiyay dambiyo ka dhacay Talyaaniga, bishii xigtayna waxa laga qabtay Jarmalka isaga oo dhacaya baaskiillo. Booliska Berlin ayaa hadda ka hor uga tagay xero ay ku nool yihiin dad magangalyo-doon ah, kaddib markii lagu wargeliyay in uu is dilayo.", "date": "2025-10-30", "scraped_at": "2025-11-02T07:25:05.946873+00:00", "category": "news", "text_hash": "6a5fdea5b0c67c5f2cac9bd870e615f03866005e0ad965ab1a99c7cdde06af71", "minhash_signature": "1604305,1023805,16234825,314159,495511,13521139,12239801,875951,3146132,14522584,1132962,257877,8118134,4397651,9118051,1168758,15696383,4722226,2069227,8382291,3323661,7502485,4591546,1413077,6975317,4424406,12525656,4899402,23662524,10495198,6994496,222145,964542,7187762,4135855,5306715,4179853,5210072,7246089,3556907,7778370,18771079,8237771,547344,17025963,13788355,4418122,4778387,796623,16451653,12896467,13425123,19161205,23182818,1491811,20756624,333980,16406970,6468765,7266816,4866229,514094,3371241,11557034,6497103,2490164,4782482,22432551,3312971,4193425,6507190,4665457,1497153,7618827,2796147,3609633,1418311,14710118,5272245,32794,7449127,4292494,2636074,19726882,1595163,6899998,4112866,11996637,8094193,6439116,4069198,512611,3885091,777050,17244103,514311,2869657,786089,3489957,2524424,2319618,1641222,2624109,732475,20491862,44831966,7159775,1653939,22248567,14667727,1009201,7974319,1202377,13046771,2898467,13848758,2295038,2683542,15687521,1388721,6861063,2985777,6609111,8846775,8838884,8183957,8468088,24174"}
{"url": "https://www.bbc.com/somali/articles/c890jw7xd70o", "title": "Muxuu dhiig-karku ugu dhacaa hooyooyinka Soomaaliyeed xiliga dhalmada?", "text": "Xigashada Sawirka, Getty Images\nDaraasad cusub oo caafimaad ayaa sheegeysa in haweenka Soomaaliyeed ee xilliga foosha la qalo kuwaas oo dhabarka looga duro cirbada suuxdinta ay wajahaan khataro keenaya in cadaadiska dhiigooda uu hoos u dhaco.\nCilmibaarista oo lagu daabacay wargeysa BMC ee uurka iyo dhalmada ayaa diirada lagu saaray hooyooyinka ku dhala isbitaalka Recep Tayyip Erdoğan ee Muqdisho kaas oo hore loogu yaqaanay Digfeer.\nHaween gaaraya 320 oo lagu sameeyay qaliin ilmaha looga soo saaray xiliga dhalmada intii u dhexeysya bishii May ilaa iyo bishii July sanadkii hore ee 2024-kii ayaa lagu ogaaday in 79 boqolkiiba ay qaadeen xaalad u dhiigooda hoos u dhacayo intii qaliinka lagu jiray. Dhammaan haweenka waxaa laga suuxiyay laf-dhabarka. Arrintan ayaa keentay astaamo ay ka mid yihiin wareer, lallabo iyo suuxdin, waxaana mararka qaar dhacday in ay khatar galaan hooyada iyo ilmaha uurka ku jira.\nSuuxdinta laf-dhabarka cirbiada lagu duro waa tan ugu badan ee lagu sameeyo haweenka ku dhalaya Soomaaliya. Waxaa loo arkaa in ay tahay badqab, kana jaban tahay kuwa kale oo badan inkastoo iyadana khatarteedu leedahay.\nHeerka ay gaarsiisan tahay arrintan ee ah 78 boqolkiiba waa mid ka sareysay heerarka laga soo sheegay dalal ay ka mid yihiin Itoobiya, Pakistan iyo Colombia. Tani waxay muujineysaa in nidaamka caafimaadka Soomaaliya uu haysto cadaadis weyn oo ah in haweenka umulaya ay wajahayaan khataro waa weyn.\nKhubaradu waxay sheegayaan in daraasadan ay xoojineyso baahida degdegga ah ee loo qabo in la maalgeliyo daryeelka dhalmada. In sidoo kale sare loo qaado nidaamka iyo daawooyinka si loo xaqiijiyo in hooyooyink si fiican loo baaro ka hor inta aan lagu sameyn qaliinka dhalmada.\nEnd of Ugu akhris badan\nDaraasada waxay shaaca ka qaaday caqabadaha ay wajahayaan hooyooyinka Soomaaliyeed, waxayna hoosta laga xariiqay in baahi weyn loo qabo nidaam caafimaad oo ilaaliya hooyada iyo ilmaha dhalanaya.\nXigashada Sawirka, Getty Images\nHay'ada WHO waxay sheegtay qaliinka ilmaha lagu soo saaro in uu yahay kan ugu badan ee caloosha lagu sameeyo adduunka. Haweenka dunida ee qaliinka ku dhala waxay kordheen 21 boqolkiiba 2018-kii, waxaana la fialyaa in 30 boqolkiiba ay kordhaan marka la gaaro 2030-ka. Boqolkiiba 88 waxay qaliimadaas ka dhacayaan dalalka dhaqaalahooda uu meel dhexaadka yahay iyo kuwa uu hooseeyo sida ay sheegtay hay'ada caafimaadka adduunka ee WHO.\nDr. Cabdullaahi Siciid Xaashi waxa uu ka tirsan isbitaalka Recep Tayyip Erdoğan ee magaalada Muqdisho, waxa uuna BBC-da u sheegay in qaliinkan lagu sameeyo laf-dhabarka marka haweenku dhalayaan uu yahay mid badqabkiisu ka fiican marka la wada suuxiyo balse waxaa dhici kara dhibaatooyin badan.\n\"Marka dhabarka laga suuxiyo oo hooyada qaliinka lagu sameynayo waxaa imaan karo in cadaadiska uu hoos u dhaco, waaana uu keeni karaa waxyaabo badan oo qaar ay la xiriiraan habka la marayo, qaarna ay la xiriiraan hooyada uurka leh\"\nDr. Cabdullaahi wuxuu kaloo sheegay in ay tahay wax dhici kara in hooyada uu dhiigeedu isbeddelo inta ay ku jirto qaliinka.\n\"Badanaa waa wax la filayo inta hooyada qaliinka ku jirto in uu cadaadiska dhiiga uu kordho\" ayuu Dr. Cabdullahi oo intaas ku daray in laga hortagi karo dhibaatooyinka yimaada xiliga qaliinka, \"ka hortag ayaa la sameyn karaa, in hooyada dhanka bidix loo leexiyo marka qaliinka loo diyaarinayo, waxaa kaloo la sameyn karaa inta hooyada aan la qalin in biyo badan la siiyo\".\nDhakhtar Cabdullaahi wuxuu ku taliyay in marka qaliinka la sameynayo ay muhiim tahay in uu goob joog ahaado qof takhasus u leh si marka hooyada dhiigeeda uu karo wax looga qabto.\nSidoo kale dhaqaatiirtu waxay sheegeen in dhiirgarka si joogta ah loo lala socon karo hadii aan joogto loola soconna ay imaan karaan cudurro badan oo khatar ah. Wuxuu horseedi karaa cudurro sida kuwa wadnaha ama xitaa dhimasho.\nDhanka kale, waxaa la sheegaa in dhiigkarka uu yahay dilaaga aamusan. Cilmi baaris ay samaysay Hay'adda Caafimaadka Adduunka ee WHO ayaa lagu ogaaday in boqolkiiba afartan iyo lix dadka Afrikaanka ah ay qabaan dhiigkar heerkiisu aad u sareeyo, arrintaas oo keenaysa in qaaraddu ay kaalinta koobaad ka gasho caalamka oo dhan.\nCilmi baaristu waxay sheegtay in habka aan caafimaadka waafaqsanayn ee loo nool yahay ay ka dhigan tahay in dadka Afrikaanka ah ee u dhimanaya xanuunnada halista ah ay ka badnaan doonaan kuwa u dhimanaya xanuunada lakala qaado marka la gaaro sanadka 2030-ka.", "date": "2025-08-27", "scraped_at": "2025-11-02T07:26:05.623239+00:00", "category": "news", "text_hash": "a69b1be39947306c4440b71c24b0cc89e0824099579d58e7459ffaceb90d096e", "minhash_signature": "15474800,6546897,2440440,2614839,3789642,16284421,1668739,249750,25354890,3394342,9255924,2797203,6477447,657602,4703427,1865530,959244,3630222,1703001,116576,6835605,15632023,8816978,4436629,63775,2550877,12279247,519592,6396856,5707174,5472447,3291376,1823568,963950,787717,543178,42739,3871231,1589310,2377927,10062531,14370567,10968829,14510754,370516,4544943,18628215,3552068,8590316,2766892,4814418,9408977,1203152,1073574,2951939,4551280,2286945,2718394,14325440,270170,2670719,4507255,5853,17136320,22036880,8886808,6466794,6440612,4476511,950222,5955147,10632421,5414348,9432295,4124645,810094,132896,6899924,2515998,1349119,24079801,1325200,96361,13292574,9356930,386399,886929,918423,8428591,1265997,8306187,9100168,19534406,3155801,7448887,39980,3144797,14063420,3805640,2889954,802227,3884127,7042782,4468673,6217972,65677,20285603,102006,169146,5648974,2890806,2720229,392123,1163101,3512277,3401510,2555741,8204389,9147507,8162991,8992329,202450,3939182,7033231,8242913,15253973,5414650,4508291"}
{"url": "https://www.bbc.com/somali/articles/cly939n178xo", "title": "Waa kuma Raila Odinga, hoggaamiyihii mucaaradka Kenya ee geeriyooday?", "text": "Xigashada Sawirka, Reuters\nRa'iisul Wasaarihii hore ee Kenya Raila Odinga ayaa ku geeriyooday dalka Hindiya isaga oo ay da'diisu tahay 80 sano.\nRaila ayaa geeriyooday xilli lagu daweynayay isbitaal ku yaalla Hindiya, sida laga soo xigtay ilo qoys.\nOdinga, ayaa ifka kaga tagay xaas iyo saddex caruur ah.\nRaila Amolo Odinga (wuxuu dhashay 7 Janaayo 1945)\nRaila Odinga wuxuu ku dhashay Isbitaalka Maseno Church Missionary Society Hospital, ee Maseno, Degmada Kisumu, ee Gobolka Nyanza 7 Janaayo 1945. Sidoo kale taageerayaashiisu waxayu yaqaaniin Agwambo, waa siyaasi Kenyan caan ka ahaa muddo dheer.\nRaila oo ahaa 80 jir ayaa lagu xasuusan doonaa doorkii uu ka qaatay dib u soo celinta dimuqraadiyadda xisbiyada badan iyo ilaalinta xuquuqda aadanaha ee Kenya.\nEnd of Ugu akhris badan\nWuxuu ahaa Ra'iisul Wasaarihii ugu dambeeyay ee Kenya, Waxaa la doortay 2008, waxa uuna hogaaminayay dawlad wadaag ah 2008 ilaa 2013.\nXigashada Sawirka, AFP/GETTY\nRaila Odinga waxa uu ahaa nin aad uga soo dhex muuqday siyaasadda Kenya iyo Afrika, isaga oo dhiirri galiyay jiil dhan oo qaaradda ah.\nWaxaa uu dhawaan u tartamay xilka gudoomiyaha midowga Afrika oo markii dambe uu ku guuleystay Maxamuud Cali Yuusuf oo ah hadda ah gudoomiyaha midowga Afrika.\nOdinga ayaa shan jeer ku guul darreystay tartanka madaxwaynanimada  Kenya, waxaana ugu dambeysay doorashadii 2022-ka.\nRaila waxaa dhalay madaxweyne ku xigeenkii koobaad ee dalka Kenya, Jaramogi Oginga Odinga.\nIn ka badan 20 sano ayuu xildhibaan ka ahaa xaafadda isku raranta ah ee ugu wayn Afrika ee Kibera.\nMr Odinga waxa uu leeyahay dad aad u jecel, taageerayaashiisuna waxay ku naanaysi jireen \"Baba\" (Aabbaha), \"Agwambo\"  iyo \"Tinga\" (Cagaf) - oo laga soo minguuriyay astaantii xisbigiisa ee doorashadii 1997-kii.\nWaxa uu dib uga soo noqday dalka dibaddiisa ka dib markii ay dib u yagleeleen siyaasadda xisbiyada badan ka hor inta aan loo dooran xildhibaan. Waxa uu door muhiim ah ka ciyaaray soo afjaridda tobanaan sano oo xukunkii xisbiga Kanu ka dib markii uu taageeray Mwai Kibaki oo u tartamayey madaxtinimada 2002dii.\nMarkii ugu horraysay ee uu madaxweynenimo isku dayay waxay ahayd 1997-kii, markaas oo uu galay kaalinta saddexaad.\nOdinga iyo taaageereyaashiisu waxay rumaysan yihiin in laga boobay guushii uu gaaray 2007-dii, markaas oo uu hogaaminayay xisbiga ODM, isaga oo la tartamay Kibaki.\nDoorashadaas ayaana ahayd middii horseedday rabshadihii qabaa'ilka ku salaysnaa ee sababay in ay dhintaan 1,300 oo ruux, ayna ku baro kaceen 600,000.\nXigashada Sawirka, AFP\nWuxuu soo noqday ra'iisul wasaarihii ugu horreeyay ee Kenya, jagadaas oo la abuuray kaddib heshiiskii qaran ee lagu gaaray in la soo afjaro rabshadihii ka dhashay doorashadii 2007-2008, halkaasoo uu dowlad awood qeysi ah uu la dhistay madaxweyne Mwai Kibaki.\nMr Odinga ayaa ah siyaasi caan ku ah dhisidda isbahaysiyada siyaasadda.\nWaxa uu hore u ahaa maxbuus siyaasadeed, waxana uu haystaa rikoorka in uu yahay maxbuuskii ugu muddada dheeraa ee Kenya. Halgankii uu kaga soo horjeeday kalitalisnimada hal xisbi waxa la xiray laba jeer (laga bilaabo 1982 ilaa 1988 iyo 1989 ilaa 1991) intii lagu jiray xukunkii Daniel Arap Moi.\nKadib isku day afgambi oo dhacay kowdii Agoosto ee sanadkii 1982 dii, Raila Odinga waa la xiray waxaana ku dhacay xukunno kala duwan, oo ay ka mid tahay khaa'inul waddannimo oo ah tii loo xiray iyada oo an cadeyn loo hayn.\nGuddiga dib u heshiisiinta iyo cadaaladda dhabta ah ayaa loo sheegay sanadkii 2011 in Odinga uu xariir la lahaa maskaxdii ka dambeysay afgambiga. Odinga mar walba wuu iska diidaa in uu ku lug lahaa afgambiga.\nWaxa uu xirnaa lix sano ka dib markii lagu eedeeyay in uu ku lug lahaa isku daygii afgambi ee 1982-kii, ka dibna mar kale ayaa loo xiray in uu dabada ka riixayo dimoqraadiyad hoos timaada xukunka hal xisbi.", "date": "2025-10-15", "scraped_at": "2025-11-02T07:27:05.761613+00:00", "category": "news", "text_hash": "4bdb19fd126ff25a534360fb36b140370bdc841a2c09a90ea8c4d8876a14f65d", "minhash_signature": "1601351,20639015,16512379,774370,2478618,14239041,2510378,9760737,3966871,4654051,2357238,637657,2472779,1527237,3494043,1100624,8612212,10774366,3779146,6320346,1991854,2201934,2623630,4565357,36868268,4165458,2960429,34767811,8611214,4839376,10180750,7793402,7414410,4288782,8921410,16276864,12333680,2820412,899403,3175453,6155751,38735864,8369690,13142025,118124,3938675,1406767,5800846,317203,23648615,464913,16683233,6518493,8237146,3364599,9587049,10786584,847300,10223313,5604777,4423078,4495839,15718941,17354743,1262907,1180061,1394607,5582603,778508,9111978,1696064,3089610,293361,16805314,17882958,7231659,6532334,14147160,3913645,3501303,966969,1454270,4450639,999969,9050703,12733841,12614222,4601132,2977499,1638173,2702250,528144,370661,194087,14309372,8116896,9935128,11662337,1227304,4247534,935821,580593,33375090,2787500,640641,2965879,5464116,4849185,1918524,8264880,444848,2231780,1604640,10000258,2260651,7622930,268885,1185210,5060406,15995563,2442449,36238,9093619,7267555,1941164,2646577,4280972,4657579"}
{"url": "https://www.bbc.com/somali/articles/cqx39n43195o", "title": "Nin ku qasbanaaday in uu saacaddiisa qaaliga ah ku beddesho sanbuus iyo hadal heyn ka dhalatay", "text": "Xigashada Sawirka, Getty/social media\nKa warran haddii aad ku safrayso tareen haddana aad gaajooto... Tareenka wuxuu istaagayaa saldhig, markaas waxaad iibsanaysaa laba sambuus. Laakiin haddii aad u baahato inaad saacaddaada casriga ah ku iibsato laba xabbo oo saanbuus ah,  sidee ayaad dareemi lahayd?\nDhacdo la mid ah taas ayaa dhowaan ka dhacday Saldhigga Tareenka ee Jabalpur, oo ku yaal gobolka dhexe ee Madhya Pradesh ee dalka Hindiya.\nMuuqaal laga duubay dhacdadan ayaa si weyn ugu faafay baraha bulshada. Dadku waxay su'aalo ka keenayaan dabeecadda iyo dhaqanka kakan ee ganacsatada waddada dhinaca wax ku iibiya ee saldhigga u dhow sugan, iyagoo sidoo kale ka doodaya kalsoonida lacag-bixinta internetka iyo amniga safarka tareennada.\nRuntu waxa ay tahay in dhacdadani dhacday laba maalmood ka hor, 17-kii Oktoobar, fiidkii ku dhowaad 5:30 galabnimo, iyadoo ka dhacday madal lambarka shanaad.\nXigashada Sawirka, screen grab from viral video\nMuuqaalka waxaa laga arkayaa nin ka ordaya barta tareenka laga raaco ama looga dego si uu u qabsado tareenka, balse nin kale ayaa garabka qabanaya.\nTareenka oo dhaqaaqaya awgiis, ma awoodo xitaa inuu qaato sambuusaha, laakiin ninka saanbuusaha iibinaya ayaa ku khasbaya inuu bixiyo lacagta. Rakaabka oo xaalad adag ku jira ayaa isku dayaya inuu lacagta ku bixiyo aaladda lacag-bixinta internetka, balse lacagtu ma gudbeyso.\nEnd of Ugu akhris badan\nMarkuu aad ugu qasbanaado, wuxuu iska siibayaa saacaddiisa (saacad casri ah), wuxuuna ku wareejiyaa ninka saanbuusaha, ka dibna ninkii wuxuu siinayaa laba ama afar xabbo oo saanbuuse ah si uu isagu u sii daayo.\nMuuqaalka intaas ayaa kaliya laga arkayaa.\nLama oga inuu rakaabku horey u cunay saanbuusaha iyo in kale, ama in dhacdadani kaliya ay ku saabsanayd codsiga uu saanbuusaha ku weydiistay.\nQoraal uu baraha bulshada soo dhigay maamulka tareennada ee Jabalpur (DRM), isagoo ka jawaabaya qofka video-ga la wadaagay, wuxuu sheegay in:\n\"Ninka saanbuusaha iibinayey la aqoonsaday, ciidanka ilaalinta tareennada (RPF) ay arrinta la wareegeen, ninkana waa la xidhay, tallaabana laga qaaday si laysanka loogala laabto.\"\nSidoo kale, akoonno kala duwan ayaa sheegaya in saacaddii la helay.\nXigashada Sawirka, SOCIAL MEDIA\nXatooyo, jeebsiibid ama dharka oo layska dhufsado waa waxyaabo caan ka ah baraha tareennada, laakiin dhacdo tan oo kale ah oo qofku ku khasbanaanayo in uu dhiibo alaabtiisa waa mid naadir ah.\nDareenka dadka u muujiyeen qofka safrayay waa mid cad haddeer, laakiin dadka qaar ahyaa aad u dhaliilaya dabeecadda dhaqanka suuban ka baxsan ee qofka wax iibinaayay, sidoo kale waxay isweydiinayaan sida laysugu haleyn karo lacag bixinta Online-ka ah.\nGuddigga jidadka tareennada ayaa lagu ammaanay talaabada degdegga ah ee ay qaadeen, iyagoo lala wadaagay soo jeedinno badan. Mid ka mid ah ciiwaannada wax daabacay ayaa taladaan maamulka la wadaagay isagoo dareen u muujinaya saanbuus gadaha \"Qof qani ah ma'aha, sidaas darteed intii lagala noqon lahaa laysanka, waa in la ganaaxo.\"\nWaloow kuwo badani ayna ku qanacsanayn keliya in lagala noqdo shatiga uu ku shaqaysto, qaar badani waxayba qabaan in laga qaado talaabooyin adag uu jeelna u qalmo.\nQof wata ciiwaanka la dhaho \"Honest Cric Fan\" ayaa muuqaalka ku baahiyay barta bulshada ee X, isagoo qoray:\n\"Dhacdo foolxun ayaa ka dhacay Saldhigga Tarenka ee Jabalpur. Rakaab ayaa dalbaday saanbuuse, balse lacag bixinta ma aysan shaqaynin iyadoo la adeegsanayo PhonePe (Nidaam lacag bixineed oo Online ku shaqeeya) kadibna waxaa bilowday in tareenku dhaqaaqo, arrintaas yar oo sidaas ah awgeed ninka saanbuuska iibinayay ayaa garabka qabtay rakaabka\"\n\"Waxuu ku eedeeyay rakaabka in uu wakhtigiisii lumiyay, waxuuna si xoog ah uga dalbaday lacagta saanbuuska. Rakaabkii waxuu ku khasbanaaday inuu saacadiisa bixiyo si'uu u raaco tareenka. Hadda xiitaa ku safridda tareenka dalka kuma aha mid amaan ah\"\nQoraal kale oo uu raaciyay waxuu ku xusay in Wasaaradda Tareennada ,Rail Seva, Jabalpur, DRM, komishinka Jabalpur, isagoo dalbaday in tallaabo adag laga qaado ninka saanbuuska gada.\nSidoo kale, waxuu ku taliyay in marka aad safrayso ugu yaraan lacag 500 oo rubi ah oo cadaan ah aad wato maadaama mararka qaar hababka lacag bixinta Online-ka ah ayna shaqaynin.\nIntaa waxaa dheer, waxuu ku taliyay in qofku yeesho ugu yaraan laba akoon oo bangiyo kala duwan ah, si haddii mid shaqayn waayo kan kale lacagta ugu bixiyo.\nQof wata magaca la yiraahdo Vikram Pandey ayaa qoray:\n\"Ma ceebaa  qofka inuu isku dayay inuu iibsado saanbuusaha? Sow sax ma aha ninka saanbuusaha  iibinaya inuu dalbado xaqiisa? Miyayna ahayn in aad lacag caddaan ah la wato markaad safrayso?\"\nCricket fan-ka ayaa ku jawaabay:\n\"Runtu waxay tahay, xitaa ma uusan qaadan saanbuuska.\"\nKadib, fiidiyow kale ayaa la baahiyay, kaas oo muujinaya tareen si buuxda u buuxsamay, halkaas oo nin samosas iibinaya uu dhex socdo isagoo dambiil saanbuuse ah madaxa ku sida. Dhallinyaro badan oo ku fadhiya sariiraha sare ayaa ka xadaya saanbuusaha dambiisha, una qaybinaya asxaabtooda.\nDad badan ayaa hadda leh in hay'adda tareenada ay tahay inay rakaabkaas raadiso oo saacaddiisa u soo celiso, isla markaana ninka saanbuusaha iibinaya la ganaaxo, lacagtaasna la siiyo qofka dhibka loo geystay.\nXaaladaha noocan oo kale ah, isku xidhka internet-ka ayaa door muhiim ah ka ciyaara. Xidhiidh liita ayaa sidoo kale keeni kara dhibaatooyin ku saabsan bixinta lacagta online-ka. Taasi waa sababta loo yiraahdo: lacag caddaan ah lama beddeli karo.\nXigashada Sawirka, Thinkstock\nQof wata magac la yidhaahdo Shano Indian ayaa qoray:\n\"Marka aad tareen ku safrayso, kaliya wax ka iibso kuwa wax wareejinaya marka aad lacag caddaan ah wadato, sababtoo ah shabakadaha moobilka si fiican uma shaqeeyaan inta lagu jiro safarka tareenka. Sidaas darteed, ma awoodid inaad ka faa'iidaysato adeegyada lacag bixinta digital-ka, mararka qaar shabakadahu gabi ahaanba ma shaqeeyaan ama aad bay u daciif tahay, taasoo ka dhigaysa in la sameeyo macaamil online ah mid aad u adag.\"\n\"Haddii taasi dhacdo, wuxuu kugula doodi karaa [qofka wax wareejinaya] goobta tareenka , waxaa dhici karta inuusan kuu oggolaanin inaad fuusho tareenka, ama uu ku cabsi geliyo si uu kuugu joojiyo halkaas. Tani waxay carqaladayn kartaa safarkaaga. Sidaas darteed, haddii aad rabto inaad wax ka iibsato tareenka ama saldhigga, lacag caddaan ah ha wato.\"\nXigashada Sawirka, SOCIAL MEDIA\nHay'ad aan dowli ahayn oo la yiraahdo National Crime Investigation Bureau ayaa ku qortay barta X:\nHay'ad aan dowli ahayn oo la yiraahdo National Crime Investigation Bureau ayaa ku qortay barta X:\n\"Kani ma [wax] iibiyihii baa mise waa tuugga saldhigga?\"\nWaxay u tageen Wasaaradda Tareenada iyo Wasiirka Tareenada Ashwini Kumar, iyagoo waydiiyay:\n\"Goorma ayaa tuugada noocan ah la xakameyn doonaa?\"\nQof wata magac la yiraahdo Vidya Yadav ayaa dhacdadan xustay iyadoo waydiisay:\n\"Tani ma daacadnimo baa mise waa is qasbid cusub oo la bilaabay?\"\nWaxay sidoo kale waydiisay:\n\"Dadku waxay tareen ku safrayaan boqollaal ama kumannaan kiiloomitir oo ka fog guryahooda iyo qoysaskooda. Marka Indian Railways ma qaadan karto mas'uuliyadda badbaadada rakaabka miyaa?\"", "date": "2025-10-22", "scraped_at": "2025-11-02T07:28:05.766516+00:00", "category": "news", "text_hash": "0aefd469235f858c18080668805a9db6b614caafeca43739de8ff22c04e82fc1", "minhash_signature": "137171,6190254,11526668,2921342,2836675,3595564,838581,3776738,1799133,3435336,5457205,1669606,2886916,3974561,728994,10883019,2587235,2525421,13114747,4407137,4900630,6500958,737322,2517030,8423017,53861,4004522,5647429,1653043,864813,7313647,3820046,8528958,830508,3015969,3391005,1677591,897286,8562613,2109588,4742132,2967761,726394,2773207,4434782,91690,2235277,5170264,2736258,1437708,1121171,19641355,1246368,6069816,533858,568899,14798887,5633828,2618463,10249981,1698648,3711488,2804650,2397789,9727373,10588478,678095,6701288,59393,2256736,1719061,6232346,848487,6601209,129658,2724383,4279777,8895942,4928762,4359903,9736164,13945896,442892,119308,5356068,5466472,2339199,170982,2158,3551074,4098700,7545064,3134551,9034660,2294824,1658192,2723739,1791010,1492760,682546,10897134,2523930,2183435,2678169,3393382,3381385,2929519,5785652,4912411,1629336,3175348,1310355,2426378,4753058,1382045,10383913,751112,3058206,17988705,247472,4960820,4756337,8793050,1783022,3027957,2651314,10345326,2313189"}
{"url": "https://www.bbc.com/somali/articles/c0l18xyz3xdo", "title": "Wax ka ogow daawadan laga yaabo in aad u cuntid gaas, laakiin loo adeegsado ilma iska soo xaaqidda", "text": "Xigashada Sawirka, Getty Images\nIlma iska soo xaaqidda, waa wax kala qeybsanaan ballaaran ka dhex abuuray waddamo badan oo caalamka ah, waxaana laga mamnuucay qaar kamid ah dalalkaas.\nArrintan ayaa sidoo kale saameyn wanaagsan ku leh nolosha malaayiin haween ah oo dunida ku nool.\nKuwa go'aansada inay ilmaha iska soo xaaqaan, waxay keliya u mari karaan laba waddo, oo kala ah qalliin ama arrimo caafimaadkooda la xirriira.\nHay'adda Caafimaadka Adduunka (WHO) ayaa sheegtay in la adeegsan karo dawooyinka qaar si ilmaha loo soo saaro.\nWaxay sheegtay in hadii la heli waayo dawada mifespristone, la isticmaali karo dawada kale ee misoprostol keliya.Ha yeeshee dawadan, looguma talo galin ilma iska soo rididda. Waxaa loo isticmaalaa gaaska caloosha, waxaana suuqa ay soo gashay bartamihii 1980-yadii iyadoo markaas la oran jiray Cytotec.\nHaween ka soo jeeda koonfurta waddanka Mareykanka ayaa noqday dadkii ugu horeeyay ee ogaaday in siyaabo kale loo isticmaalo karo dawada, oo ah in loo adeegsan karo ilma iska soo xaaqidda.\nEnd of Ugu akhris badan\nXigashada Sawirka, Getty Images\n\"ani waxay dhacday sannadihii 1980-meeyadii, haweenka oo dhaqaale ahaan hooseyay, waxay bilaabeen inay ogaadaan in daawada loo sameeyay in lagu daweeyo gaaska caloosha ku dhaca sidoo kale loo isticmaali karo ilma iska soo rididda,\" ayay tiri Dr. Georgina Sánchez Ramírez oo ah qoraaga buugga \"Xaqiiqooyinka iyo caqabadaha daawooyinka ilmo iska soo rididda ee Mexico.\"\n\"Sidaa awgeed, sida caadiga ah, warkan ayaa gaaray dad badan, waxaana bilaabatay hadal heynta la xiriita suurtagalnimada dawadan loogu isticmaalo karo in ilmaha la isaga soo rido,\" ayuu yiri dhaqtar ku takhasusay cudurada haweenka iyo cafimaadkooda oo ka howl gala xarunta Frontera Sur oo ku taala dalka Mexico.\nDawada Misoprostol waxaa la soo saaray sanadkii 1973-dii, waxaana soo saartay shirkadda sameysa dawooyinka ee Searle. Inkastoo dawada loo soo saaray in loo isticmaalo xanuunada caloosha, waxaa la ogaaday in saameynta ka dhalan karto isticmaalkeeda ay tahay inay sababi katro in ilaha caloosha ku jira uu soo dhico.\nDabayaaqadii 1980-yadii, iyadoo laga jawaabayo sharci ahaanshiyaha ilma iska soo rididda dalka Brazil, haweenka ayaa bilaabay inay isu tilmaamaan dawadaas si loogu isticmaalo ilma iska soo xaaqidda.\nSanadkii 1987-dii, baarayaasha Faraansiiska ayaa soo saaray nooc kamid ah dawada mifepristone, oo marka lagu daro nooca misoprostol, labaduba loo adeegsan karo in ilmaha la isaga soo xaaqo.\nBalse xiligaas, haweenka koonfurta Mareykanka, waxay si aad ah u isticmaalayeen misopristol, sida uu sheegtay Dr. Sanchez Ramirez.\n\"Ka hor inta aanan dawada mifepristone lagu soo saarin sheybaar ku yaala dalka Faransiiska, haweenka koonfurta Mareykanka waxay hore uga war hayeen qiyaasta iyo sida loo isticmaalayo dawadan loo soo saaray in lagu daweeyo gaaska caloosha\", ayuu yiri khabiirka.\nXigashada Sawirka, Getty Images\nDaawada ilmaha la isaga soo rido uma baahna hannaan qaliin, waxaana inta badan lagu sameyn karaa xitaa adigoo gurigaaga ku sugan.\nWaxaa inta badan la isku daraa dawooyinka kala ah mifepristone iyo misoprostol, si ilmaha la isaga soo xaaqo.\nDawada marka hore la isticmaalo waa mifepristone, taas oo joojisa hormoonka progesterone, oo jirku u baahanyahay, si uu u koro ilmaha caloosha ku jiro.\nDawada labaad ee misopristol, waxaa la isticmaalaa 24-48 saacadood kadib. Saacado yar kadib isticmaalka dawadan, waxaa qarxa minka, taas oo keenta xanuun, dhiig bax iyado markii dambena sababto dilan.\nHay'adda Caafimaadka Adduunka ee WHO, waxay sheegtay, hadii mifepristone aanan la heli Karin, la isticmaali karo misopristol.\nMareykanka oo kale, in ka badan kala bar ilma iska soo xaaqidda la fuliyo, waa kuwa loo isticmaalo dawooyin.", "date": "2025-02-21", "scraped_at": "2025-11-02T07:29:05.837733+00:00", "category": "news", "text_hash": "b4c709a2500b971c2bfbf2e20b044225076cb6ed3a72701371a205d9b1fdbdc6", "minhash_signature": "4822524,19706851,14424311,27574082,19890921,12848164,5574841,3064352,11570982,647284,47366914,15265982,2704401,8540034,34622174,11583487,5274279,10305441,11632468,5821204,3348979,13966309,4554607,4436629,16159873,873943,11196695,9867195,6328865,4271005,16775913,1600104,21936222,10594839,1776585,8378287,3317939,2171221,7931221,2644737,8876315,21636305,162985,14718292,23103105,8418137,14115384,4351749,8907845,5759614,2747314,21515587,14701767,1460446,281196,12087564,401511,326791,1045188,14312844,10164523,2804050,12852227,3962308,5701414,2569301,1165940,14156634,1926466,7072119,19778186,13366288,1133326,1361610,28404486,12515669,4393727,17406850,11264973,3012022,2549030,5307167,18413498,1794640,3886588,11870977,22371963,4291606,3357729,26498462,5470219,18747629,15708629,3292147,3847641,338941,13927418,2022488,1944376,17033303,15736206,1368428,2833521,2566929,23556338,2479063,3199227,2839100,3157292,2600848,36138803,5204529,1447688,1030067,2777299,4250739,11712984,7359653,4507385,12225708,9392141,2069154,3981543,7826454,528602,1941405,12802265,408168"}
{"url": "https://www.bbc.com/somali/articles/cvg4rv11gr6o", "title": "Maxay tahay heesta Soomaaliga ah ee uu adeegsaday Aqalka Cad ee Mareykanka?", "text": "Xigashada Sawirka, ABC\nMuuqaal dhowaan lagu baahiyay barta Aqalka Cad ku leeyahay TikTok ayaa waxaa la dul saaray hees Soomaali ah, tani waxay si weyn falcelin ugu abuurtay baraha bulshada iyadoo dadku is weydiinayeen sababta Aqalka Cad u adeegsaday heestan Soomaaliga ah.\nLama raacin muuqaalka faallo ku saabsan heesta laakiin waxaa ciwaan looga dhigay muuqaalka, \"Ma waxaad leedahay dowladda ayaa loo xiray arrimo la xiriira muhaajiriinta aan sharciyeysnayn?\".\nDowladda Mareykanka ayaa shaqadeedu istaagtay dhowaan kadib markii  labada xisbi ee Jamhuuriga iyo Dimuqraadiga ay ku guul-darreysteen inay isla meel dhigaan oo ansixiyaan sharci maaliyadeed lagu sii wadi lahaa maalgelinta adeegyada dowladda bisha Oktoobar iyo wixii ka dambeeya.\nSawirrada la saaray heesta ayaa ah qaar ka mida xildhibaannada xisbiga Dimuqraadiga ee ka kala tirsan Aqalka Kongareeska iyo Senate-ka.\nSidoo kale waxaa sawirrada muuqaalka ee heestan la dulsaaray ku jirta muhaajiriin dhowr qof ah oo tallaabaya darbiga xadka Maraykanka tii oo la ogyahay in maamulka Trump uu qaaday tallaabooyin ka dhan ah soo galootiga.\nMacluumaadkan waxaa daabacay TikTok.  Waxaan dalbanayenaa fasaxaaga ka hor inta aan la furin, waxaa laga yaabaa inay isticmaalayaan cookies iyo farsamooyin kale. hadii aad u bahato akhri TikTok xeerarka cokie iyo kan ku saabsan xogta gaarka ah ka hor inta aadan aqbalin. si aad u aragto xogta guji ‘aqbal oo soco’.\nDhammaadka TikTok boggan\nMacluumaadkan lama heli karo\nXigashada Sawirka, SOCIAL\nHeestan waxaa la yiraahdaa ''Gorof\" waana hees ay muddo dhowr iyo soddon sano ka hor qaadday fannaanadda Sahra Abuukar (Sahra Dawo) oo ka tirsanayd kooxdii Durdur ee Soomaaliya, haatanna deggan Mareykanka.\nEnd of Ugu akhris badan\nFannaanadda oo aan la xiriirnay ayaa ka gaabsatay inay ka hadasho heestan.\nDad badan ayaa siyaabo kala duwan u micneeyay sababta uu Aqalka Cad usoo qaatay heestan, balse Cumar Cali Xasan (Seerbiya) oo uruuriya xogta fanka iyo fannaanka isla markaana buug ka qoray ayaa BBC u sheegay in loo aaneyn karo dhowr sababood.\n\"Waan arkay muuqaalkan. Sideedaba fanku waa luuqad caalami ah oo dunida dhan ka dhaxaysa. In hees la xiiseeyo kuma xirna in la fahmaayo erayadeeda keliya, mararka qaar waxaa la xiisayn karaa masraxa heesaaga iyo gudbintiisa, marna laxanka, marna muusigga oo isna ah ta'liif kale oo qiimeynteeda leh,\".\n\"Tan waxay muujinaysaa sida fanku u yahay luuqad caalami ah oo cidna gaar u ahayn.\" Ayuu yiri.\nXigashada Sawirka, Cumar Seerbiya/Facebook\nHeesta miraheeda waxaa ka mid ah:\nHaddaan gam'i waayo habeenkii\nGalgashoonan seexan\nSidii Galawgii dhawaaqo\nHay gawdhine ii garaab\nGu' baa da'ay baa la yidhi\nGeel baa dhalay baa la yidhi\nAan soo godlee  gorofka keen\nErayada waxaa iska leh abwaankii Maxamed-Cali  Axmed kaariye, halka laxankuna uu saaray fannaan Daa'uud Cali Mahdi (Daa'uud C Masxaf) oo labaduba geeriyooday.\nHeesta waxaa sanadkii 1981 ku luqeysay Sahra Dawo oo xilligaas degganeyd magaalada Muqdisho.\nKa sokow adeegsida heestan Aqalka Cad, waxaa jira dad caan ah oo Maraykanka kasoo jeeda oo barta TikTok soo galiyey muuqaalladooda, iyagoo ku ciyaaraya heestan.\nXigashada Sawirka, Getty Images\nLacagta lagu maalgeliyo dowladda Mareykanka ayaa go'day toddobaadkii hore kadib markii xisbiga Jamhuuriga ee Madaxweyne Donald Trump uusan heshiis la gaarin xisbiga mucaaradka ee Dimoqraadiga ah oo ku saabsan sida loo ansixinayo sharciga kharashaadka.\nTani waxay keentay in qaar ka mid ah balse aan dhammaan ahayn adeegyada dowladda Mareykanka si ku-meel-gaar ah loo joojiyo, iyo in 40% shaqaalaha dowladda - ilaa 750,000 oo qof - la geliyay fasax mushaar la'aan ah.\nXisbiga Jamhuuriga ayaa haysta labada aqal ee Congress-ka, laakiin Aqalka Sare oo ah aqalka sare ee sharci-dejinta waxay ka hooseeyaan in ay helaan 60 cod oo looga baahan yahay ansixinta sharciyada kharashaadka.\nSidaas darteed, Dimoqraadiyiintu waxay halkan ku leeyihiin saameyn. Waxay diideen inay taageeraan sharci ay Jamhuurigadu soo bandhigeen, kaas oo ay sheegayaan inuu ka dhigayo daryeelka caafimaadka mid qaali ku noqda dadka Mareykanka ah. Mucaaradkani wuxuu salka ku hayaa in la horumariyo yoolalka siyaasadeed ee Dimoqraadiyiinta ee dhinaca daryeelka caafimaadka.\nWaxay codsanayaan in la kordhiyo dhiirrigelinta canshuur dhaafka ee dadka Mareykanka ah ka dhigta caymiska caafimaadka mid jaban kuwaas oo qorshuhu yahay inay dhacaan iyo in la laalo go'aannada Trump uu ku jaray barnaamijka Medicaid. Waxay sidoo kale ka soo horjeedaan jarista miisaaniyadda xarumaha xakameynta cudurrada (CDC) iyo hay'adaha cilmi-baadhista caafimaadka ee Qaranka (NIH).\nSharcigii ku-meel-gaadhka ahaa ayaa horay looga ansixiyay Aqalka Wakiillada, oo ah aqalka hoose, balse wali lama ansixin Aqalka Sare.", "date": "2025-10-13", "scraped_at": "2025-11-02T07:30:06.209238+00:00", "category": "news", "text_hash": "1fdc1e1f2246f31ec1252a905fc071f3b17ee941580f7bb806b0741b871e97d7", "minhash_signature": "1373772,2932676,17169987,4809817,2157979,26394266,786621,2454705,7213753,6637962,5572730,504298,13418916,8204027,5012267,13594186,2453785,3619320,1766657,24481371,21482466,334126,2061260,4436629,372846,15656013,8960615,5647429,16604365,5134825,8060874,323719,4751149,6622463,6956069,2493052,4661612,4044972,7560604,12996234,2426660,5673898,5533976,4321393,93331,3729161,1725206,9737757,2941447,1452371,5099152,13756749,7278674,974144,193197,12857943,298870,714052,5469946,2002187,5769210,9772612,7005352,8792922,43878382,1643023,6266271,4058588,14869873,17051953,619253,386450,14953688,9432295,3009497,1570411,9470274,7911291,405634,483078,1883201,4100812,438553,2322765,3170458,4223754,1040586,432831,14915217,5880364,1364907,2006477,1038617,10354874,12761642,11429213,19132796,3813326,1273351,6622145,7545656,1726076,5579532,4191611,12644345,2090650,15080628,12792140,563038,3436522,737846,327327,15971504,6486217,5366069,5600553,6051920,575644,7312505,3695279,1353405,1063304,2046748,6994065,6081721,226557,3553628,744484"}
{"url": "https://www.bbc.com/somali/articles/c4gw8x9j95ro", "title": "Shaambadu timaha ma soo celisaa? Afar khuraafaad oo maanta kadib aad iska iloobi doonto", "text": "Xigashada Sawirka, Getty Images\nDhamaanteen waxaan doonaynaa in aan lahaanno timo qurxoon oo caafimaad qaba, qaabab kala duwanna loo hagaajin karo.\nTimo hagaajintu waa suuq weyn oo ku kacaya £5.8 bilyan UK oo kaliya.  Waxaa jira waxyaabaha timaha loogu tala galay oo aan xad lahayn, iyo xayeysiimo baraha bulshada lagu arko, kuwaasoo qofka ka weeciya in uu helo waxyaabaha aasaasiga ah ee uu u baahan yahay.\nRuntu waxay tahay in helitaanka timo caafimaad qaba aysan ku xirnayn lacag badan oo la kharash gareeyo ama in la raaco qaabab adag.  Waa in la helo waxa loo baahan yahay ee sahlan.\nEva Proudman oo ah khabiir baratay caafimaadka timaha iyo maqaarka madaxa, iyo Tracey Walker oo ka tirsan xarun ka shaqaysa caafimaadka maqaarka madaxa iyo timaha, ayaa kashifay afar khuraafaad oo ku saabsan sida aad timahaaga u xanaanaynayso.\nXigashada Sawirka, Getty Images\nWeligaa ma qarqartay adigoo biyo qabow ku mayranaya si aad u hesho Timo iftiimaya?\nHagaag nasiib wanaag waad joojin kartaa inaad taas samayso oo aad ku raaxaysato dhaqid diiran oo raaxo leh sida Proudman ay leedahay biyaha qabow timahaaga kuma daraan wax iftiin dheeraad ah.\nEnd of Ugu akhris badan\n\" Looma baahna in timahaaga lagu dhaqo biyo qabow oo qaboojinaya maadaama aysan waxba qaban\" ayay tiri. \"Waxa aad uga muhiimsan waa sida aad timahaaga uga ilaalin lahayd kiimikada, kulaylka iyo deegaanka aad ku jirto\".\nXigashada Sawirka, Getty Images\nHaddii aad tahay qof rajaynaya inuu hagaajiyo darafyada timaha isagoon booqan timo-jareyaasha, waad ka xumaan doontaa inaad ogaato timo jarista inay tahay xalka kaliya.\nProudman waxay sharxaysaa in halka ay tintu ku dhamaato ama darafka uusan jirin qaab fudud oo lagu hagaajin karo.\nWalker ayaa iyadana leh: \"Haddii aad u malaynayso in timuhu jabayaan oo aad ku eegto mikroskoob, waxay ku dhowdahay inay u ekaato sidii inay jiraan laba ama saddex taako ama biin oo kale oo timaha haya.\n\"Alaabooyinka suuqa ku jira waa sida nooc xabag ah oo timaha mar kale dib u dhigaya si ay u muuqato mid ka sii fiican.\"\nWaxay sheegtay in kuwani ay yihiin hagaajin ku meel gaar ah, waxayna ka digaysaa in aan lagu mashquulin in lacag badan lagu kharash gareeyo alaabada ballan qaadaysa xalka.\nProudman waxay kaloo leedahay sheegashooyinka ah in timaha oo la gooyaa ay ka dhigi karto inay dhaqso u koraan waa been.\n\"Suurtagal ma aha in timahaagu si degdeg ah u koraan, sidaa darteed badeecad kasta oo sheeganaysa in taas awooddo waa been\".\nXigashada Sawirka, Getty Images\nWaxaa laga yaabaa inaad la kulantay dad ku dhaartay inay ku guuleysteen inay timahooda u tababaraan inay \"is-nadiifiyaan\" iyaga oo u ogolaanaya inay si aan caadi ahayn u dhaqdaan ama aysanba u dhaqin.\nLaakiin Proudman waxay leedahay \"samaynta arrintan gabi ahaanba uma roona timahaaga. madaxaagu wuxuu leeyahay 180,000 qanjidhada saliidda ah, waxayna ururiyaan wasakhda iyo qashinka haddii aan si joogto ah loo dhaqin\".\nTimaha oo aan si joogto ah loo dhaqin waxay sababi kartaa ur iyo sidoo kale inay ka sii daraan xaaladaha madaxa sida agoolka, ayay tiri, sababtoo ah \"timaha oo aad ka tagto inay noqdaan kuwo saliid leh waxay u oggolaan kartaa in khamiirka iyo bakteeriyada ay dhismaan, keeneysa xaaladaha madaxa cuncunka\".\nProudman waxa ay ku talinaysaa in aad maydho timahaaga maalin kasta haddii timahaagu ay saliid badan yihiin ama aad ku isticmaasho badeecooyin badan.\nXigashada Sawirka, Getty Images\nIn wakhti loo helo in si buuxda loo dhaqo, ama mishiin lagu shido had iyo jeer maaha mid macquul ah marka inta u dhaxaysa shaqada, jimicsiga iyo qorshayaasha bulshada, qaar badan oo naga mid ah ayaa isticmaala shaambada qallalan si degdeg ah si aan u soo nooleyno xididdada dufanka leh iyo dib u cusboonaysiinta timaha annaga oo aan ku mayranin.\nProudman waxay sheegtay in shaambada qallalan ay \"aad u fiican tahay\", laakiin waa in la isticmaalo hal mar oo keliya inta u dhaxaysa timaha dhaqidda.\nDhibaatadu waxay soo baxdaa markaad isticmaasho maalmo badan oo isku xigta adigoon maydhin.\n\"Saliidda dabiiciga ah ee madaxu waxay ku darsantaa shaambada, khamiirkuna wuxuu quudin doonaa waxa halkaa ka dhalanaya,\" Proudman ayaa sidaa tiri.\n\"Haddii aadan taa ka taxaddarin waxaad yeelan doontaa cuncun iyo maqaarka madaxa oo qolof yeesha\".\nUgu dambayntii taladeedu waxa weeye in aad diirada saarto in aad madaxaaga u ilaaliso si la mid ah sida aad u ilaaliso wejigaaga - ma sii wadi doontid inaad maqaarkaaga mariso dawooyinka la isku qurxiyo adigoo aan meesha ka saarin waxa hoos ku jira oo aan marka hore la dhaqin.", "date": "2025-10-23", "scraped_at": "2025-11-02T07:31:06.204806+00:00", "category": "news", "text_hash": "29f7121f40d4bb7260bd781c2a3d7a1d15f44c0c2a06e3ec82555e87eb775c2e", "minhash_signature": "6753488,10498107,1141723,11103343,3838594,2610094,8710319,8131621,503259,10043271,422394,2312001,7923360,8080952,4741302,5024934,2336286,9767092,1966631,4638686,12970441,755253,9474786,4436629,1307865,286738,715636,9296591,2045537,8940361,237140,3226225,3336191,2860482,2448289,6112249,2148892,3903231,6224962,30411195,916342,93817,22389,4187035,2558336,16198287,461570,459394,3051448,13658385,4168213,2209103,3934077,5737549,5888680,1058361,6806413,607266,537040,805447,17322077,29521,11053424,811674,211488,6680423,904151,818751,5821171,6472202,4996727,7168179,765007,568959,9525896,21899438,9970073,3493822,7697323,14809131,2900102,768806,638479,3590604,6379421,3667067,19064674,13285244,1780682,3030239,12860023,5969889,2475930,4541140,183775,1917788,5497,12813451,1605493,14179929,6277671,12342115,3873442,2516497,2988937,4990628,17575936,3636719,453063,1302215,1611568,1892443,7365086,1367004,10053513,638380,1787052,2084780,1396195,10403506,3811953,279073,8892394,2964144,6319344,1768110,132181,3062348"}
{"url": "https://www.bbc.com/somali/articles/cm2zp11mymro", "title": "Dowladda Soomaaliya oo iska fogeysay inay heshiis qarsoodi ah la gashay Sweden", "text": "Xigashada Sawirka, Radio Sweden\nDowladda Soomaaliya ayaa beenisay warar ay dhowaan baahiyeen qaar ka mid ah warbaahinta Sweden, oo ku saabsan inay galeen \"heshiis qarsoodi ah\" oo isku xiraya gargaarka horumarineed iyo dib u celinta muwaadiniinta Soomaaliyeed.\nWar-saxaafadeed kasoo baxay xafiiska raysal wasaaraha Soomaaliya ayaa lagu sheegay in arrintaas aysan waxba ka jirin.\n\"Eedeymahan waa kuwo been abuur ah, marin-habaabin ah, isla markaana aan sal iyo raad toona lahayn. Ma jirto heshiis qarsoodi ah ama shuruudeysan oo Soomaaliya ay la gashay waddan kale oo ku saabsan dib u celinta muwaadiniinteeda Soomaaliyeed.\n\"Xiriirka u dhaxeeya Soomaaliya iyo Sweden waa mid soo jireen ah, kuna dhisan is ixtiraam iyo sharciga caalamiga ah. Dhammaan wada shaqeynta iyo wada xaajoodyada waxaa lagu fuliyaa heer diblomaasiyadeed oo daah-furan iyadoo lagu hubinayo kormeerka Golaha Wasiirrada iyo isla xisaabtanka hay'adaha dowliga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nXigashada Sawirka, aftonbladet\nRadiyoowga madaxa banaan ee dalka  Sweden ee \"Ekot\" ayaa dhowaan daaha ka qaaday in Sweden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya, kaasoo 100 milyan oo karoon oo ka mid ah miisaaniyadda gargaarka lagu wareejiyay mashaariic  la xidhiidha dawladda Soomaaliya.\nTaas beddelkeeda, Soomaaliya waxay aqbashay, sida ay idaacaddaas sheegtay, dib u soo celinta muwaadiniinta u dhashay.\nEnd of Ugu akhris badan\n\"Khatarta musuq-maasuqa dhici karaa waa mid aad noogu cad aniga oo arrimahan ka shaqeeyey muddo dheer\" ayay tiri Wiilo Cabdulle Cismaan, oo sannado badan ka shaqaynaysay arrimaha dib u celinta Soomaalida.\nSida ay idaacaddu sheegtay, heshiiska ayaa la gaaray bishii Diseembar 2023. Musaafurinta qasabka ah ee Soomaalida ayaa aad kor ugu kacday, iyadoo sanadkii hore  la tarxiilay 28 qof, sida ay booliisku sheegeen.\nEkot ayaa shaaciyay in ilo xog-ogaal ah oo ka kala socda Soomaaliya iyo Sweden ay u sheegeen  in dalabka Soomaalida uu ahaa in \"lacagta kaalmada Sweden la geliyo dadka ku hareeraysan xukuumadsda si ay saameyn ugu  yeeshaan si ka duwan, markaad barbar dhigto sida nidaamka mucaawinadda ee caadiga ah loo maamulo\".\nDhanka kale, mid ka mid ah wargeysyada ugu afka dheer Sweden, Aftonbladet, ayaa qoray war kaas la mid ah.\nWargeyska ayaa soo qaatay wiil Soomaali ah oo lagu magacaabo Xasan Cusmaan oo 24 jir ah, kaas oo uu wargeysku sheegay inuu ka mid yahay Soomaalida lagu qasbay inay isaga baxaan dalkaas.\n\"Wuxuu helay warka kadib markii Swden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya. Hadda wuxuu u baqayaa naftiisa.\" Ayuu wargeysku qoray.\nXigashada Sawirka, X\nSweden ma aysan soo saarin faallo rasmi ah oo la xiriirta arrintan, balse khubarrada diblomaasiyadda ayaa sheegaya in wada-xaajoodyada la xiriira socdaalka iyo iskaa u laabashadu ay tahay arrin xasaasi ah oo u dhaxeysa dowladaha Yurub iyo Afrika, gaar ahaanna xilli bannaanbaxyo looga soo horjeedo soo-galootiga ay ka socdaan eybo ka mid ah Yurub.\nMa aha markii ugu horreysay ee ay soo shaac baxaan wararka ku saabsan in Soomaaliya ay heshiis kula gashay dal Yurub ah celinta muwaadiniinteeda.\nMadaxweynaha Soomaaliya Xasan Sheekh Maxamuud oo sanadkii hore booqasho ku tagay dalka Jarmalka iyo dhiggiisa dalkaas ayaa ku dhawaaqay qorshooyin lagu celinayo Soomaalida aan sharciyan joogi karin dalkaas.\nSweden waxay sheegtay in Soomaali kumannaan gaaraysa ay qeyb ka yihiin dadka magangalyada ka helay Jarmalka, kuwaas oo hadda kaalin wanaagsan ku leh horumarka iyo wada-noolashaha guud ee bulsho-weynta dalkaas.\nSanadkii hore dowladda Jarmalka waxay sheegtay dadka la celinayo in ay sidoo kale dan ugu jirto Soomaali badan oo ku nool jarmalka kuwaas oo si fiican dalka u dhexagalay.\nKulankii madaxweynaha Soomaaliya iyo hoggaamiyaha jarmalka dhexmaray wuxuu xiligaas ka sheegay madaxweynaha Soomaaliya in aysan aheyn Soomaaliya dal dagaal sokeeye ku jira oo ay doonayaan in ay ka helaan Jarmalka maalgelin.", "date": "2025-10-08", "scraped_at": "2025-11-02T07:32:05.912874+00:00", "category": "news", "text_hash": "f6dccfd76f5e846435fb8b46c0600b606549c8fd09edb1930a2095cef966399e", "minhash_signature": "25729628,3270716,12009339,15165304,5941960,13995504,427022,2503477,1730676,4400002,3392584,1770018,5408790,14274848,4679421,5236664,30387957,3843205,13004,6130055,15068615,31698582,27233474,87114,8961076,734431,15513853,2080410,2639467,1820781,1374051,1046546,11515314,7516320,12506401,156119,1170204,2676253,6412508,7841065,107482,5840342,12971138,489677,1525445,2309451,8904874,10749618,1624475,4310936,10409203,1061239,4466446,13267029,217381,1629388,1066730,1994887,1725895,121868,5309293,1393504,7348084,6573470,3682161,12592741,3614949,1538610,4267787,2029293,26923545,3490274,10091252,5272322,11151761,7983001,4949758,8678428,2502508,17508089,6847792,9375588,7692283,8376164,20416013,5955684,14596274,7896826,8263014,75156,1026850,8542678,1591692,567110,21512161,19143554,1882295,18682621,1492760,182207,16766996,5444624,1595687,18179211,663565,35779476,3028942,11197258,6989630,4902015,31044532,15623061,4623748,2903045,10572357,4115662,5843657,1902834,9989171,1128111,2336388,2870158,19010495,7696568,3380146,8183957,7460634,11198796"}
{"url": "https://www.bbc.com/somali/articles/c20ppkvd7vyo?at_medium=RSS&at_campaign=rss", "title": "Iiraan oo ku tilmaantay Maraykanka soo saaraha ugu khatarta badan Nukliyeerka", "text": "Maalin uun ka dib markii uu madaxweynaha Maraykanka Donald Trump uu amray in dib loo bilaabo tijaabooyinka hubka Nukliyeerka, ayuu wasiirka arrimaha dibadda Iiraan Abbas Araghchi sheegay inuu aaminsan yahay in tallaabada Trump ay muujinayso in ''Maraykanku yahay soo saaraha ugu khatarsan ee hubka nukliyeerka adduunka.''\nWaxa uu ku daabacay bartiisa X, Oktoober 30, Khamiis ''Iyada oo u beddelaysa magacii wasaaradda gaashaandhiga, wasaaradda dagaalka, awoodda nukliyeeka ku hubaysan ayaa bilaabaysa tijaabooyinkeeda hubka nukliyeerka.''\nShalay, Arbaco, kahor kulanka uu la yeeshay madaxweynaha Shiinaha Xi Jinping, Donald Trump ayaa sheegay inuu amray xooghayihiisa dagaalka inuu dib u bilaabo tijaabooyinka nukliyeerka si uu u '''dheelitiro awoodda waddam ay kamid yihiin Ruushka iyo Shiinaha.'' Maraykanka ayaa hakiyay tijaabooyinka muddo ka badan 30 sano.\nWasiirka arrimaha dibadda Iiraan ayaa sidoo kale qoray ''Isla kan xoogga sheeganaya ayaa ka dhigaya  barnaamijka nabadeed ee Nukliyeerka Iiraan inuu u muuqdo mid khatar ah una goodinaya inuu qaadayo weeraro dheeraad ah oo ka dhan ah xarumaha nukliyeerka ee ku hoos jira difaaceena. Dhamaan talaabooyinkan ayaa ah kuwa si cad u socda.''\nIiraan mar kasta waa ay beenisaa in barnaamijkeeda Nukliyeerka uu yahay mid milatari, ayna tahay xubin NPT (Heshiiska ka hortaga faafinta hubka nukliyeerka) oo ay xaq u leedahay inay sii waddo kobcinta yuraanyoomta iyo barnaamijkeeda nukliyeerka iyada oo hoos imaanaysa kormeerka hay'adda caalamiga ee tarmarta atoomikada (IAEA).\nBalse Maraykanka, Israa'iil iyo dhowr waddan oo Yurub ah sida Britain, Jarmalka iyo Faransiiska ayaa dalbanaya in barnaamijka nukliyeerka la hakiyo isla markaana kormeerayaasha IAEA loo oggolaado inay si buuxda u galaan dhammaan xarumaha nukliyeerka Iiraan.\nEnd of Ugu akhris badan\nXigashada Sawirka, AFP via Getty Images\nAragchi ayaa ugu baaqay beesha caalamka inay ka hortimaado go'aanka madaxweynaha Maraykanka, isaga oo ku qoray boggiisa X; ''Ku dhawaaqista dib u bilaabidda tijaabooyinka nukliyeerka waa ficil dib u noqosho ah oo aan masuuliyad lahayn, isla markaana khatar weyn ku ah nabadda iyo amniga caalamka.\nMaraykanku waxa uu leeyahay hubka nukliyeerka ee ugu badan dunida; Ruushka ayaa ku jira kaalinta labaad, shiinahana waa kaalinta saddexaad. Maraykanku tijaabo nukliyeer ma samayn tan iyo 1992.\nAmarkan ayaa yimid maalmo ka dib markii uu Trump cambaareeyay Ruushka, sababtuna tahay tijaabo uu ku sameeyay gantaal Nukliyeer oo leh ''masaafo aan xad lahayn.''\nQoraalkiisii habeenkii Arbacada, Oktoober 29/Febraayo 29 ayuu madaxweynaha Maraykanku ku yiri in ''uusan lahayn wax doorasho ah marka laga reebo inuu hormariyo hubka Maraykanka inta lagu jiro muddo xileedkiisii u horreeyay ee xafiiska.'' Isaga oo garowsan ''awoodda burburinta weyn'' ee hubka nukliyeerka.\nWuxuu sidoo kale ku daray in barnaamijka nukliyeerka ee Shiinaha '' uu lamid noqon doono kan Maraykanka shanta sano ee soo socota.''\nTrump ma bixin faahfaahin la xiriirta sida tijaabooyinka loo fulin doono, balse wuxuu qoray in ''nidaamka si dhakhso ah loo bilaabi doono''\nGo'aankan waa is-beddel cad oo ku yimid siyaasaddii muddada dheer ee Maraykanka.\nTijaabadii u dambaysay ee nukliyeerka Maraykanka ayaa dhacday Sebtember 23, 1992, kahor intii aanu madaxweyne George H.W. Bush joojin tijaabooyinka, iyada oo wakhtigaasi uu dhammaaday dagaalkii qaboobaa", "date": "2025-11-01", "scraped_at": "2025-11-02T07:33:05.648462+00:00", "category": "news", "text_hash": "5c0017806f13610eac199536e359c968237b2c28c49393e3e88ffe406ca94d0b", "minhash_signature": "427732,5648416,7675648,12565660,3224255,6079006,8491818,3008281,1812253,11648790,4264508,15936150,10506082,4449161,172881,3660231,17997132,6549168,4446207,6344733,18234642,7160950,5211305,8054999,21477600,21621780,16129347,2292119,272625,10244325,5001581,11849670,14410633,4605682,793479,16861752,9211474,976978,3888176,1737287,3542970,2784456,12769550,2425492,1631476,15185135,4777076,7489950,13259093,7978054,29380785,16872186,13136547,11071789,9883785,6572637,1502255,36844644,8247557,4374585,568797,5145142,678684,2131338,40181446,2464683,3585702,5390364,18239332,1996626,32674157,4897725,3229818,2723650,14611200,15469113,1631399,4706356,8197995,956469,970881,9882627,2529980,5529794,350427,10764789,1040562,11236425,3319532,22296998,661974,255878,300776,336088,4865658,11599662,36154810,706809,8355239,5551755,2293843,3819500,2146640,38123693,3231593,6824734,11692948,11520818,11293927,6035511,78900,5437871,1551304,1028065,12504402,25396199,3837660,12124122,12940105,275629,13168303,12880533,6464357,7920452,1269009,12812899,5606007,4901485"}
{"url": "https://www.bbc.com/somali/articles/cy9pnvy95gro?at_medium=RSS&at_campaign=rss", "title": "Shil argagax leh : sidee ayey kaligeed ugu badbaaday diyaaraad lagu wada dhintay?", "text": "Xigashada Sawirka, Annette Herfkens\nAnnette Herfkens, oo ah maalqabeenad u dhalatay dalka Holland ,ayaa fasax dalxiis ah ugu maqnayd dalka Vietnam iyada iyo ninka ay u doonneyd, markii diyaarada ay la socdeen ay ku burburtay duur cidlo ah, halkaasi oo ay ku geeriyoodeen dhammaan dadkii la socday diyaaradda.\nWaxay ahayd sanadkii 1992-dii. Annette Herfkens iyo saaxiibkeed ay u doonneyd, Willem van der Pas, oo loo yaqaannay Pasje, waxay u socdaalayeen xeebta loo dalxiis tego ee ku taala dalka Vietnam.\nAnnette waxay ka shaqaynaysay qaybta maaliyadda ee magaalada Madrid, caasimadda Spain. Waxay xiriir fog la lahayd Passage laga soo bilaabo sanadkii1979-kii, xiligaas waxaa ay ahayd arday saaxiibkeedna, isku fasal ayay dhiganayeen.\nAnnette iyo Pasje ayaa ka soo safrayay magaalada Ho Chi Minh ee dalka Vietnam, waxayna ku sii jeedeen xeebta Nha Trang, markii diyaaradda ay la socdeen wajahday cimilo ad u daran, waxayna ku dul dhacday meel fog, gaar ahaan buuro ceeryaamo qariyay oo kaynta Vietnam ku taala.\nDiyaaradda ayaa si ba'an u burburtay, waxaana ku dhintay 30 qof oo rakaab ah iyo dhammaan shaqaalihii diyaaradda oo u uku jiray ninkii ay Annette u doonneyd oo ay aadka u jeclayd.\nAnnette iyadoo dhawac ah ayay keymo ku noolayd muddo siddeed maalmood ah. Waxa soo gaaray dhaawac oo qeybo kamid ah jirkeeda ah, dhaawacyadaas oo ay aad ula xanuunsatay, xitaa heer ay gaartay inay socon weydo.\nEnd of Ugu akhris badan\nWay fuuq-baxday biyo la'aan darteed. Waxay sidoo kale aad ugu murug saneyd geerida qofkii ay dunida u jeclayd.\nMarkii dambe roob ayaa yimid, oo biyaha roobka ayay ku noolayd. Markii la marayay maalinkii 6-aad, waxay ku dhowaatay dhimasho. Waxay meel fog ka aragtay qof xiran dhar midabkiisu Orange yahay, way qeylisay, way is raaceen oo sidaa ayay kaga baxday keymihii.\nDhibaatadii ay ka martay inay muddo 8 maalmood ah ku noolaato keymaha ayaa markan so oaf-jarmay.\nXigashada Sawirka, Annette Herfkens\nWaxay ahaayeen saaxiibo aad isugu dhow, oo ku noolaa hal guri oo ardaydu degaan. Wax yar ka dib waxay bilaabeen hasaawo. Waxay labadoodaba ogaadeen inay isu qalmaan oo jacalkoodu markan dhab yahay.\nMarkii Pasje uu qorsheeyay fasax dalxiis oo Vietnam ah, waxay wada socdeen 13 sano. Muddo lix bilood ah, labadooduba waxay ka shaqaynayeen wadamo kala duwan. Pasje waxaa uu ka shaqeynayay bangi ku yaala Vietnam, halka Annette ay ganacsi ku lahayd Spain.\nDiyaarada ay saarnaayeen ayaa la qorsheeyay inay ka baxdo magaalada Ho Chi Minh 7-da subaxnimo si ay ugu amba baxdo aagga xeebta ee Vietnam.\nWaxay ahayd diyaarad yar oo nooceedu yahay Yakovlev Yak-40 oo Soofiyeedku sameeyay.\nXigashada Sawirka, Annette Herfkens\nDiyaaradda ayaa dhacday 5 kadib oo ay hawada ku jirtay. Saaxiibkeed oo ay aragto, waxaa ugu dambeysay markii ay diyaaraddu dhaceysay.\nSi tartiib tartiib ah ayay u soo kabsatay, maadaama ay aad ugu naxday geerida ninkii ay u doonneyd.\nAnnete waxay ahayd gabar yar, qeybta maaliyadda Madrid ayay sidoo kale u shaqeyn jirtay, safarkeeduna aad ayuu u badnaa, waxayna inta badan u safri jirtay magaalooyinka iyo London.", "date": "2025-10-30", "scraped_at": "2025-11-02T07:34:07.500875+00:00", "category": "news", "text_hash": "6530d65f25376e0865f1fe2361f9e91e6518852f833d878c9de2a171f9b1a98b", "minhash_signature": "9112443,26238611,1522269,7985216,17841731,5867441,20853906,12931536,14896551,4694835,4088267,3194265,2802101,21052951,3587242,15377810,32120541,10774366,13653201,6152918,1046135,8530007,567859,24938012,10841755,31175876,9836654,11838509,202920,5655063,15385471,2749343,14328130,664000,1458236,1227750,11186349,3787951,13924671,9804316,6175971,915919,3213517,6521526,21348995,15153194,11916691,6634813,3513017,7360483,8312050,20098260,2760496,2698096,3422927,15391650,6947903,7195205,2347747,5574623,10248849,10644114,14606887,1194619,2497653,6662649,8544462,1501725,7590835,5930309,7114493,14492338,3203929,2741008,625951,14651003,11719426,28866140,5384999,8238183,7449355,8945818,4724319,713424,13701066,4050264,6456217,4783014,5071193,46598,8289096,45934295,6616822,3223781,3290133,8005163,13681720,4901868,18927638,5208810,10727703,9430461,17651011,26464417,2189432,1870823,2056262,15372549,8413495,7537418,1726896,499360,12347178,42437,9558729,1204801,686418,1971371,9808603,19480751,7664956,5653770,4423697,2318608,4831545,10229012,168668,24354523"}
{"url": "https://www.bbc.com/somali/articles/cq50083y710o?at_medium=RSS&at_campaign=rss", "title": "Masar oo markii ugu horreysay soo bandhigtay agabkii lala aasay mid ka mid ah boqorradii Faraaciinta", "text": "Xigashada Sawirka, Getty Images\nMeel ku dhow mid ka mid ah Lixda Mucjiso ee Aduunka ee Qadiimiga ah – Xabaasha Weyn ee Khufu ee Giza ee dalka Masar waxa si rasmi ah looga furayaa xarunta dhaqanka oo xilligan noqonaysa mid ka mid ah kuwa ugu casrisan.\nMaktabadda weyn ee lagu kaydiyo aasaarta ee dalka Masar oo lagu tilmaamay in  uu yahay xarunta cilmi-baarista taariikhda adduunka ayaa waxa ka buuxda ku dhawaad 100,000 oo agabyo taariikhi ah oo laga soo ururiyay taariikh soo taxnayd ku dhawaad toddobo kun oo sano.\nWaa taariikh ka soo bilaabanaysa  xilliyadii ka horroysay dhismayaasha boqortooyo ilaa xilliyadii Giriigga iyo Roomaanka.\nCilmi-baadhayaasha Masar ee caanka ah waxay ku doodaan in furitaanka xaruntani ay xoojineyso dalabkooda ah in qaar ka mid ah asaartii qadiimiga ahayd ee Masar ee yaalla dalalka kale dib loogu celiyo. Waxyaabahaas waxa ka mid ah Dhagxaanta Rosetta ee caanka ah ee lagu soo bandhigay Matxafka Ingiriiska.\nMid ka mid ah waxyaabaha layaabka leh ee dadka soo jiitay waxa ka mid ah  dhammaan agabyada ku jira xaabaaalaha duugoobay ee Tutankhamun. Waxa ka mid ah maaskii dahabka ahaa ee Tutankhamun, kuraasta boqortooyada iyo gaadiidka dagaalka.\n\"Waxaan u baahday in aan ka fikiro, qaab kale oo aan u soo bandhigno oo ka duwan sidii hore loo samayn jiray, maaddaama tan iyo markii la helay xabaasha sannadkii 1922-kii oo ku dhawaad 1,800 oo shay oo ka mid ah guud ahaan in ka badan 5,500 oo ku jiray xabaasha ayaa la soo bandhigay,\" ayuu yidhi Dr Tarek Tawfik, Guddomiyaha Ururka Caalamiga ah ee Cilmi-baadhayaasha Masar iyo madaxa hore ee xaruntan.\nEnd of Ugu akhris badan\n\"Waxaan fikrad ahaan soo jeediyay in la soo bandhigo xabaasha oo dhan, taasi oo macnaheedu yahay in aanu kaydka waxba ku hadhin, islamrkaana aan waxba lagu reebin matxafyada kale, waxaana qof kastaa heli karaa khibrad dhammaystiran, sida Howard Carter uu sheegay in ka badan boqol sano ka hor.\"\nQiimihiisu wuxuu gaadhayaa ku dhawaad $1.2 bilyan (£910m; €1.1 bilyan), waxaana la filayaa in xarunta weyn ee matxafka ay soo jiidato ilaa 8 milyan oo dalxiisayaal ah  sannadkiiba, taasi waxay kor u qaadaysaa  dalxiiska Masar.\n\"Waxaan rajaynaynaa in Matxafka Weyn ee Masar uu horseedo xilli dahabi oo cusub oo wax wanaagsan u noqda cilmiga Masaarida iyo dalxiiska dhaqanka,\" ayuu yidhi Axmed Seddik, oo ah isuduwaha iyo cilmibaadhe Masri ah\n\"Marka laga reebo bandhigga Tutankhamun iyo bandhig cusub oo ah qabri kale oo ay ku jiraan aasaar qadiimi ah, waxa kale oo cajiib ah  Khufu oo 4,500 sano jir ah. Waa mid ka mid ah markabkii ugu da'da weynaa uguna mudnaa kuwa aasaarta sida wacan loo ilaaliyay ee quruumihii hore – inta badan matxafyadan ayaa dadweynaha u furnaa tan iyo sannadkii hore.\"\nDalxiise British ah ayaa sheegtay in ay hore u aragtay bandhigyada Tutankhamun ee lagu soo bandhigay Matxafka Masaarida ee neoclassical-ka ah ee ku yaal Suuqa Taxriir ee mashquulka badan.\n\"Matxafka hore wuxuu ahaa mid aad u cakiran, waxaana uu u muuqday muid waxoogaa isku dhex daadsan,\" ayay ku tidhi. \"Waxaan rajaynayaa in Matxafka Weyn uu aad u sahlanaan doono oo ay macquul noqon doonto in si wanaagsan loo booqdo, waxaana u maleynayaa in aad wax badan ka faa'iidi doonto.\"\nMatxafka cusub waa mid aad u weyn, isagoo dhererkiisu gaadhayo 500,000 mitir laba jibbaaran (5.4 milyan ft²) – ku dhawaad cabbirka 70 garoon oo kubbadda cagta. Dibadda matxafka waxaa ku daboolan qoraallo iyo waxyaabo kale oo u go'an sidii saddexagalka, iyada oo albaabkuna uu u qaabaysan yahay  sidii ahraamta Masaarida.\nFikradda matxafka waxaa markii ugu horreysay la soo jeediyay sannadkii 1992-kii, intii uu xukunka hayay Madaxweyne Xusni Mubaarak, waxaana dhismaha la bilaabay sannadkii 2005-tii. Sida qiyaasayo, dhismahu wuxuu hadda qaatay muddo ku dhawo mid la mid ah tii Ahraamta weyn ee Giza.\nXigashada Sawirka, Getty Images\nMashruucu wuxuu la kulmay dhibaatooyin dhaqaale, Kacdoonkii Guga Carabta ee 2011-kii – kaasi oo xukunka lagaga tuuray Mubaarak kuna sababtay sannado burbur  ah iyo qalalaase – safmarkii Covid-19 iyo dagaallo gobolka ka dhacay ayaa iyaguna noqday caqabad kale.\n\"Waxay ahayd riyadayda. Aad ayaan ugu faraxsan ahay in matxafkan ugu dambeyntii la furay!\" ayuu Dr. Zahi Hawass, oo ahaa wasiirkii muddo dheer ka soo shaqeynayay dalxiiska iyo hiddaha Masar u sheegay BBC-da. Khabiirku wuxuu sheegay in matxafku muujinayo in Masaridu ay la siman yihiin khubarada shisheeye   marka laga hadlayo qodista, ilaalinta taallooyinka, iyo maamulka matxafyada.\nDhagaxa Rosetta oo la helay sannadkii 1799-kii ayaaahaa mid ay heleen ciidammo Faransiis ah. Waxaana Ingiriisku markii dambe ku qaatay dhaxal dagaal. Koox Faransiis ah ayaa jaray Dendera Zodiac, oo ah khariidadda cirka u eg ee Masaarida ee qadiimiga ah, waxayna ka qaadeen qaadeen macbadka Hathor ee Masar, sannadkii 1821-kii. Masar waxay ku eedeysaa khubarada dhaxalka Jarmalka in ay si sharci-darro ah dalka uga soo saareen sawirka midabaysan ee Nefertiti oo ahaa xaaska Faraaci Masari ah oo la odhan jiray Akhenaten, in ka badan boqol sano ka hor.\nXigashada Sawirka, Getty Images\nMas'uuliyiinta Matxafka Ingiriiska ayaa BBC-da u sheegay in aanu helin \"wax codsi rasmi ah oo ku saabsan soo celinta Dhagaxa Rosetta oo ay leedahay Masar.\"\nKhubarada Masar ee aasaarta qadiimiga ah ayaa muujinaya farxaddooda ku aaddan in matxafkan cusub uu noqdo xarun cilmi-baadhis iyo aqooneed oo horseedaysa helitaanka waxyaabo cusub.\nMarar hore ayaa Masaridu ay dib us oo celisay walxo uu lahaa Tutankhamun, oo ay ku jiraan hubkiisa cajiibka ah. Sida ku xusan qaanuunka Masar, dib-u-habeynta noocan oo kale ah waxaa sameyn kara oo keliya Dadka Masaarid ah.", "date": "2025-11-01", "scraped_at": "2025-11-02T07:35:06.142607+00:00", "category": "news", "text_hash": "0eac61fbf63e1e777cd8c1183a77efdfc35874bd055cff328a265be34f12a045", "minhash_signature": "7091905,56562,236645,13186432,1151,2653300,1021489,2185055,11823926,7531117,3728245,648516,3610921,14527466,923959,5211820,3722802,232257,295335,1367197,4347286,8181713,2285432,4436629,3010518,5573593,200433,594234,1950827,1069041,443260,222145,7787794,1730836,305620,2104334,8654130,1751790,5963110,4382279,7963910,2280685,4035832,1217619,7396681,6987742,3980558,378688,1585498,35444,10375443,6924620,11295729,1382449,1373506,19367554,226832,5123654,1124735,805447,1736984,6623391,185451,2056669,6685531,3607808,3241019,7022842,107410,726429,13119251,1201858,14953688,7947070,6967939,3083258,1465831,3973945,7579533,1417189,2055766,6314137,19830605,1209465,4980670,585076,17946344,12178020,397749,1662093,754846,14222502,4879985,311607,202692,5723808,11465786,3179547,1492760,6197143,1776861,3989419,1319057,912758,7602621,170327,1112099,6582296,11531198,6686807,22327984,1364730,12937133,1157284,1272362,15292880,5615453,2245474,18066446,3022511,1717294,1508264,4886212,3510732,2947024,13361073,7048755,11884735"}
{"url": "https://www.bbc.com/somali/articles/c74w0wvrenlo", "title": "Yaa ka taqaan ciyaarhannada caanka ah ee ku dhintay shilalka", "text": "Xigashada Sawirka, Getty Images\nDunida kubadda cagta waxaa sannado badan ka dhacay shilal baabuur oo aad u naxdin badan, kuwaas oo galaaftay nolosha dad karti iyo xirfad sare leh.\nWaxaa ugu dambeeyay xiddiggii xulka qaranka Portugal iyo kooxda Liverpool Diogo Jota kaas oo isaga iyo walaalkii ay ku dhinteen shil gaadhi oo ka dhacay dalka Spain maalmo uun ka dib markii uu guursaday.\nDhimashadan, oo inta badan lama filaan ah iyo naxdin leh, waxay raad joogto ah ku reebtaa naadiyada, taageerayaasha iyo qarammada ay ka soo jeedaan.\nQormadan waxaanu idinku soo gudbin doonnaa liiska ciyaartoyda caanka ahaa ee ku naf waayey shilalka gawaadhida iyo diyaaradaha.\nXigashada Sawirka, Getty Images\nWaxaa laga yaabaa in ay ahayd musiibadii cirka ee ugu murugada badnayd ee kubbadda cagta casriga ah markii uu geeriyooday ciyaartoygan ku biiray Cardiff City markii ay burburtay diyaarad yar oo ka soo qaadday Faransiiska.\n28-jirkan ayaa ku safrayay diyaaradda Piper Malibu oo ka soo duushay Nantes, dalka Faransiiska kuna wajahneyd Wales fiidnimadii January 21 2019 ka hor intii aanay ku dhicin kanaal u dhow Guernsey, sidoo kale waxa la dhintay duuliye David Ibbotson oo 59 jir ahaa, kaas oo aan meydkiisa la helin.\nEnd of Ugu akhris badan\nSala waxa uu xilligaasi ku biirayay horyaalka Premier League-ga iyo Cardiff City markaas oo ay £15 milyan kaga soo iibsatay naadiga Faransiiska  ah ee Nantes.\nBaadhitaan ayaa lagu sheegay in Sala uu noolaa shilka ka dib balse uu u dhintay dhaawac culus oo ka soo gaaray madaxa iyo xabadka.\nXigashada Sawirka, Sportsman\nPatrick Mutesa Mafiosango ayaa u ciyaari jiray kooxda Simba iyo xulka qaranka Rwanda.\nCiyaaryahankan caanka ah ayaa 17-kii May 2012 ku geeriyooday shil baabuur oo ka dhacay xaafadda Keko ee magaalada Dar es Salaam, maalmo yar ka dib xilli ciyaareedkii 2011/2012 ee Tansaaniya Mainland Premier League oo ay Simba ku qaadday horyaalka.\nMafisango waxa uu jiray 32 sano, waxaanu hore ugu soo ciyaaray kooxaha Simba, TP Mazembe, APR, Atraco iyo Azam.\nXigashada Sawirka, Cal De Souza\nLaacibkii hore ee Arsenal iyo Sevilla ayaa ku dhintay shil baabuur oo ka dhacay magaalada uu ku dhashay ee Utrera.\nWararku waxa ay sheegayaan in gaadhigiisa oo Mercedes ahaa lagu waday  xawaare dhan 237 km/h (147 mph) ka hor inta aanu xakamaha goosan.\nReyes wuxuu ahaa 35 sano jir wuxuuna la safrayay laba wiil oo ay ilmo adeer yihiin; Mid ka mid ah ayaa isna dhintay.\nWeeraryahankii u soo kacayay Orlando Pirates iyo Bafana, Manyathela, ayaa dhintay isagoo 21 jir ah kaddib markii uu u dhaliyay 48 gool 73 kulan oo uu u saftay Buccaneers.\nManyathela ayaa xilligaasi ka soo laabtay tijaabo uu ku maray Qaarada Yurub wuxuuna gool u dhaliyay kooxda Pirates kadib markii ay guuldarro 2-1 ah kala kulmeen Jomo Cosmos garoonka Rand Stadium. Markaas kaddib ayuu shil ku galay  isaga oo ku sii jeeday magaalada Musina si uu wakhti ula qaato hooyadiis.\nNinkan oo hore ugu guulaystay kabta dahabka ah ee Premier League (PSL) ayaa kooxdiisa  Bucs ku hogaamiyo horyaalka 2002-03, wuxuu ku guda jiray saxiixia kooxda ka dhisan Ukraine ee Dynamo Kiev. Abaalmarinta gooldhaliyaha ugu sarreeya PSL waxaa loogu magac daray Manyathela.\nXigashada Sawirka, Rex Features\nCiyaaryahankii garabka ka ciyaara ee Ingiriiska, ee taariikh sameeyay isagoo ka mid noqday ciyaartoydii ugu horreysay ee madow ah ee matala England ku matala ciyaaraha caalamiga ah, sidoo kale u soo ciyaaray Real Madrid iyo Manchester United, ayaa ku dhintay shil baabuur oo ka dhacay Spain bishii July 1989.\ndhacdadaas naxdinta leh waxa ay soo afjartay xirfaddiisii kubbadda cagta, markaas oo uu jiray  33 sano.", "date": "2025-07-04", "scraped_at": "2025-11-02T07:36:06.060400+00:00", "category": "news", "text_hash": "25fe60f0f9f0b6bad6f7229749591443d399686a211f12a564066d44b2dace91", "minhash_signature": "6406797,4365770,6801673,1169701,28978947,2675576,4091398,7198404,15721158,9137554,2291584,6283743,2545320,6543292,1616394,977854,12193809,10774366,3834573,9114134,15137944,4403576,3653097,4436629,9116320,15491453,1592813,7820038,2708576,15071027,14188148,3433886,51162,4605682,605320,2050924,2247696,5924330,24000897,5250398,19417142,15619661,16697913,10777901,9201761,7157596,8983221,14166840,198995,5250846,8764692,12034897,1962229,524680,8084382,2248595,4939077,317751,1279895,1015903,5154637,4784320,26465459,5117425,8707467,3370865,1381523,12916780,957153,12017280,3787230,14765327,14953688,10267783,7110206,11738968,1092093,3280612,9713682,28187118,2222026,3895101,9037624,1889236,1752510,17887981,10806601,10448706,5625106,31963269,2979860,9642966,2476201,36172388,2447814,7433743,918458,13795045,1492760,11329439,4410278,3203099,10575912,3443507,10090118,6528987,17366327,7871036,9634205,8199985,8926643,30852873,2774395,4246786,2589000,1088361,693888,11210349,5099442,1198763,3940372,30475267,11888193,2816039,3262491,948753,3270217,5118945"}
{"url": "https://www.bbc.com/somali/articles/ckg12g4nw4eo", "title": "Xiriirka gaarka ah ee hogaamiyihii mucaaradka Kenya ee geeriyooday Raila Odinga uu la lahaa Somaliland", "text": "Xigashada Sawirka, Xafiiska Afhayeenka M JSL\nFG: Qormadan dib ayaa loo cusboonaysiiyey.\nWaxaa dalka Hindiya ku geeriyooday hogaamiyihii mucaaradka Kenya, marna noqday ra'iisul wasaaraha dalka Raila Odinga.  Wuxuu ka mid ahaa dad aan badnayn oo lagu tiriyo inay qaabeeyaan siyaasadda Kenya.\nMuddo 40 sano ka badan ayuu siyaasadda ku soo jiray. Kenya marka laga soo tago xiriir fiican ayuu lahaa caalamka iyo gobolka.  Somaliland oo hadda ka hor uu booqday waxay ka mid tahay meelaha aadka looga taageero, oo uu xiriirka dhow lahaa siyaasiyiintooda.\nBishii Juun ayaa booqasho waxaa ku yimid Kenya madaxweynaha Somaliland Cabdiraxmaan cirro oo ay markaas magaalada Nairobi kaga munaaqashoodeen sidii uu Raila ugu ololayn lahaa in ay Somaliland aqoonsi hesho.\nWar kasoo baxay afhayeenka madaxweynaha, Xuseen Aadan Cige, ayaa lagu sheegay in kulanka diiradda lagu saaray hagaajinta xiriirka labada dhinac oo dhinacyo kala duwan ah, sida nabadda iyo ammaanka, waxbarashada, isdhaafsiga dhaqan iyo qeybo kale.\nLabada hoggaamiye ayaa sidoo kale ka wada hadlay arrimaha Afrika, iyagoo ku baaqay xal ay Afrika hoggaamiso iyo horumar loo dhan yahay.\nEnd of Ugu akhris badan\n\"Waxa xusid mudan in Mudane Raila Odinga uu muddo dheer ahaa saaxiib dhaw iyo taageere mayal-adag oo ay Jamhuuriyadda Somaliland leedahay.\"\n\"Intii uu socday kulanka ayaa labada hoggaamiye waxa ay ka wada hadleen sidii loo dardargelin lahaa loona xoojin lahaa xidhiidhka soo jireenka ah ee ka dhexeeya labada Jamhuuriyadood ee Somaliland iyo Kenya, iyo sidii ay labada dhinac iskaga kaashan lahaayeen xagga dhaqaalaha, isku socodka, aqoonta iyo arrimaha isteraatejiga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nMadaxweynaha Somaliland ayaa dhankiisa uga mahadnaqay \"saaxiibtinimada soo jireenka ah ee uu Raila Odinga la leeyahay Somaliland iyo taageeradiisa\".\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nRaila Odinga oo dhexdhexaadiye weyn ka ah Bariga Afrika ayaa horey meelo fagaaro ah uga taageeray qadiyadda aqoonsi raadinta Somaliland, isaga oo ugu baaqay Golaha Fulinta Midowga Afrika inay u aqoonsadaan Somaliland dal madaxbanaan.\n\"Midowga Afrika wuxuu u baahan yahay inuu xaqiiqda ku baraarugo oo aysan suurtogal ahayn in labadan dal aan la isku keeni karin oo aan hal loo aqoonsan karin,\" ayuu yiri sanadkii 2020. \"Somaliland waa xaqiiq ay tahay caalamka inuu ku baraarugsanaado\" ayuu intaa raaciyay.\nRaila Odinga oo sidoo kale ahaa siyaasiga ugu faca weyn siyaasiyiinta Kenya islamarkaasna muddo dheer xabsi ku jiray gudaha Kenya waxa uu isku tilmaami jiray in uu yahay saaxiib dhow ee madaxweynihii labaad ee Somaliland Maxamed Xaaji Ibraahim Cigaal, oo ay isbarteen xilliyadii uu Cigaal xubinta ka ahaa dowladdii rayidka Soomaaliya oo uu Raysal wasaare ka noqday iyo dowladdii kacaanka oo uu la shaqeeyay.\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nSomaliland waxay ku tilmaantay Geerida Ra'iisul Wasaarihii hore ee Kenya iyo Hoggaamiyihii Mucaaradka  dalkaas Raila Odinga, saaxiib qaali ah iyo siyaasi ruug cadaa ah oo qaddiyadeeda u ololayn jiray oo ay wayday.\nWakiilkii hore ee Somaliland u joogay dalka Kenya Baashe Cawil Xaaji Cumar, oo la hadlay BBC-da ayaa sheegay in Raila Odinga uu door weyn ku lahaa xidhiidhka Kenya iyo Somaliland, iyo suurt ogalinta xafiisyada labada dhinac ee ka furan Nairobi iyo Hargeysa.\nKenya ayaa markii hore joojisay qorshaha ay jamhuuriyadda goonni isu taaggeeda ku dhawaaqday ee Somaliland ku dooneysay inay xafiis diblomaasiyadeed uga furato magaalada Nairobi ee caasimadda Kenya.\nWarsaxaafadeed ka soo baxay wasaaradda arrimaha dibadda Kenya, ayaa lagu sheegay in dowladda federaalka Soomaaliya ay u aqoonsan tahay dal madax bannaan, isla markaana aysan ogolaan karin in Somaliland ay xafiis diblomaasiyadeed ku yeelato magaalada Nairobi.\nSomaliland, waxay gooni isu taageeda ku dhawaaqday sanadkii 1991-kii, balse ma helin aqoonsi ballaadhan oo caalami ah oo ku saabsan madax-bannaanideeda\nKenya ayaa sheegtay in ay sii wadi doonto xiriirka ay la leedahay Somaliland, balse ay u aqoonsantahay dowlad-goboleed ka tirsan Soomaaliya, isla markaana ogolaansho ka hesho Soomaaliya.", "date": "2025-10-16", "scraped_at": "2025-11-02T07:37:06.209822+00:00", "category": "news", "text_hash": "e2a798e63045711d4bcf61db520cb280d87136bb13e258b473213da92bdf7fae", "minhash_signature": "338416,23563525,5005283,3746621,18486880,3224043,8187241,1832648,11894394,22099407,3392584,15541947,1923274,2363318,2049181,4560947,3073255,1598257,11705254,12012505,966856,10563474,1223471,12404719,866287,1635976,7201983,5955403,5458945,1298047,7584054,435406,3886131,50093,18508675,11821589,4600804,2820412,16836640,2550250,9149304,5673898,20153692,13344810,8655243,3426978,3055268,5196131,8381596,1560228,5372561,4555217,2237935,5525111,10666341,25036951,4570312,2358552,37743937,3821203,3981199,3638009,24496773,6515008,13576450,11459765,8136791,1197757,17380246,1373941,2774130,15072331,407954,7180517,21663289,7095493,2994126,19240817,30936334,3002908,1686597,606751,12968297,7457640,2653449,7740674,10386917,9669744,2313993,971898,13143609,6998090,17956185,3353129,1803738,14426260,4647353,4797486,8138489,3064540,4693170,2974186,5805317,5513287,32212081,3120422,3475001,12572109,989753,8871279,514869,20591562,35498783,976240,15900270,24578533,592141,3228341,2770536,6393517,4445502,2606507,488004,6520954,3356636,15970085,2046335,11847488"}
{"url": "https://www.bbc.com/somali/articles/c9d062290yqo", "title": "Horyaalka Premier League: Liverpool ma ilaashan doontaa koobka. Arsenal, Manchester City iyo Chelsea maxaa laga fili karaa? Xog dhamaystiran", "text": "Xigashada Sawirka, Rob Newell - CameraSport via Getty Images\nTaageerayaasha kubadda cagta adduunka oo dhan ayaa si weyn u sugaya bilowga xilli-ciyaareedka cusub ee horyaalka Premier League ee dalka Ingiriiska 2025–2026, iyadoo la filayo inuu karaar dhaafo xiisaha iyo la yaabkiisaba waana in Premier League-ga loo arko horyaalka ugu xooggan adduunka.\nWareegga koowaad wuxuu noqon doonaa mid kulul, iyadoo xilli-ciyaareedku si rasmi ah u bilaabanayo Jimcahan, 15-ka Agoosto, ciyaar kaliya oo dhexmaraysa Liverpool oo ah kooxda horyaalka difaacanaysa iyo martidooda Bournemouth, garoonka Anfield.\nCiyaaraha wareegga ayaa sii socon doona Sabtida, waxaana ka mid ah kulamo muhiim ah sida Aston Villa oo la ciyaaraysa Newcastle United, Nottingham Forest oo la kulmaysa Brentford, Tottenham oo la baratami doonta Burnley, iyo Wolverhampton oo wajahaysa Manchester City.\nXigashada Sawirka, Rob Newell - CameraSport via Getty Images\nSuuqa kala iibsiga xagaaga ee 2025 ayaa galay diiwaan taariikhi ah, iyadoo kooxaha Premier League-ga Ingiriiska (oo dhan 20 koox) ay dhaafeen kharashka laba bilyan oo gini oo Ingiriisi ah oo lagu bixiyay ciyaartoy cusub.\nLiverpool oo ah kooxda difaacanaysa horyaalka ayaa sameysay dhowr heshiis oo waaweyn oo ay ku bixiyeen lacago aan caadiyan looga baran kooxdan kuwaasoo guud ahaan gaadhaya ku dhowaad £300 milyan. Heshiiska ugu weyn wuxuu ahaa keenista weeraryahanka Jarmalka ah Florian Wirtz oo laga soo gatay Bayer Leverkusen, waxaana lagu bixiyay £116.5 milyan (oo ay ku jiraan gunnooyin), taasoo ka dhigtay mid ka mid ah heshiisyadii ugu qaalisanaa taariikhda Ingiriiska, iyo tan ugu qaalisan suuqa caalamka kahor bilowga xilli-ciyaareedka cusub.\nKooxda horyaalka Premier League difaacanaysa ayaa sidoo kale la soo wareegtay weeraryahanka Faransiiska ah Hugo Ekitike oo ka yimid kooxda Eintracht Frankfurt ee dalka Jarmalka, iyo sidoo kale daafaca bidixda ka ciyaara ee Hungari u dhashay Milos Kerkez, iyo daafaca midig ee Holland u dhashay Jeremie Frimpong, kaas oo noqon doona beddelka Trent Alexander-Arnold oo u wareegay kooxda Real Madrid.\nEnd of Ugu akhris badan\nXigashada Sawirka, Rob Newell - CameraSport via Getty Images\nWariyaha ciyaaraha Maxamed Amiin Al-Kinaani ayaa BBC-da u sheegay in ku guuleysiga horyaal kasta uu u baahan yahay maalgelin ballaadhan iyo kharash. Wuxuu xusay in bilowgii xilligii tababaraha Jarmalka ahaa ee Jürgen Klopp, Liverpool ay la saxiixatay ciyaartoy caan ah sida Mohamed Salah, Virgil van Dijk, Sadio Mané, iyo Roberto Firmino  kuwaasoo wax badan taray kooxda, maadaama Liverpool ay hanatay horyaalka iyo koobab kale oo badan. Waxaa kaloo jiray xasillooni, maadaama kooxda ay ka soo baxday dhibaatooyinkii ay la tacaalayeen ka hor imaanshihii Klopp.\nAl-Kinaani wuxuu intaas ku daray: \"Xilli-ciyaareedkii hore wuxuu ahaa xilli gaar ah oo lama ilaawaan ah Liverpool iyo guud ahaan Premier League-ga  ma heli kartid horyaal adigoon si fiican u kharash u bixin.\"\nWuxuu sidoo kale xusay in Liverpool ay xilli-ciyaareedkii hore faa'iido weyn dhaqaale ka heshay, oo ay ku jirto €200 milyan oo ka timid dakhliga baahinta Premier League-ga, iyo €90 milyan oo laga helay tartanka Champions League kaddib isbedelka nidaamkiisa.\nInkastoo kooxda ay xilli-ciyaareedkan ku bixisay lacago badan si ay u hesho ciyaartoy cusub, haddana waxay sidoo kale iibisay ciyaartoy lagu helay in ka badan €196 milyan  taasoo uu ku tilmaamay tiro aad u fiican, wuxuuna amaan u jeediyay agaasimaha isboortiga ee kooxda.\nKadib xilli-ciyaareed niyad-jab ku ahaa taageerayaasha Manchester City  kaliya ma ahan kuwa Ingiriiska, balse sidoo kale adduunka oo dhan  kooxda waxay hiigsanaysa inay dib u hanato horyaalkii ay waayeen xilli-ciyaareedkii hore oo ay Liverpool qaaday. Tababaraha kooxda, Pep Guardiola, ayaa go'aansaday inuu sameeyo saxiixyo badan si uu u xoojiyo kooxda oo xilli-ciyaareedkii hore muuqatay inaysan gaarin heerkeedii caadiga ahaa.\nCity ayaa la saxiixatay xiddiga xulka France Rayan Cherki, Rayan Aït-Nouri oo ka yimid Wolverhampton, Tijjani Reijnders oo ka yimid Milan, iyo ciyaaryahanka reer Norway Benjamin Kerke. Waxa kale oo ay keensadeen goolhayaha James Trafford oo kasoo baxay Burnley. Guud ahaan kharashka kooxda ayaa dhaafay £153.4 milyan.\nLaakiin ma awoodi doontaa Manchester City inay kasoo kabato guuldarradii xilli-ciyaareedkii hore? Falanqeeyaha ciyaaraha Ahmed Ghoneim ayaa leh: \"Dhab ahaantii, Manchester City waxay leedahay dhaxal weyn oo la xidhiidha tababareheeda Pep Guardiola. Tan iyo markii uu tababaraha Isbaanishka ah la wareegay kooxda 2016, kooxda waxay hanatay horyaalka Premier League lix jeer.\"\nGhoneim wuxuu BBC-da u sheegay: \"Waxaan dhihi karnaa xilli-ciyaareedka soo socda wuxuu keeni doonaa nooc cusub oo Manchester City ah, iyadoo ay sabab u yihiin saxiixyada kooxda sameysay  laga bilaabo bishii Janaayo ee lasoo dhaafay ilaa xagaagan  gaar ahaan dhanka weerarka oo lagu xoojiyay keenista Masriyaanka Omar Marmoush iyo Faransiiska Rayan Cherki, iyo sidoo kale bartamaha iyo daafaca oo ay ku biireen Tijjani Reijnders iyo Aljeeriyaanka Rayan Aït-Nouri. Sidaa darteed, Manchester City waxay weli tahay musharax weyn oo u tartami kara horyaalka Premier League, gaar ahaan iyadoo la filayo in saxiixyo kale ay dhici doonaan kahor inta aan la xirin suuqa kala iibsiga.\"\nCiyaaryahankii hore ee caalamiga ahaa Yasser Al-Shanwani ayaa BBC-da u sheegay: \"Xilli-ciyaareedkii hore ee Manchester City wuxuu ahaa musiibo.\" Wuxuu tilmaamay in falanqeeyaal badan oo Ingiriis ah ay u sababeeyeen hoos u dhaca kooxda dhaawacii xiddiga kooxda Rodri.\nWuxuu intaas ku daray: \"Waxaa hadda jira warar sheegaya in City ay diyaar u tahay inay fasaxdo Rodri  arrin la yaab leh  gaar ahaan iyadoo Pep Guardiola uu shaaciyay inuu ka tagi doono xilka tababarenimo marka uu dhammaado qandaraaskiisa kooxda.\"\nTaageerayaasha Arsenal wali waxay ku riyoonayaan hanashada horyaalka Premier League, maadaama markii ugu dambeysay ee kooxda loo yaqaan \"Gunners\"  ay qaaday horyaalka ay ahayd xilli-ciyaareedkii 2003–2004. Kooxda reer London waxay horyaalka hanatay 13 jeer taariikhdeeda.\nKooxdu, oo uu hoggaaminayo tababaraha Mikel Arteta, waxay dadaal ugu jirtaa inay rumayso riyada taageerayaasheeda. Arsenal waxay sameysay dhowr saxiix muhiim ah kahor bilaabashada xilli-ciyaareedka, kuwaas oo ay ka mid yihiin: Martín Zubimendi oo ka yimid Real Sociedad (Spain), Viktor Gyökeres oo laga keenay Sporting Lisbon (Portugal), Noni Madueke oo laga soo qaatay Chelsea, Cristhian Mosquera oo ka yimid Valencia, iyo goolhayaha Chelsea Kepa Arrizabalaga. Guud ahaan, kooxda waxay ku bixisay  suuqa in ka badan £190 milyan.\nFalanqeeyaha ciyaaraha Ahmed Ghoneim ayaa BBC-da u sheegay: \"Dabcan, Arsenal way tartami kartaa, sababtoo ah tababaraha kooxda Mikel Arteta hadda ma jiro cudurdaar uu ku difaaco inuusan si dhab ah ugu tartamin hanashada horyaalka Premier League kadib xoojinta weyn ee la sameeyay xagaagan. Tan ugu muhiimsan waxay ahayd xallinta dhibaatada weeraryahanka saxda ah iyadoo la keenay Viktor Gyökeres, kaas oo ahaa tartame xooggan xilli-ciyaareedkii hore si uu u helo abaalmarinta kabta dahabka Yurub. Intaa waxaa dheer, Arsenal waxay xoojisay khadka dhexe iyadoo la wareegtay Martín Zubimendi, iyo sidoo kale inay hayso ciyaartoyda muhiimka ah ee kooxda.\"\nXigashada Sawirka, Getty Images\nChelsea waxay la tacaashay natiijooyin aan degganayn sannadihii u dambeeyay ee Premier League-ga, balse waxay dad badan ku yaabisay markii ay ku guuleysatay Koobka Adduunka ee Kooxaha ee ugu dambeysay, oo ka dhacay Maraykanka, iyadoo uu hoggaaminayo tababare Enzo Maresca. Kooxdu waxay ku garaacday Paris Saint-Germain ciyaarta kama dambaysta ah, waxayna soo bandhigtay ciyaar xooggan, taasoo sababtay in dad badan ay Chelsea oo loo yaqaan \"Blues\"ugu saadaaliyaan inay tartan adag ugu jirto horyaalka Premier League.\nMarkii ugu dambeysay ee Chelsea ay qaaday horyaalka Premier League waxay ahayd xilli-ciyaareedkii 2016–2017, iyadoo uu tababare u ahaa Antonio Conte oo u dhashay Talyaaniga.\nSuuqa kala iibsiga xagaaga, Chelsea waxay sii waday istaraatiijiyaddeeda ah inay la soo saxiixato ciyaartoy da'yar, waxaana ay keensatay ciyaartoy ay ka mid yihiin Joao Pedro (Brighton), Liam Delap (Ipswich Town), xiddiga da'da yar ee 18 jirka ah ee reer Brazil Estevão Willian (Palmeiras), iyo Dário Essugo (Sporting Lisbon), iyadoo guud ahaan lagu ku bixisay suuqa ku dhawaad £240.2 milyan.\nCiyaaryahankii hore ee xulka qaranka Sucuudiga, Yasser Alshahrani, ayaa BBC-da u sheegay in Chelsea ay wacdarro ka dhigtay hoos imaatinka tababare Enzo Maresca, kaas oo sida uu sheegay wax weyn ka beddelay qaab ciyaareedkii \"Blues\". Tani waxay si cad uga muuqatay xilli-ciyaareedkii hore, markay ku guuleysteen UEFA Conference League. Wuxuu sidoo kale xusay in guushii ay ka gaareen Koobka Adduunka ee Kooxaha aysan ahayn mid lala yaabay marka la eego heerka kooxda.\nDhanka kale, falanqeeyaha ciyaaraha Axmed Ghoneim ayaa aaminsan in xaaladda Chelsea hadda aragti ahaan ay ka dhigeyso musharax xooggan oo u tartami kara horyaalka, gaar ahaan kadib guushii ay ka gaareen Koobka Adduunka ee Kooxaha, inkastoo aysan ka mid ahayn kooxaha loo saadaalinayay kahor bilowgii tartanka.\nGhoneim wuxuu intaas ku daray: \"Chelsea waxay sameysay xoojino xooggan, waxaana ugu muuqasho weyn Joao Pedro oo noqday lama filaan heer sare ah wareegyadii dambe ee Koobka Kooxaha. Si kastaba ha ahaatee, kooxda waxay weli u baahan tahay xoojino dheeri ah oo dhanka khadka dhexe, daafaca, iyo goolhayaha ah kahor inta uusan xidhmin suuqa xagaaga, haddii ay doonayaan inay si dhab ah ugu tartamaan horyaalka Premier League.\"\nXigashada Sawirka, Matt McNulty/Getty Images\nKa dib xilliyaal badan oo niyad jab ah oo ay la kulantay horyaalka Premier League, kooxda weyn ee Manchester United waxay suuqa kala iibsiga ku gashay si xooggan iyada oo rejaynaysa inay dib u soo ceshato sharafkeedii lumay. Waa mid ka mid ah kooxaha ugu guulaha badan taariikhda horyaalka Premier League, iyadoo haysata 20 horyaal sida Liverpool.\nKooxda loo yaqaan \"Shayaadiinta Cas\" waxay sameysay saxiixyo badan oo ay dhaleeceeyayaashu u arkaan kuwo muhiim ah oo xooggan. Waxay la soo saxiixdeen Bryan Mbeumo oo ka yimid Brentford; garabka reer xulka Cameroon ayaa ku biiray kooxda si uu u xoojiyo weerarka.\nManchester United sidoo kale waxay la soo saxiixday Benjamin Sesko oo ka yimid RB Leipzig, halkaas oo weeraryahanka reer Slovenia uu ku biiray si uu u xoojiyo safka hore.\nSidoo kale waxay saxiixeen Matheus Cunha oo ka yimid Wolverhampton, weeraryahanka reer Brazil ayaa ku biiray heshiis loogu talagalay in lagu xoojiyo awooda weerarka. Guud ahaan, Manchester United waxay suuqa ku bixisay ilaa £205.2 milyan.\nSaxafiga ciyaaraha Hamza chtioui ayaa BBC-da u sheegay in Manchester United ay weli tahay qayb muhiim ah oo ka mid ah taariikhda kubadda cagta Ingiriiska, gaar ahaan Premier League, inkastoo ay hoos u dhacday natiijooyinkeeda xilliyaashii ugu dambeeyay. Wuxuu sheegay in kaalinta 15-aad ee ay ka galeen xilli ciyaareedkii hore ay ahayd mid gebi ahaanba aan habboonayn United. Wuxuu tilmaamay in dhibaatada kooxda ay tahay mid maamul, maadaama dhibaatooyinkii kooxda ay la kulantay markii uu tababare ahaan joogay Rúben Amorim oo u dhashay Portugal, gaar ahaan muddadii ugu horeysay inkastoo uu natiijooyin wanaagsan ka keenay kooxda Sporting Lisbon, ay weli sii jiraan. Caddeyn ahaan, qaar ka mid ah ciyaartoydii Manchester United ayaa si fiican ugu soo baxay kooxo kale markii ay ka tageen Old Trafford.\nWuxuu sharaxay in maamulka Manchester United uu ku guul darreystay saxiixyo badan oo ciyaartoy ah, wuxuuna xusay in dhibaatooyinka kooxda ay ka weyn yihiin tababaraha keliya. Tani waa wax lagu arkay markii tababarihii hore Erik ten Hag uu sidoo kale ku guul darreystay inkastoo uu guulo ka gaadhay Ajax Amsterdam.\nXigashada Sawirka, James Gill - Danehouse/Getty Images\nCiyaaryahan hore Yaasir Shanuwani wuxuu u sheegay BBC in tartanku uu noqon doono mid aad u xoog badan xilli ciyaareedkan horyaalka Ingiriiska, wuxuuna u arkaa in fursadaha Liverpool oo ah kooxda horyaalka haysta aysan noqon doonin kuwo sida kuwii hore xooggan sababo dhowr ah dartood. Wuxuu sheegay in hoos u dhaca kooxaha waaweyn gaar ahaan Manchester City xilli ciyaareedkii hore uu ka caawiyey kooxda tababare Arne Slot inay ku guuleysato horyaalka.\nYaasir wuxuu rumaysan yahay in maqnaanshaha ciyaartoy badan oo kooxda ka baxay xilli ciyaareedka cusub ay saamayn xun ku yeelan karto, gaar ahaan ka dib markii Darwin Núñez (uu u dhaqaaqay kooxda Al-Hilal ee Sacuudi Carabiya), Luis Díaz (uu u dhaqaaqay Bayern Munich), Trent Alexander-Arnold (uu u dhaqaaqay Real Madrid) iyo geeridii Diogo Jota. Sidoo kale, is waafajinta labadan ciyaaryahan ee cusub, Ekitike iyo Wirtz, oo ku biiray weerarka Mohamed Salah waxay u baahan doontaa waqti.", "date": "2025-08-15", "scraped_at": "2025-11-02T07:38:06.305510+00:00", "category": "news", "text_hash": "ef52b17aaf2771cc19719163b79b4625d7e853b1e4a9cd0779f37b6b0fa4b7cf", "minhash_signature": "2962600,3933238,2147681,8925,277790,1246744,1845235,572333,451149,954980,1204818,3791868,2759579,1297554,2642428,5516467,1196636,3497521,763015,3037854,1662374,845926,1732918,248960,1798629,278784,3785842,1273443,6934782,450202,270738,3988861,742433,856323,3015969,2528682,2171156,3923275,4758193,43845,8293594,5361314,498041,93373,1440166,860454,730965,1429233,13438,2124824,7171895,1946175,1609493,2172602,106244,1587606,8454857,35091,1785014,768577,918305,3162912,2098208,875664,1121812,506330,3709834,3260294,722942,695796,495763,1219715,6118083,1669530,4593935,2233602,1000975,26891,410724,984183,379327,5948215,441903,812995,1752510,4274990,282399,953804,7973447,2785093,683642,3357267,748825,2166611,100139,2216131,1429821,4406387,1118325,560707,101530,6313866,4017340,6370283,8968396,2996761,2406715,2185325,891323,1474751,2670774,269634,6038018,2137501,625717,615640,343490,449496,1692050,9734829,46854,9418810,2409452,989560,2921289,2341326,443497,1046477"}
{"url": "https://www.bbc.com/somali/articles/c28v4gn3mmno", "title": "Wixii kala qabsaday Caasho Geelle iyo aabaheed markii ay surwaal xiratay", "text": "Caasho Geelle Diiriye waa mid ka mid ah hablaha ugu caansan siyaasadda Soomaalida, iyada oo noqotay gabadhii ugu horreysay ee xildhibaan iyo wasiir ka noqota dowlad goboleedka Puntland.\nCaasho waxa ay markii dambe noqotay Guddoomiyaha Guddiga Dib-u-eegista Dastuurka Soomaaliya.\nWaxay-se hadda BBC uga warramaysa dhinaca kale ee nolosheeda carruurnimada, jaceylkii ay u qabtay kubadda kolayga, iyo masiibadii dhacday maalinkii arooskeeda, heesaha Sahra Axmed Jaamac. Waxay u warrantay weriye Faaduma Taxadar Yuusuf.", "date": "2023-10-19", "scraped_at": "2025-11-02T07:39:06.201805+00:00", "category": "news", "text_hash": "43eebaf49d9f2e3ab070a695af3eb349595172798cae7e14d3a49d0029674574", "minhash_signature": "27047303,2300313,17646737,23371193,28451263,29613279,80888141,50067146,51858475,27264787,14138566,6283743,17317111,12358336,103236464,110216300,54141827,61843421,156284020,151636367,89352655,167204945,64833064,51707218,22706292,44466385,16802186,14511742,7447042,68007848,7141834,51747887,4562291,137463530,50701532,35621036,45331594,15324282,80159318,122804385,21619298,188087558,48624464,76552842,15879183,36199976,55725522,6683361,13289316,62418217,3953041,47963264,9677735,11425363,33534190,4387786,26013552,45303767,184270708,172748897,7949893,29876476,34305691,33702890,37130360,1250551,184014456,33762454,52517391,65488709,43641121,34749072,43530817,138611046,12387957,33288394,134099279,21558094,193790014,169181724,5031158,79616809,40758634,28351839,16758229,92209117,273465225,48583580,71724603,9682654,194617766,32624262,86079273,65926182,29254145,88440444,58805851,74931885,1492760,52595932,172180640,140096224,14278395,39986988,45877858,55866735,92275915,60282971,90197070,16996236,19897270,13819347,81087226,47868015,2313033,53581826,16583200,129313755,9934125,38434479,104939778,83040644,29041571,30688050,13079584,83298967,67255053,245548827"}
{"url": "https://www.bbc.com/somali/articles/c5yd5z23ggqo", "title": "Sheekada nin qashinka nadiifin jirey oo maanta haysta malaayiin doolar", "text": "Xigashada Sawirka, Getty Images\nShaqadani ma aha mid qof jilicsan u fudud.\nBen Giles, oo ah nadiifiye khabiir ah, ayaa 25 sano ay ku qaadatay inuu barto xirfadda lagu tirtiro nooc kasta oo wasakh ah — ha ahaato mid ka dhalatay wax daatay, qashin, dhaawacyo ama hadhaaga goobaha dambiyadu ka dhacaan.\nBen, oo hadda 49 jir ah, markii uu bilaabay inuu daaqadaha ka nadiifiyo magaalo yar oo ku taalla galbeedka Wales, marnaba ma filayn in arrintaas ay u horseedi doonto ganacsi malaayiin doollar ah, kaddib markii uu si kadis ah ogaaday in lacag badan laga samayn karo nadiifinta meelaha uu qof ku dhintay ama musqulaha buux dhaafay ee wasakhda ah.\nBen wuxuu daaqadaha ka nadiifinayay magaalada Cardigan, oo ku taalla Ceredigion, markii mid ka mid ah macaamiishiisu uu weydiistay inuu nadiifiyo guri aan la degin muddo 10 sano ah.\nIsaga oo aan xiran wax aaan ka badan maaskarradii gacmaha iyo wejiga ah, ayuu nadiifintaas bilaabay — waana halka uu ganacsigiisu ka dhashay.\nBen wuxuu sheegay in markii uu albaabka furay gurigaas uu wajahay ur aad u xun oo keentay in mid ka mid ah raggii ka caawinayay shaqadan uu  matago, isaga oo xidhan maaskarahii wejiga.\nEnd of Ugu akhris badan\n\"Waxaan khasab noqotay inaan maaskii ka siibno, matagii oo dhan dhulka ayuu ku daatay, markaas waa inaan nadiifinnaa matagii isaga iyo guriga intiisii kaleba,\" ayuu Ben si kaftan ah u yidhi.\nBen waxa uu shaqadii ka helay biil dhan £2,000 — taas ayaana ahayd markii uu gartay inuu helay \"meel dahab ah oo lacag badan laga samayn karo\".\n\"Waxaan is niri, haddii aan intan ku kasbeynayno nadiifinta sidan oo kale ah, maxay noqon kartaa tan ugu xun ee aan nadiifin karno? Ugu dambayn, waxaan go'aansanay inaan wax walba nadiifinno.\"\nXigashada Sawirka, Owen Howells Photography\nShaqadoodii ugu horreysay waxay ahayd nadiifinta guri uu nin ku dhintay, kaasoo la helay laba bilood kadib geeridiisa.\nJidhkiisu wuu qudhmay ilaa uu ka dhex milmay roogga, dabaqa alwaaxda ah, xitaa wuxuu gaaray sibidhka hoostiisa, dheecaankiisii.\n\"Markii aan albaabka furnay, duqsiyaal buluug ah ayaa si xoog leh noo dhaafay. Ma garanaynin in ay sideen cudurro, waana inaan isku daynaa inaan ka soo saarno dareerihii jirka ee siddeed toddobaad ku jiray sibidhka dhexdiisa,\" ayuu yiri Ben.\n\"Waxay ahayd hawl aan khibrad u lahayn — si fudud waa tijaabo iyo nasiib.\"\n\"Waan xasuustaa inaan qalab urta badhxaya ku dhajisannay sanka hoostiisa si aanu u yareyno urta. Mid ka mid ah wiilashii ayaa qufacay, labo xabbadood oo liin maqaar ah ayaa ka soo baxday maaskiisa — wuxuu gashtay maqaar liineed ah si uu  isaga dedo urta!\"\nBen wuxuu tababaray ku dhowaad 3,500 oo qof, balse wuu qirtay in aysan ahayn shaqo qof walba u fudud — mararka qaar way adagtahay in la illaawo wixii la arkay, waxaana jira kiisas qaar oo maskaxdiisa ku hadhay sanado badan.\nMid ka mid ah kiisaskaas wuxuu ahaa nin si xun garaacay xaaskiisa weliba si naxariis darro ah, kagana tagay  guriga muddo saddex maalmood ah, ilaa deriskooda ay heleen — iyadoo weli nool — balse ay ku dhimatay intii lagu sii waday isbitaalka.\n\"Intii aan shaqadan hayay, waligay ma arag wax sidan u xun,\" ayuu yiri Ben.\nMarkii uu gudaha u galay, waxaa horteeda yaallay muuqaal argagax leh, dhiigguna wuxuu ku firdhay dhamaan gidaarrada iyo dusha sare ee guriga.\n\"Waxay ii ahayd dhacdo murugo badan heerar badan oo kala duwan ah. Aad ayaan uga naxay haweeneydaas.\"\n\"Labadooduba waa dad xirfadlayaal ahaa. Ilaa hadda ma fahmin waxa qof ku qasbi kara fal sidan u madow oo uu nolosha qof kale uga qaado sudaa arxan darrada ah.\"\n\"Maskaxdayda ma rabo inaan dib u xasuusto fikir noocaas ah — waxay ahayd xaalad mugdi ah.\"\nXigashada Sawirka, Owen Howells Photography\nBen wuxuu sidoo kale la kulmay dhacdo naxdin leh oo ahayd markii loogu yeedhay ey qoyska lahaa uu dilay ilmo yar, isaga oo yiri: \"Marka aan nadiifinaynay qol ka mid ah guriga, waxaan ka maqlaynay oohin iyo baroor ka imaneysa qolka nagu xiga.\"\nWuxuu raaciyay: \"Waxaa jiray waqtiyo sidan oo kale ah oo ay khasab igu noqday inaan xidho koofiyadda ganacsiga oo aan is xasuusiyo in tani ay shaqadayda tahay — waa inaan qabtaa, dabadeedna si tartiib ah uga tagaa.\"\n\"Waan cadaadiyaa dareenkaas,\" ayuu yiri.\nSi uu ula tacaalo culayska shaqada, Ben wuxuu jecel yahay inuu socod ku maro xeebta, ciyaaro ciyaarta golf, ama uu xanaaneeyo lo'diisa si uu uga nasto wewerkii shaqada iyo hawsheedii.\nKaliya markii uu qorayay buuggiisa taariikh nololeed ee \"The Life of a Crime Scene Cleaner\" ayuu Ben bilaabay inuu si dhab ah uga warbixiyo dareenkiisa ku aaddan waxyaabihii argagaxa lahaa ee uu goobaha dambiyada ku arkay.\n\"Waxay ahayd sidii dareen aan hore u xannibay oo hal mar isoo dhaafay,\" ayuu qirtay. \"Ma dhihi karo waxay ahayd daawayn, sababtoo ah ma oran karo waan ka bogsaday\"\n\"Waxaan maskaxda ku hayay cinwaanno u gaar ah sheeko kasta, markaan bilaabay inaan ka qoro mid kasta, waxaan bilaabay inaan ooyo,\" ayuu raaciyay.\nBen wuxuu qoyskiisa ku ammaanay inay garab istaageen, inkastoo uu la tacaalayay culayska maskaxeed ee shaqadiisa.\n\"Waan ogaa, wax kasta oo ka dhaca shaqada, inaan guriga imaado anigoo og in uu yahay meel ammaan ah, oo ay joogaan dad aan jecelahay oo i jecel,\" ayuu yidhi.", "date": "2025-10-31", "scraped_at": "2025-11-02T07:40:06.455175+00:00", "category": "news", "text_hash": "fec8137c32edc0f8b274e42bfe5d627e3a940c8922f5dbd8edfbe1300741b244", "minhash_signature": "2399865,4321010,2147681,12084849,4140259,2261096,6240602,13106998,3534613,16173896,8553,913812,944931,5005899,24184666,1252555,1024942,3137779,1207548,4784347,3658462,1006185,9781269,1295822,2605633,1356501,7389121,2981132,2555444,6350243,4264980,5005564,8554772,13630253,17282862,766449,10214931,175614,7760022,11575124,8493529,6083992,10867762,5897693,12805733,1121031,3673522,2285909,429151,5686566,14230160,6959411,1277917,60986,1431096,1621902,1032961,12714458,9503118,13186358,673452,1967143,5676518,6689498,596778,6492833,6298303,3304251,448772,772245,1237969,5762105,13151129,8107605,8604578,1719560,6237103,1369999,7328194,6071907,9116904,8158964,9454937,278300,13971923,6899998,11897195,3225104,14425849,4768523,4321322,12270693,3502350,1883812,9773698,15893021,2647899,2040402,544662,1597811,607692,5874717,14278395,15757263,10404421,997064,352707,3408770,1021868,32475534,9735601,5601312,6316400,4697037,1467391,3640974,691615,6440976,18854992,5420716,1494196,607030,8402114,9871613,1891394,17698442,27840435,13299904"}
{"url": "https://www.bbc.com/somali/articles/cd7rrq71v00o?at_medium=RSS&at_campaign=rss", "title": "Xanuunnada halista ah ee laga yaabo inay yeelan karaan dadka qoorta weyn leh", "text": "Xigashada Sawirka, Getty Images\nCaadi ahaan waxa aynu ogaanaa in miisaankeenu kordhay marka ay caloosheenu korto ama dharkeenna aan ka dareeno inuu ciriir nagu noqday.\nLaakiin waxaa jira hal meel oo ka mid ah jirka oo dadka intooda badan ay iska indhatiraan oo na siin kara tilmaamo ku saabsan caafimaadkeena: qoorta. Haddii si caadiyan ah ay buurato ama dhuubato, waxay noqon kartaa astaan muujisa dhibaato caafimaad.\nDufanka jidhka guud ahaan waxaa lagu xisaabiyaa iyadoo miisaanka qofka loo qaybiyo dhererkiisa si loo helo Tusmada Miisaanka Jirka.\nInkastoo tani ay tahay bilow wanaagsan, haddana uma shaqeyso dad badan, sida dadka jirka dhisa, maadaama murqahooda badan ay keento miisaan ka weyn tan caadiga ah.\nSidaa darteed, cabbiraadda wareegga qoortaada waxay ku siin kartaa macluumaad dheeraad ah oo ku saabsan caafimaadkaaga.\nHaddaba, haddii aad haysato xadhig cabbir, waa imisa cabbirka uu noqon lahaa?\nEnd of Ugu akhris badan\nXigashada Sawirka, Getty Images\n\"Wareegga qoorta dumarka waa inuu ahaadaa 33 ilaa 35 sentimitir, halka ragga uu yahay 37 ilaa 40 sentimitir,\" ayuu yiri Dr. Shiv Kumar Sarin, agaasimaha Machadka Beerka iyo Cilmiga Biliary ee Delhi, India, iyo guddoomiyaha Akadeemiyadda Qaranka ee Cilmiga Caafimaadka.\nQaar ka mid ah dadka waxay qaadaan miisaan si qoortooda uga muuqato mid xooggan, ciyaartoyda feerka iyo ciyaartoyda rugby-ga waxay ku faani karaan qoor dhumuc weyn leh. Laakiin bannaanka Jiimka, tani mar walba ma aha wax wanaagsan.\n\"Haddii qoorta qofka ay ka dhumuc weyn  tahay sida caadiga ah, waxay muujineysaa dhibaato caafimaad iyo in jirkiisu uu ku soo wajahan yahay cayil,\" ayuu yiri Amitav Banerjee, oo ah borofisar wax ka dhiga Dugsiga Caafimaadka DY ee Pune, India. \"Cudurro badan ayaa lala xiriiriyaa cayilka.\"\nDufanka ku wareegsan qoorta ayaa ka duwan dufanka maqaarka hoostiisa (subcutaneous fat), kaas oo jilicsan oo laga helo meelaha kale ee jirka sida miskaha.\n\"Haddii aad cayilan tahay, jirkaga wuxuu sidoo kale leeyahay dufan qarsoon oo ku jira caloosha iyo agagaarka xubnaha, kaas oo loo yaqaan dufanka gudaha (visceral fat). Dufankan ma aha mid  aamusan, balse waa mid firfircoon oo saameeya sonkorta dhiigga, kolestaroolka, iyo cadaadiska dhiigga.\"\n\"Qoortu waa meel ka mid ah meelaha tan lagu arki karo waxayna tilmaamaysaa tirada dufanka jirka ee xad-dhaafka ah,\" ayuu yiri Dr. Ahmed Elbediwy, agaasimaha barnaamijka Biochemistry ee Jaamacadda Kingston ee London. \"Marka aad cayilan tahay, qoortaadu way sii weynaan doontaa.\nXigashada Sawirka, Getty Images\nHaddii qoorta qofka ay u muuqato mid ka dhumuc weyn sidii caadiga ahayd, waxaa laga yaabaa inay tilmaamayso 'metabolic syndrome', oo ah koox dhibaatooyin caafimaad oo kordhiya halista inay ku dhacdo sonkorowga nooca 2-aad ama xaalado saameeya wadnaha ama xididdada dhiigga.\"\nTani waa sababta oo ah, haddii aad leedahay dufanka jidhka ee dheeraadka ah, waxaad leedahay unugyo dufan ah oo dheeraad ah oo si fudud ugu milma dhiigga.\n\"Qofka qoortu qaro weyn tahay waxaa laga yaabaa inuu yeesho kolestarool sare, beerka dufanka leh, sonkorowga, iyo dhiig karka. Tani waxay u baahan tahay qiimeyn gaar ah,\" ayuu yiri Dr. Mohsin Wali, lataliye sare oo ka tirsan Isbitaalka Sir Ganga Ram ee Delhi. Sidoo kale waxay keeni kartaa neefta la'aanta hurdada (sleep apnea), taasoo saameysa dareenka nasashada ee dadka.\nHaddii qoortaadu aad u dhumuc weyn tahay, 'ha ka welwelin,' ayuu yiri Dr. Ahmed Elbediwy oo ka tirsan Jaamacadda Kingston. 'Cunto dheeli tiran iyo jimicsi joogto ah waxay gacan ka geystaan caafimaadka guud, sidoo kale waxay ka caawiyaan dhimista miisaanka.\nJimicsiga iyo dhimista miisaanka ayaa kaa caawin kara yaraynta dufanka sare ee jirka, halka hurdada nasashada ay kor u qaaddo nidaamka dheef-shiid kiimikaadka iyo soo kabashada. Cunto isku dheeli tiran, oo qani ku ah digirta, miraha, iyo khudaarta, ayaa bixisa nafaqooyinka lagama maarmaanka ah iyada oo aan lahayn kalooriyo dheeraad ah.\nXigashada Sawirka, Getty Images\nQoorta caatada ah ayaa muddo dheer lala xiriiriyay quruxda jirka. Dadku waxay xirtaan dahabka si ay u soo jiitaan dareenka xagga hore ee qoorta oo ay kor ugu qaadaan muuqaalkeeda.\nQaar ka mid ah dalalka Afrika, haweenku waxay qoorta ugu xirtaan silsilado gaar ah si ay ugu muuqdaan kuwo leh qoor dheer oo dhuuban.\nLaakiin inkastoo qoorta dhuuban loo arki karo tilmaan quruxsan, qoorta ka dhuuban sidii caadiga ahayd waxay noqon kartaa calaamad dhiig-yaraan, sida ay dhakhaatiirtu sheegeen.\"\n\"Dadkaas waxaa la siiya bir, fiitamiinno, iyo nafaqooyin kale. Xaalado badan, waxaa laga yaabaa inay xitaa u baahdaan dhiig-lagu shubo,\" ayuu yiri Dr. Atreya Niharachandra.\nDadka qoortoodu dhuuban tahay waxay sidoo kale yeelan karaan laf dheeraad ah oo qoorta ka tirsan,qoortu waxay leedahay toddobo lafood, laakiin dad qaar waxay leeyihiin sideed, taasoo la mid ah sida qof u leeyahay lix farood halkii uu shan faroor lahaan lahaa.\nSi kastaba ha ahaatee, waa mid lagu dhasho oo, inta badan, waxaa si lama filaan ah loogu ogaadaa raajada qoorta sabab kale. Tani inta badan ma keento wax dhibaato ah.\nXaalad kale oo laga arki karo qoorta waa goiter, oo ah buro ama barar ka soo baxa qeybta hore ee qoorta kaas oo uu keeno caabuqa qanjirka thyroid.\nGoiter-ka badanaa wuxuu ka soo muuqdaa qeybta hoose ee hore ee qoorta, waxa uuna dareemmi karaa mid siman ama buro leh, mararka qaarna waxaa barar ka muuqda hal dhinac oo kaliya.\nBadana xanuun ama dhib ma leh, laakiin Adeegga Caafimaadka Qaranka ee UK (NHS) ayaa ku talinaya in lala tashado dhakhtar.\nMarkaa, marka xigta ee aad muraayadda isku eegto, si dhow u fiirso qoortaada; waxa laga yaabaa inay muujiso in ka badan intaad u malaynayso.", "date": "2025-11-02", "scraped_at": "2025-11-02T07:41:06.272281+00:00", "category": "news", "text_hash": "2b1c8d80d5954e9d7b84d285110e1bc37d69457ff5f4f058eddbf5bfefd3b36f", "minhash_signature": "14104746,6848255,4753944,7072257,1019702,1633003,1441948,4670642,1236962,716752,12020693,996094,4519598,6826171,434867,209969,8668489,2026885,11047706,1294615,2682179,2728032,1135647,1208168,9650532,2844655,7733435,938207,2161841,14786962,5238891,1560393,379576,5566643,9249443,13590183,1990662,1541158,598898,1442641,2650756,5673898,199518,9449588,8191347,8939618,2287372,4646676,1931987,9073685,11288373,6938216,1986820,1400624,1077543,1670546,1272088,24434868,24258642,23743856,3258447,4573079,8331556,688869,2129300,5397080,9019187,3362977,3848063,20201205,11850923,2097752,534343,621683,3629098,1586465,2320574,1200876,101920,9485227,4634070,1259175,7013000,242991,917179,1671265,1566273,2448874,444779,682270,663246,17679871,5848017,182692,3596230,1176413,10736090,325544,1200293,2056154,7895325,2611370,11806711,3406941,3214949,2892207,10090337,6522464,863048,325677,6154931,7045328,404504,413740,2107726,5274089,1803366,4100230,6051309,8207533,802867,1641254,2973749,745817,1018318,5878074,1032126,11468236"}
{"url": "https://www.bbc.com/somali/articles/cq500d2v3vyo?at_medium=RSS&at_campaign=rss", "title": "Dadka daawada mareeg baahisa muuqaalo qaawani ah oo hoos u dhacay '77%' gudaha UK.", "text": "Xigashada Sawirka, Getty Images\nPornhub, oo ka mid ah mareegaha ugu daawashada badan caalamka kuwooda faafiay galmada, ayaa sheegtay in tirada dadka soo booqda website-keeda ee UK ay hoos u dhaceen \"77 boqolkiiba\" marka loo eego saddex bilood ka hor.\nHoos u dhaca booqdayaasha ayaa timid kadib markii la hirgaliyay Xeerka Badbaadada onlaynka , kaas oo soo rogaya xaddidaadyo da'da gelitaanka waxyaabaha la xiriira galmada.\nPornhub waxay sheegtay in shabakadaha iska indhatiraya shuruudahan cusub iyo xaddidaadaha la xiriira arrinkaan ay hadda ka faa'iideysanaya xaaladda.\nBBC si madaxbanaan uma xaqiijin karto sheegashadan, laakiin xogta Google ayaa muujinaysa in raadinta magaca website-kaan uu ku dhawaad ​​kala bar hoos u dhacay tan iyo markii sharciga la dhaqan galiyay.\nHoos u dhacan waxaa sabab u ah hoos u dhaca daawashada waxyaabaha xun xun, laakiin suurtagalnimada kale waa adeegsiga VPN-yada si loo galo goobta iyada oo loo marayo habab qarinaya waddanka isticmaalaha.\nSida laga soo xigtay xog ay baahisay shabakadda SimilarWeb, Pornhub waa shabakadda internetka ee ugu booqashada badan adduunka iyo bogga 19-aad ee loogu booqashada badan yahay internetka oo dhan.\nEnd of Ugu akhris badan\nMarka loo eego Xeerka Badbaadada onlaynka, isticmaale kasta oo UK jooga ee raba inuu galo mareegahaas waa inuu caddeeyaa inay ka weyn yihiin 18 sano. Da'daan waxa lagu xaqiijin karaa iyadoo la isticmaalayo tignoolajiyada sida aqoonsiga wejiga.\nWaxa Pornhub ay leedahay waa calaamad kale oo muujinaysa in isticmaaleyaasha UK ay beddeleen habka ay u isticmaalaan internetka tan iyo markii uu sharciga dhaqan galay.\nSida lagu sheegay warbixin ay soo saartay Ofcom, oo ah maamulaha isgaadhsiinta ee Ingiriiska, tirada booqashooyinka bogagga internetka ee akhlaaqda xun ayaa hoos u dhacay saddex meelood meel saddexdii bilood ee ugu dambeeyay.\nSida laga soo xigtay Ofcom, sharcigu wuxuu ku guuleystey inuu gaaro ujeedadiisa ugu weyn, taas oo ah in laga hortago carruurta inay si fudud u helaan waxyaabaha xun xun.\n\"Xeerarkayada cusub waxay soo afjarayaan xilligii da'da internet-ka, halkaasoo goobo badan iyo apps aysan samaynin wax baaritaan ah oo wax ku ool ah si loo hubiyo in carruurta aysan isticmaalin,\" ayay hay'addu ku tiri hadal ay soo saartay.\nOfcom ayaa sidoo kale BBC-da u sheegtay in dadka isticmaala VPN-yada gudaha UK ay gaareen 1.5 milyan maalin kasta bishii Luulyo, balse hadda ay hoos u dhacday illaa hal milyan tan iyo markii sharcigan la dhaqan geliyay.\nDhanka kale, cilmi baaris ay sameysay shirkadda amniga internetka ee CyberNews ayaa muujineysa in ku dhawaad ​​11 milyan oo Apps oo VPN ah lagala soo degay Google Play iyo App Stores gudaha UK sanadka 2025.", "date": "2025-10-31", "scraped_at": "2025-11-02T07:42:06.467887+00:00", "category": "news", "text_hash": "63c3dd402ae9e21203d4ad635de10bb8e3d6514b13cf5c4ad989557e1bd86f8b", "minhash_signature": "807998,13721723,31001180,19965106,283645,2116455,16665909,3297988,22142877,41435610,6985537,8978590,12396599,611611,10471815,7074468,1501753,342682,21282666,9847103,8008660,9179647,1594751,4436629,10159061,23118772,8718120,5551806,13209737,5388701,7745529,3843889,12126974,4289595,5618227,3350372,32177077,17946640,1218917,16479579,1306829,227081,27666852,1818873,1596655,2262237,10909935,3613350,317203,3665603,8312247,19040965,6007782,11388120,995397,3411431,32092863,809471,9741577,12863969,7353860,3012680,12852227,5833390,7158487,16465292,4377801,5322382,7238279,53214795,106894,19342483,14830466,10759515,8814120,16559835,1343873,5502131,4428665,20306880,3842415,2220625,8844122,12118572,35075963,18768005,27559301,6226352,11396474,9075026,11424737,33985669,4620117,2269668,3155307,794244,34862108,50584279,1492760,970920,15553167,39996966,8002543,54288024,11105580,16928553,11966414,17152936,10985100,28532050,4653487,14679388,9592891,17067371,12742673,210411,2673840,12442481,5029726,55692462,5146429,2899897,2677,1767258,18805174,39139878,1805453,17686576"}
{"url": "https://www.bbc.com/somali/articles/c1dgx16xp70o", "title": "Sida qoraal bakhtiyaa-nasiib ah ka dib uu ugu dhammaaday farxad waligeed ah", "text": "Donovan Shears, wuxuu fariin qoraala u diray number si bakhtiyaa-nasiib ah sanadkii 1998-dii balse taasi waxay beddeshay noloshiisa.\nWuxuu helay telephonkiisii ugu horreeyey markuu jiray da'ada siddeed iyo tobban jir markaas oo u ogaaday fariimo dirida.\nWuxuu ku nasiib saday number wuxuuna u diray fariin isagoo leh \"hello\" taas oo xaaskiisii mustaqbalka Kirsty ay dib ugu soo qortay \"hi\"\n\"Waqtigaas keli ah wuxuu horseeday in ka badan 20 sano oo jacayl, qosol, iyo iskaashi ah,\" ayay tiri.\nDhowr fariimood oo uu u diray numbaro aanu garayn, wuxuu ka dirayey isagoo jooga Coventry pub, halkaas oo uu ka shaqaynayey habeenkaas, Kirsty oo ku sugnayn Cleethorpes, ayaa ahayd qofka kaliya ee hal mar u soo jawaabtay.\nAfar sano ka dib, lamaanaha ayaa isku guursaday Scotland, halka ay ka soo jeedo Kirsty. Hadda waxay haystaan laba caruura oo da'doodu kala tahay lix iyo sagal sano jir.\nEnd of Ugu akhris badan\nKirsty, waxa ay sheegtay in ay uga jawaabtay fariinta Donovan  iyada oo u malaynaysa in uu yahay qof ay garanaysay, balse nambarkiisa aanay ku kaydsan telefoonkeeda.\nIyagoo la hadlayey BBC CWR, waxay soo xasuusteen sidii ay markii ugu horreysay ugu kulmeen xarunta tareenada ee magaalada Coventry  iyo siday u markii ugu horreysay u yeesheen haasaawahoodii goob lagu caweeyo oo markaas caanka ahayd, Colosseum, oo hadda loo yaqaan The Kasbah.\nDonovan ayaa yiri \"Waxaan bilaabay inay si bakhtiyaa-nasiib ah fariimo u diro. Anigoo tusaya saaxiibaday.\n\"Waxaan soo qaaday afarta number oo ugu horreysa si la mid ah sidaydii  ka dibna saddexda number ee ugu dembaysa sibakhtiyaa-nasiib ah. waxay ahayd ilaa shan ama lix number oo kala duwan, ka dibna kuma firkin wax kale,\"\nKristy ayaa Iyana tiri \"Waxaan fariimo isu diri jirnay maalinta oo dhan ka dibna waxay noqotay mid aad iyo aadu badan ka dibna waxaan go'aansanay in aan taleefoon isku dirno\"\n\"Waxaan isku diri jirnay fariimo si badan, telefoonkayga kharashkiisu wuxuu ka badnaa 250 gani bishii. Waxay u malaynayaa intaasi ay ahay markii aan go'aansaday inaan is wacno\"ayuu hadalkiisa sii raaciyey Donovan.\n\"Dareenku wuxuu bilaabay inuu horumaro, waxayna lahayd lahjad Scottish ah oo aad u qurux badan, taasoo sidoo kale i soo jiidatay.\"\nLabada lamaane ayaa ugu dambeyntii kulmay ilaa lix bilood ka dib markii Donovan uu diray qoraalkii ugu horreeyay.\n\"Waxaan ku iri gabar walaashey ah, waa inaan aado oo aan la kulmo ninkan, waxayna u egtahay, 'Wuxuu noqon karaa qof kasta', waxaanan ku iri, 'Haa, waan ogahay', laakiin waxaan ahaa runtii 18 sano jiro an marnaba ka fekerin wax ku saabsan caawaaqibka,\" ayey tiri Kirsty.\n\"Kaliya waxaan fuulay tareen oo waxaan imid Coventry.\"\nDonovan,wuxuu sheegay inuu ka cabsi qabay inuu talaabada koowaad qaado, laakiin Kirsty aad ayey ugu kalsooni badnayd.\n\"Inta kale waa taariikh\" ayuu yiri\n\"Waxaan xasuustaa markii an ka soo laabtay habeenkeenii koowaad ee bannaanka, kaliya waa is laab galinay, waxay ahayd wax mujiso oo kale ah\"\n\"Waa haweeney cajiib ah, aad ayay u caqli badan tahay, si fiican ayaan isu naqaannaa, waa saaxiibkayga ugu fiican iyo sidoo kale xaaskayga.\"\nIn ka badan 20 sano laga bilaabo maalintoodii weynayd, labada qof ayaa ka qayb qaadan doona cusboonaysiinta nidarka ee Coventry Cathedral ee Maalinta Jacaylka, oo ay soo qabanqaabisay BBC CWR.\nDonovan, wuxuu sheegay inay rajeynayaan inay u dabaaldegaan maalintaas qoys ahaan.\n\"Waxaan wilkeyga u soo qaaday Suud le'eg  shalay, dhab ahaantiina wuuu jeclaaday,ka dibna gabadhayda, waxay leedahay, 'Waxaan rabaa inaan arko hooyaday oo labisan', ma sugi karto,\" ayuu raaciyay.", "date": "2025-01-26", "scraped_at": "2025-11-02T07:43:06.681116+00:00", "category": "news", "text_hash": "78e8db9fa1c1f3c78e2f13e3cb54138115f2b692f09fe7c4e452e9a7b256cfa9", "minhash_signature": "738738,25369260,129876,1027094,9704126,16638844,1016526,4909165,50698865,725850,2908209,1832541,7986418,10198341,7221883,8991447,1649161,5266189,4646179,467555,1556434,3426969,7470357,12108401,15200664,7258575,16586581,7778848,5936513,5986649,6887085,10299859,18471178,10537177,5426308,16857319,6200058,1728050,2167745,6432345,1733481,2236442,4933996,10375777,11596289,6308267,3375392,8878444,4848575,3717648,11923863,1233666,122793,7041116,970694,4578253,6134379,1192583,4627123,1389641,427737,15106222,7824126,10170677,8650068,999982,5897146,1754010,7429390,11714141,1983052,2473158,2945433,2375048,1313177,7669774,10064257,8204200,11011889,4503021,5827388,2189899,4745292,14061327,1752510,14123851,6716364,20188307,5577016,15180593,14347706,17411096,883023,2370249,12586960,8329859,5036027,8978812,1873066,992063,4938002,7809690,1111862,4378721,13760749,3957559,26177648,1925442,11394830,8875455,52188212,5595615,5771701,12029318,17039951,658133,1681838,3311558,1022363,1063087,8939110,21259993,2611904,6256499,18592164,3349482,3715337,3623474"}
{"url": "https://www.bbc.com/somali/articles/c5yp21xdpvpo", "title": "Halista caafimaad ee dawooyinka la isku caateeyo ee dad qarkii quruxda ka raadiyaan", "text": "Xigashada Sawirka, Courtesy of Gabriela\nMarkii Gabriela ay billowday inay isku daydo dhimista miisaankii ku kordhay xilligii cudurka Covid, waxay ogaatay in dhowr kiilo oo miisan aysan gebi ahaanba is dhimaynin.\nGabriela oo ah garyaqaan dagan magaalada Rio de Janeiro ee dalka Brazil, waxay miisaankeedu ahaa 76kg iyadoo dhererkeedu yahay 1.69m (ama 5ft 6in). Waxay tiri, \"Wax walba waan isku dayay\" — oo ay ku jiraan cunista cunto badan iyo jimicsiyo adag lix jeer usbuucii — \"laakiin waxba isma bedelin.\"\nKadib saaxiibadeed, kuwaas oo iyaguna ah xirfadlayaal guuleystay, ayaa la wadaagay sir — waxay adeegsanayeen dawo cirbad ahaan loo qaato oo lagu yareeyo miisaanka waxaana ay aad ugu faraxsanaayeen natiijada.\nInkasta oo ay ahayd qof caafimaad qabta oo muddo dheer jimicsi samayn jirtay isla markaana leh qaab jidheed u dhigma dadka jimicsada, haddana Gabriela, oo 40 jir ah, waxay go'aansatay inay iyaduna isku daydo wixii saaxaabadeed ay sameeyeen oo kale.\nWaxay iibsatay cirbadda Ozempic ka iibsatay farmashiye ku yaal Rio de Janeiro  bishii Febraayo 2024 — iyada oo aan wadan warqad dhakhta rsoo qoray iyo aananna buuxin shuruudaha caafimaad ee lagu qoro cirbadda — waxayna bilowday isticmaalka iyada oo aan haysan kormeero caafimaad.\nXigashada Sawirka, Getty Images\n\"Waxay ahayd wax aan la rumaysan karin,\" ayay Gabriela xasuusataa.\nEnd of Ugu akhris badan\n\"Waxaan aaday makhaayad Japanese ah, lix xabbo oo sushi ah ayaan cunay, waxaana dareemay sidii inaan cunay kiilo dhan oo hilib ah.\"\nGabriela ma rabto in dadweynuhu ogaadaan isticmaalkeeda daawadan, sidaas darteed BBC waxay ku isticmaalaysaa magac an rasmi ahayn maqaalkaan.\nIlaa maanta si goosgoos ah u isticmaashaa dawada.\n\"Markaan iski eego muraayadda oo aan arko muuqaal i farxad gelinaya, wax kasta oo noloshayda ah way fududaadaan,\" ayay tidhi.\nLaakiin dhakhaatiirta waxay uga digayaan dadka sida Gabriela oo kale — kuwa aan u baahnayn dawadan caafimaad ahaan isla markaana isticmaalaya iyaga oo aan la tashan takhtar — in ay khatar weyn gelinayaan caafimaadkooda.\nInkasta oo shuruudaha qorista ay ku kala duwan yihiin dalalka, haddana dawadan waxaa badanaa loo qoraa dadka waaweyn ee loo tixgeliyo cayil tira badan, ama kuwa qaba xaalado caafimaad oo la xidhiidha miisaankoda sida sonkorow, dhiig kar, ama wadne xanuun.\nSi kastaba ha ahaatee, si sii kordheysa ayaa dawadan loogu adeegsadaa ujeeddooyin kale sida in miisaanka lagu dhimo, xitaa marka aysan jirin baahi caafimaad.\nMarkii Gabriela ay bilowday isticmaalka, waxay ahayd \"qof wax yar cayilan.\". Qaraabadeeda, asxaabteeda, xitaa dhakhaatiir aya si joogto ah uga waraysta halka laga heli karo dawadan.\nDhanka kale, Dr Bharti Shetye, oo ah ku-xigeenka madaxweynaha Ururka Daaweynta Cayilka ee Mareykanka, ayaa sheegtay in ay dunida oo dhan ka shaqeyso — oo ay ku jirto Hindiya, Bariga Dhexe, iyo Mareykanka — isla markaana meel kasta oo ay tagto ay maqasho \"dad aad u badan oo isticmaalaya dawadan una adeegsadaan qaab is qurxin ah.\".\nBishii Ogosto, ciyaaryahanka caanka ah ee tennis-ka Serena Williams — oo ka mid ah ciyaartoyda ugu guusha badan taariikhda — ayaa si furan u sheegtay in ay isticmaasho cirbadaha lagu dhimo miisaanka.\nSidoo kale Kelly Osbourne, oo ah qof caan ka ah telefishinka, ayaa hore u sheegtay in ay isticmaasho dawadan, waxayna sababta ay u qaadatay ku soo koobtay wareysi ay bixisay 2024-kii iyadoo leh:\n\"Waxaa jira malaayiin siyaabood oo miisaan lagu dhimo. Haddaba maxaa diidaya in lagu sameeyo qaab aan caajis ahayn sida jimicsiga?\"\nDhanka kale, Andrew, oo ah maamule sare oo ku nool London bartankeeda, kuna caan ah qabanqaabinta xafladada, waxa uu sheegay in sababta uu u bilaabay isticmaalka dawadan ay ahayd murugada uu ka qabay muuqaalka jirkiisa.\nMid ka mid ah dhibaatooyinka jira waa in ay adag tahay in la xakameyn karo isticmaalka cirbadaha miisaanka lagu dhimo ee loogu talagalay dadka keliya haysta warqad dhakhtar.\nGudaha UK, dawadan waxaa lagu heli karaa oo keliya marka uu dhakhtar kuu qoro.\nLaakiin dhakhaatiir iyo dad ay BBC la hadashay ayaa sheegay in qaar ka mid ah farmashiyeyaasha onlaynka ah ay si dhab ah u sameeyaan kormeer aad u yar marka ay iibinayaan dawadan.\nSida laga soo xigtay shirkadda xog ururinta suuqyada IQVIA, ilaa Maarso 2025 waxaa lagu qiyaasay in 1.5 milyan oo qof oo UK ah ay isticmaalayeen cirbadaha lagu dhimo miisaanka, iyadoo 95% ay ka iibsadeen onlayn.\nHoraantii 2025, Guddiga Guud ee Farmashiyaasha UK ayaa adkeeyay xeerarka ku saabsan sida farmashiyeyaasha onlaynka ah u iibin karaan ama u qori karaan dawadan, kadib markii ay soo kordheen walaacyo ku saabsan isticmaal xad-dhaaf ah, badbaado la'aan, iyo yaraan sahayda.\nSidoo kale, Brazil waxay sanadkan adkaysay sharciyada ku saabsan qorista dawadan, sabab la mid ah — isticmaal ka khaldan iyo khatarta caafimaad.", "date": "2025-10-29", "scraped_at": "2025-11-02T07:44:06.949982+00:00", "category": "news", "text_hash": "444eea41139057249738ac7de6d107ca8fda0c5b21133d262ec703867c82b4a9", "minhash_signature": "4549581,2691237,1168014,852865,497887,25226934,2973070,22635979,11577999,3690643,13290078,4526452,2166520,4397917,2572543,2575618,2149397,6713994,3311673,8205288,3805133,2729322,4174896,4315522,4941753,3666663,3076135,3585626,1065311,5201558,6335813,516936,2200503,7362926,4929674,2420134,80190,4795270,5343012,2154824,1972405,4474441,26317604,667294,21645514,6425281,10877494,99365,317203,13742953,681232,27385197,23886522,11287008,8076897,5106231,9838873,82578,13147809,879649,9073236,4643916,2153659,2796746,4676528,3477242,3219055,5741293,17094350,11616917,24335185,3751383,11548398,11793194,147371,9314462,2994126,6181544,3300179,307248,549704,158492,290777,4492904,2500972,6256652,15202881,7236890,1871370,1657155,11884196,2561404,4693200,14830424,11605355,2415767,6842007,3432172,1492760,3512185,5621410,1634008,272755,2983716,6357644,8945367,9901326,16586490,3262361,3594424,2321967,2690704,10413346,13149122,2915558,6654069,2403499,4026341,9488947,8597167,821562,12565131,13335781,7133946,3182152,1705602,822853,7455325"}
{"url": "https://www.bbc.com/somali/articles/cr43zq6kp5yo", "title": "Jacayl ka bilowday xabsi: Sida nin Muslim ah oo reer Afgaanistaan ah  u guursaday haweeney Yuhuudi ah", "text": "Xigashada Sawirka, Sammi Cannold\nMarkii Kabul ay gacanta u gashay Taliban bishii Agoosto 2021, adduunku wuxuu arkay sawirro muujinaya jahawareerka ay dadka Afgaanistaan ku jireen iyagoo ku soo daadanaya garoonka diyaaradaha,  si degdeg ahna u isku dayaya inay baxsadaan.\nWashington D.C., caasimadda Maraykanka, nin hore uga tirsanaa ciidamada badda oo lagu magacaabo Safi Rauf ayaa bilaabay hawl uu isagu gaar u qaaday: inuu caawiyo asxaabtiisii iyo dadka uu la shaqayn jiray ee ku xanniban Afgaanistaan.\nMarnaba ma uusan filayn in intii uu ku jiray hawshaas badbaadinta nolosha uu la kulmi doono jacaylkiisa noloshiisa, isla markaana isagoo Muslim ah uu jeclaan doono haweeney Yuhuudi ah oo diinteeda iyo nolosheedu si weyn uga duwanyihiin tiisa.\n\"Waan yara ka labalabeeyay ka hor inta aan caawin qofkii ugu horreeyay,\" ayuu xasuustaa. \"Laakiin taas ayaa wax walba i beddeshay. Markaas ka dib waxaan caawiyay qof kale, dabadeedna qof kale.\nSi lama filaan ah ayay arrintu isugu beddeshay hawl ballaadhan annagoo caawinayna boqolaal qof oo ku sugan Afgaanistaan iyo tiro badan oo annaga naga mid ah oo Washington joogtaa.\"\nXigashada Sawirka, Sammi Cannold\nSafi, oo ku dhashay xero qaxooti ah una soo haajiray Maraykanka isagoo dhalinyaro ah, ayaa isku arkay dhexda hawl samatabbixin ah oo aad u adag.\nEnd of Ugu akhris badan\nXaaladdaas adag gudaheeda ayuu la kulmay Sammi Cannold  oo ah agaasime masraxeed ka shaqeysa magaalada New York, taasoo si degdeg ah u isku dayaysay in la soo saaro saaxiib qoyskeeda ah oo ku xanniban Kabul.\nXigashada Sawirka, Sammi Cannold\n\"Aniga gebi ahaanba ma aqoon cidna,\" ayay tidhi Sammi. \"Markaas ayaan daawaday barnaamij gaar ah oo telefishin ah oo ka warramaya Safi iyo kooxdiisa. Waxaan u diray farriin qoraal ah anigoo waydiinaya inuu i caawin karo. Wuxuuna iigu jawaabay in waxa ugu habboon ay tahay inaan tago Washington oo aan ku biiro kooxdiisa is xilqaamayaasha ah.\"\nMarkaas ayay buuxsatay boorsooyinkeeda, raacday tareen una safartay magaalada Washington D.C., iyadoo si toos ah u gashay xarunta hawlgalka oo ay ka buuxeen rag badankood ahaa askar hore. \"Anigu waxaan ku noolaa jahawareerka masraxa,\" ayay tiri iyadoo qosleysa. \"Tani waxay ahayd isbeddel weyn oo lama filaan ah.\"\nSammi waxba kama aysan aqoon Afgaanistaan, balse waxay lahayd xirfado mid degdeg ah ka dhigtay qof aan laga maarmi karin.\n\"Waxaan horay ugu baranay shaqooyin la xidhiidha waraaqaha xogta kombiyuutarka iyo isgaadhsiinta,\" ayay tidhi. \"Markaas ayaan noqday sarkaalka isgaadhsiinta ah.\"\nXigashada Sawirka, Safi Rauf\nInkasta oo ay jireen xaalad degdeg ah iyo jahawareer ka jiray xarunta hawlgalka, haddana arrin kale ayaa si tartiib ah u socotay.\n\"Ma jirtay shucuur? Waxaan u maleynayaa in jawaabtu tahay haa,\" ayay tidhi Sammi. Waxay xasuusatay inay fiirisay da'da Safi bog internet ah si ay u ogaato haddii \"uu ku habboon yahay in dookheeda uu yahay.\"\n\"Magaca Safi iyo da'diisa ayaan ka raadiyay Google, sababtoo ah shaqadu way daalisay xilligaas, wuxuuna u ekaa da' weyn marka la barbar dhigo sida uu hadda u egyahay,\" ayay raacisay.\nSocodkoodii dheer ee ugu horreeyay wuxuu dhacay abbaaro saddexdii habeenimo, iyagoo sugaya dadkii laga daadgureynayay inay ka gudbaan barta hubinta ee Taliban. Waxay ku wareegeen taallooyinka magaalada Washington ilaa ay ka gaareen Lincoln Memorial.\nXigashada Sawirka, Getty Images\n\"Waxay u muuqatay sidii filim,\" ayay tidhi Sammi. \"Markaas ayaan bilaabay inaan isweyddiiyo: ma ninkaan baa aan guursan karaa?\"\nMarkii dambe ayay mar kale kulmeen, waxayna halkaas ku wadaageen dhunkashadoodii ugu horreysay, iyagoo taagan hareeraha waddada, hadlaya oo dareemaya isku soo dhowaansho xooggan.\nXigashada Sawirka, Sammi Cannold\nSafi wuxuu yidhii, \"Sammi waxay mar walba igu oran jirtay goormaad i geyneysaa guriga waalidkaa.\"\nLaakiin Safi iyo qoyskiisu waa Muslimiin, halka Sammi ay tahay Yuhuudi. Si kastaba ha ahaatee, jacaylkoodu wuu sii xoogaystay.\nXigashada Sawirka, Andy Henderson\nSi kooban haddaan u dhigo, Safi si dhab ah ayuu jacayl ugu dhacay,\" ayay tidhi Sammi. \"Wuxuuna aad u xiiseeyaa muusigga gaar ahaan qaabka heesaha Les Misérables, oo ah meel aan aniguna aad ugu xeeldheerahay.\"\nXigashada Sawirka, Sammi Cannold\nBishii Diseembar 2021, Safi wuxuu u safray Kabul si uu uga qaybqaato howlaha gargaarka bini'aadantinimo isaga iyo walaalkiis. Inkasta oo loo digay inuusan tagin, Safi wuu ku adkeystay, isagoo sheegay in Amnesty International ay u ballanqaadday inay ka difaaceyso waxyeellada Taliban.\nLaakiin maalintii ay ahayd inay dhammaystiraan hawshaas, Taliban ayaa qabatay Safi, walaalkiis, iyo shan ajnabi oo kale.\n\"Markii hore way na kala saareen, anigana meel gaar ah ayay i geeyeen qol yar oo aan ka badnayn lix lix feet dherer iyo ballacba. Ma jirin daaqad, mana jirin sariir,\" ayuu yiri.\nXigashada Sawirka, Sammi Cannold\nDhanka kale, Sammi waxay ku sugnayd New York iyadoo walaac iyo cabsi ku jirta, mar kasta oo ay fiiriso khariidadda Google si ay u ogaato meesha uu joogo. Markasta oo ay eegto, waxay arki jirtay inuu ku sugan yahay xarunta dhexe ee sirdoonka Taliban.\n\"Si fiican uma aqaan magaalada Kabul, balse waan ogaa inuu ku jiro xaalad aad u xun,\" ayay tidhi.\nKa dib dhowr toddobaad, Safi wuxuu ku guuleystay inuu saaxiibo la noqdo mid ka mid ah waardiyayaasha, isagoo si qarsoodi ah u siin jiray lacag si uu u helo fursado kooban oo uu taleefan ugu waco Sammi.\nXigashada Sawirka, Safi Rauf\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, James Gourley / Getty Images\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, Safi Rauf\nXigashada Sawirka, Sammi Cannold\nXigashada Sawirka, Sammi Cannold\nWadahadallada lala galay Taliban waxay qaadatay waqti, laakiin maalintii 70-aad way ogolaadeen inay sii daayaan Safi. Sammi waxay sheegtay in mar ay Taliban ku hanjabeen inay dilaan Safi haddii Mareykanku uusan samayn wixii ay rabaan.\n\"Markaas dambe ayaa naloo sheegay inaan aniga iyo waalidka Safi u safri doonno Qatar maadaama halkaas ay ka socdeen wadaxaajoodyadu.\" Sammi ayaa siisay safar Qatar waxayna halkaas kula kulantay waalidka Safi markii ugu horreysay.\nXigashada Sawirka, Sammi Cannold\nWaxay noloshooda ku sii waddeen Maraykanka, waxay wada degnaayeen guriga isla markaana dabadeedna is guursaday, iyadoo xafladda guurkuna ay isku darsatay dhaqamada Afghanistan iyo Yuhuudda. Martidii xafladda ka soo qayb gashay waxaa ka mid ahaa Afgaan iyo Yuhuudi iyo sidoo kale qaraabo iyo asxaab.\nXigashada Sawirka, Sammi Cannold", "date": "2025-10-25", "scraped_at": "2025-11-02T07:45:06.974820+00:00", "category": "news", "text_hash": "da70f95f69e6a8ea97919dfa3f1e9f63243f6e503e4f14c732b80ca2450921ef", "minhash_signature": "638255,4101254,6920833,4369161,16283563,247256,3738324,7699687,9183325,5452882,671617,2199975,4514682,1630519,3882951,3265610,293816,4944333,3779146,12318857,241448,1860416,1889509,4436629,4222622,4198466,4860242,8939627,8979708,2222076,1459866,613726,685149,5433044,732938,3108809,1426073,1220546,2772879,536019,2498503,5673898,495068,1453437,352200,3657723,1942562,1790540,6949463,2723702,8371475,3212322,165134,1566301,5888680,3755336,3378639,6711568,3551765,4832158,14907115,523835,23246171,4481602,7475968,10924757,5507912,919376,25091574,28391159,1979039,4859227,798224,8832151,2148399,1155802,5293469,365441,985293,790787,3769,1418664,5884571,2900986,1654717,1289640,58909,1312149,8997239,5880364,8574602,1633072,2177913,1441607,2679830,1307694,527261,4715428,520680,1452042,10885500,8400362,36393,3061024,8412982,26946277,2997385,4392986,3135102,524974,2873140,10568024,3021211,9466704,759821,450510,5646661,3111015,117725,717998,7359590,607030,3626894,9566767,6768113,433084,1539892,2934252"}
{"url": "https://www.bbc.com/somali/articles/crg1w3dzknro", "title": "Daawo: \"Waan diidnay in nala xidid siibo\" dareenka dadka Gaza ee guryahooda la duqeeyay", "text": "Muuqaalkan ayaa muujinaya nin Falastiini ah oo lagu magacaabo Saabir Abu Hilaal, oo eegaya waxyeellada gaartay gurigiisa oo ku burburay duqeymaha Israa'iil.", "date": "2023-10-09", "scraped_at": "2025-11-02T07:46:06.665341+00:00", "category": "news", "text_hash": "19634dde9f8c8c0dcd75af357212ba0e0a670f6f6d26c38a1b885dcbb7ddd131", "minhash_signature": "612740835,64698440,322427817,506838486,147588410,40679848,147100551,74359266,12870270,129372044,153626744,522812180,17829574,6294863,464059697,183225345,33900949,130840146,446096293,279620754,201996303,80072681,36082365,201837388,364191547,118692614,36468807,36483408,293057642,150014831,42759541,338724165,22493218,95622188,105995271,96017409,311382973,13434064,41794845,205719275,61727961,297029420,233753211,2488890,64950464,295315714,247828287,71547785,441356509,23148740,429917974,31298490,39003542,41538715,225952895,81801902,302744937,393646028,109537630,115513944,256556214,373768647,35858900,1405677512,34000858,249733084,348296424,113902403,155059296,485887107,189299506,101931107,417932134,247520100,3413534,111765876,686158486,36532781,197321450,57659561,6847792,25737362,371849084,110647804,266668000,73162824,92476606,612041895,208588542,124605846,533121276,6366165,22856856,791542874,374687368,705651395,206071675,273024095,530196649,107378003,250201158,105719573,139021799,192708029,207971118,146225658,193125900,129411720,50395883,6801447,523770038,907512775,89750946,116411185,489627197,40556444,14491233,86118176,218518241,753537710,58021670,2870158,251799888,19667945,6783615,84194826,394611079,527991590"}
{"url": "https://www.bbc.com/somali/articles/c4n4z1en37lo", "title": "Sida wiilkan Soomaaliyeed u hirgeliyay adeeg mobile oo Af Soomaali iyo afaf kale lagu barto", "text": "Cabdinur Cali Mahdi, oo bartay cilmiga tiknolojiyadda ayaa hindisay application, barnaamij ku shaqeeya mobileka oo ardayda ka caawinaya inay afkooda hooyo ku bartaan manhajyada iskuulada lagu barto.\nCabdinur oo BBC uga warramay sababta ku dhalisay inuu hal abuuro barnaamijkan ay ka faa’iidaysteen kummanaan arday ah ayaa sheegay in markii uu arkay baahida ay bulshadiisa u qabaan inay helaan aasaasiga waxbarashada uu ka soo tagay shaqadiisii ka dibna uu hirgeliyay app-kan.", "date": "2023-11-20", "scraped_at": "2025-11-02T07:47:06.640041+00:00", "category": "news", "text_hash": "e3e779393a6fa443ba2b9e63cbc48e8eeaafafa46b8e8b10608a2b8e3799d53b", "minhash_signature": "44802371,10442031,84638691,12870110,47618212,19685042,49077318,72821774,29287968,29038076,362611,9268163,48617540,5844565,41308418,63004206,77015384,8083444,174317786,18948706,111347820,12684241,28496338,205550218,28686496,47970718,9974463,21585024,17565717,40221302,16134360,26902510,910670,15637230,66504306,191861020,16043129,10742771,15959691,54517727,54923457,28019191,3320273,38531845,49551721,69556207,238835930,62999623,12854845,50582545,168901845,140841748,91636903,53729907,40147991,14821368,17809354,77262268,2261728,87669004,17362721,276310273,35064711,41363076,6445699,65231984,7787508,116799503,69835081,123284307,93934256,45845190,55203467,27963040,172447877,217358615,2994126,137003293,3335522,24426697,100841584,131821811,21510286,3482927,10732427,107121119,141378492,65369972,3521974,2739568,54441748,24493543,127131359,337123,11596219,32309018,25675067,6582396,47119240,19145161,15330142,8917590,84125513,95102444,93517110,27559631,56100955,24450349,29465768,14916027,48811057,115214218,93996669,24120105,71823016,175048454,27404203,22421335,75656412,12053164,48661372,27679935,17754402,17471741,26100304,19550548,22649155,211204918"}
{"url": "https://www.bbc.com/somali/articles/c5y775e4w3ro", "title": "Ma waxaa la gaaray wakhtigii uu Messi ka fadhiisan lahaa cayaaraha", "text": "Xigashada Sawirka, Getty Images\nLaacibka xulka qaranka Argentina ee Lionel Messi ayaa lagu wadaa in uu ka dhaqaaqo kooxda Reer Maraykan ee Inter Miami oo martigelisay guul darro ka soo gaadhay PSG. Messi ayaa soo bandhigay mid ka mid ah xirfadihiisii layaabka lahaa.\n38 jirkan ayaa lagu wadaa in aanu si dhib yar ciyaaraha uga fadhiisan iyada oo laga yaabo in uu u dheelo qarankiisa Koobka Adduunka ee sannadka 2026-ka.\n\"PSG waxa ay ku jirtaa qaab ciyaareed heer sare ah. Dad badan ayaa tigidhada u goosta si ay u daawadaan Messi oo markan da'da 40-ka u sii siqaya,\" ayuu yidhi madaxa Inter Miami Javier Mascherano, kaddib ciyaar ay daawadeen 65,574 oo taageerayaal ah.\nDaafaca kooxda PSG ee Lucas Beraldo ayaa isna sifeeyay oo yidhi \"Leo waa shaqsiyad gaar ah, in aan la ciyaaryo isaga waxa ay ahayd mid cajiib ah, waxa aan ahaa ilmo yar oo ku barbaaray daawashada xirfadiisa mucjisada ah.\"\nXigashada Sawirka, Getty Images\nLaacibka ay isku dal ka soo wada jeedaan ee Nicolas Otamendi iyo saaxiibkiisa wakhtiga dheer ee Luis Suarez ayaa labaduba filaya in mustaqbalka ciyaareed ee ciyaaryahankan aanay weli fari ka qodnayn.\nGuillem Balague oo buug ka qoray ninkan siddeedda jeer ku guuleystay Ballon d'Or ayaa  yidhi \"qofna ma garanayo mana saadaalin karo Messi.\"\nEnd of Ugu akhris badan\nAragtidaas mid la mid ah waxa qaba suxufi reer Spain oo maqaal ku daabacay BBC-da ka hor kulankan, waxaanu sheegay in qoyska Messi ay degeen Miami, taasa loo fasiran karo mid suurtagal ka dhigi karta wadahadallo uu ku sii joogi karo kooxdaasi.\nMessi ayaa xaqiijiyay riyadiisii ugu weynayd oo ahayd in uu ku  guulaystay hanashada koobkii adduunka ee lagu qabtay Qatar 2022-kii – isaga oo meesha ka saaray dooddii ugu weynayd ee ahayd in loo aqoonsan karo xiddigii ugu fiicnaa abid. Ma jiro qof weligii ku guuleystay laba koob adduun isagoo kabtan ah.\nIntii ay ciyaartu socotay waxaa jirtay hal mar oo uu Messi dul istaagay laad xor ah oo ay ka harsaneyd shan daqiiqo markii uu dareemay qof walba in uu doonayo in uu gool dhaliyo – laakiin darbiga ayuu ku dhuftay.\n\"Aad buu u xirfad sarreeyaa. Maanta oo dhan garoonka ayuu ku dhex wareegayaa laakiin marka ay kubaddu cagihiisa taabato ayuu la dhaqaaqayaa,\" ayaa uu yidhi difaacii hore ee kooxda Chelsea, John Mikel Obi oo ciyaartan daawnayay.\nKubadda cagta ma ilaawi doonto Messi, kaasi oo ah gooldhaliyaha ugu sarreeya taariikhda Barcelona (672), Argentina (112) iyo Inter Miami (50).\nHa se ahaatee, waxa hubaal ah in xilligan ay da'du tahay arrin muhiim isaga oo jira 38 sano.\nWaxa cajiib ah in waayihiisa ciyaareed ee 1,109 kun oo uu saftay, haddaba markii kowaad ayaa uu ka hor yimid koox uu hore ugu dheeli jiray.\nPSG oo ahayd kooxdii uu lku soo qaatay waayihiisa ciyaareed mid ah mid ah ayaa ku jirtay xilli wanaagsan tan iyo markii uu ka tagay oo xilligaas u dhaliyay 32 gool kaddib 75 kulan oo ciyaaray. Laakiin waxa  uu ku guuldarraystay in uu ka caawiyo ku guuleysiga Champions League.\nUgu dambayntii waxa ay ku guulaysteen xilli ciyaareedkan iyaga oo ay ka maqan yihiin xiddigo magacyo weyn oo ay ka mid yihiin Messi, Neymar iyo Kylian Mbappe oo dhammaantood isaga dhaqaaqay garoonka The Parc des Princes.\nMessi ayaa muujiyay in uu weli yahay laacib ku jira qaab-ciyaareed wanaagsan tartammada Maraykanka kaddib markii uu laadka xorta ka dhaliyay Porto wareegga group-yada.\nQaybtii dambe waxa ay PSG u ahayd xilli nasiino ah maaddaama ay afar jeer oo hore soo taabatay shabaqa. Taasi waxay fursad siisay Messi iyo kooxdiisa Inter Miami kubbadu ay cagtooda ku jirtay in muddo ah.\nLaacibka Reer Argentina ayaa isku in uu dhaafo daafacyada kooxda ka soo hor jeedda isaga oo hdex maray dfaacyo dhowr ah ugana sii guday diillinta ganaaxa markaas oo darbeeyay kubbad cajiib ah oo dadka qaarkiis ay ku xasuusteen goolkii finalka Champions League ee 2009-kii ay Barcelona ka dhalisay Manchester United.\n\"Waxaan u maleynayaa in Leo uu ciyaaray kulan aad u fiican, oo ka mid ah kuwa ugu muhiimsan,\" ayuu yidhi saaxiibkiisii hore ee Barcelona - Mascherano.\n\"Qaybtii labaad, waxay u muuqatay in uu yaraaday cadaadiskii ba'naa ee ay Paris saaraysay, waxaanu helay fursado badan. \"\nWaxay u muuqataa in tani ay noqon doonto kulankiisii ugu dambeeyay ee taageerayaashiisu ka daawadaan adduunka oo dhan kulan ka tirsan Koobkan Marmite Fifa Club World Cup.\nHaddii uu sii joogo Inter Miami waxay u badan tahay in sida caadiga ah u uku ekaado heerka naadiyada ee ciyaaraha Waqooyiga Ameerika.\nTartankaan dib looma ciyaari doono ilaa 2029, markaasi oo Messi uu noqon doono 42 jir.", "date": "2025-06-30", "scraped_at": "2025-11-02T07:48:06.776887+00:00", "category": "news", "text_hash": "e22f3d2797086563c6caaec3875be76f3fedfd1a510b6f3e08ced9d0708eba3a", "minhash_signature": "7982666,4700065,339074,427266,1361662,10792274,671580,5119088,488951,3354394,13343186,2235388,7909606,3838571,4386613,5055185,2475100,9718885,4051674,6062655,2264063,3631139,6081755,4436629,5039913,3523352,22923886,5647429,9056597,11909123,13267906,7104576,1305397,4602959,18449453,28291988,8995910,102188,4859226,3735304,2487779,5755284,5491370,16101025,6895485,15836743,2159720,645786,4144843,3626139,6925239,4850029,6380459,3764632,5888680,2300972,80188,6220684,388431,867594,5566038,6706229,5124728,1513497,982073,3043006,10349870,4019771,650900,842561,287476,6115274,4085281,3953222,16154903,9818462,758267,20837812,8782033,1738412,6690271,7634884,3809580,1520859,430282,9549131,8645801,3296643,3314732,7186800,945734,9100168,2167070,3453077,4445063,1879178,208728,3840627,1492760,6163673,1336721,2906137,578875,13050260,2531922,23606970,2040244,9929389,453063,11181205,10053043,1970024,4621599,1469624,3949504,1171449,12562687,6058974,3158412,1290930,1078211,3460951,1984815,9443010,15082456,9795074,658294,11498927"}
{"url": "https://www.bbc.com/somali/articles/c93xxy53rkeo", "title": "Maxay yihiin caanaha liska ah ee uu dhamay Haaland ee hadalhaynta badan dhaliyay?", "text": "Xigashada Sawirka, @Erling YouTube\nMuuqaalkii ugu horreeyay ee la soo galiyay kanaalka cusub ee Erling Haaland ee YouTube wuxuu soo jiitay in ka badan shan milyan oo daawade - wuxuuna dhaliyay dood ku saabsan cunista caanaha ceyriinka.\nMuuqaal cinwaankiisu yahay 'Maalinta ka mid ah nolosha ciyaartoy  kubbadda cagta oo weyn', weeraryahanka Manchester City iyo Norway Haaland, oo 25 jir ah, wuxuu ka hadlayaa hawl maalmeedkiisa iyo ku raaxaysigiisa cunto karinta - iyo cunista - hilibka jiirta ah ee lafta dheer dhexda ku leh.\nLaakiin waxa uu sidoo kale ka hadlayaa sida uu u jecelyahay cabitaanka caanaha aan la karkarin ama la marsiinin nidaamka looga dilo bakteeriyada, kuwaas oo aan laga iibsan karin dukaamada- inkastoo iibkoodu uu sharci yahay gudaha England.\nHay'adda Heerarka Cunnada (FSA) ayaa ku talisay \"waxaa ku jiri kara bakteeriyada waxyeellada leh ee keeni karta inaad ku sumowdo\" sidaas darteed waa inaysan cunin dadka hab-dhiskooda difaaca uu daciifka yahay, oo ay ku jiraan kuwa da'doodu tahay 65 jir iyo  ka weyn, haweenka uurka leh iyo carruurta yaryar.\nLaakiin waa maxay sababta Haaland u cabto iyo maxayse tahay saamaynta ballaaran ee ka dhalan karta?\nMuuqaalka YouTube, Haaland waxaa laga duubay isagoo booqanaya beer ku taal Cheshire oo ku taalla Ingiriiska si uu u soo iibsado caano ciiriin ah.\nEnd of Ugu akhris badan\nWuxuu ku tilmaamay \"Cunto sare\" oo uu aaminsan yahay inay u roon tahay caloosha, waxay u roon tahay maqaarka, lafaha iyo murqaha, isagoo raaciyay: \"Waa sababta aan u cabbo.\"\nIlo ku dhow weeraryahanka ayaa BBC Sport u sheegay inuu cabo hal galaas subax kasta iyo mid kale oo uu cabo xilliga  tababarka ka dib – waa caado ka mid ah noloshiisa inta uu xasuusan karo.\nSi fudud hadaan u dhigno, Haaland wuxuu dareensan yahay inay ka dhigayso mid caafimaad qaba, taas oo maskax ahaan muhiim u ah ciyaartoyga heerka ugu sarreeya ee xirfaddooda. Dhab ahaantii, doorasho shaqsiyeed ayuu u cabaa caanaha ee ma ahan mid ka saacidda nafaqada loo baahan yahay xilliga tababarka.\nWaxaa la fahamsan yahay in qaar ka mid ah saaxiibada Haaland ee City ay sidoo kale cabbeen caano ceyriin ka hor imaatinkiisa, in kasta oo aan la garanayn inta ay le'eg tahay - ama inta ay cabaan.\nInta badan caanaha laga isticmaalo gudaha Ingiriiska ayaa ah kuwa la kululeeyay - si loo dilo bakteeriyada waxyeelada leh ee ku jirta. Caanaha liska ah looma soo saaro in isla markiiba la cabo gudaha Ingiriiska.\n\"Caanaha liska ah waxaa laga yaabaa inay ku jiraan bakteeriyada sabata in cuntada lagu sumoobo, sidaas darteed waxaa jira baaritaanno dheeraad ah oo lagu sameeyo iyo heerarka nadaafadda ee soo saarayaasha caanaha la cabbo oo iyana la eego,\" ayay tiri agaasime ku xigeenka hay'adda tayada cuntada, Natasha Smith.\n\"In kasta oo kantarooladan adag ay ujeedadoodu tahay inay caawiyaan hubinta in caanuhu aysan dhib gaarsiin qofka cabaya, isla markaana aan taageersanahay dookha qofka, hadana waxaan kula talineynaa dadka jnugul inay ka fogaadaan.\"\nXigashada Sawirka, Getty Images\nIibinta caanaha lo'da ee ceyriinka ah waa sharci gudaha England, Wales iyo Waqooyiga Ireland - laakiin waxaa si toos ah  macaamiish auga iibin kara beeraha wax soo saarka caanaha liska ahee diiwaangashan, suuqyada beeralayda ee diiwaangashan, iyo qaybiyeyaasha wata gawaarida caanaha. Laakiin intaas oodhan oo wa ka mamnuuc Scotland.\nCaanaha ceeriin waa in ay ka yimaadaan xoolaha ka fayow cudurrada sida qaaxada, beeraleyda u hoggaansata xeerarka nadaafadda iyana waa in si joogto ah loo baaro sannadkii laba jeer, waana in lagu calaamadiyaa digniinta caafimaad ee habboon.\nIlaha hay'adda tayada cuntada ayaa sheegaya in ay si joogto ah dib u eegis ugu sameeyaan xakamaynta caanaha la cabbo oo ay hiigsanayaan in ay taageeraan doorashada macaamilka, kuwaas oo ay barbar socdaan ilaalinta caafimaadka dadweynaha.", "date": "2025-11-01", "scraped_at": "2025-11-02T07:49:06.847244+00:00", "category": "news", "text_hash": "a2649075c79dbe39c0be045d810936e77dc9655a8bfec171ebdf9dfe0610e390", "minhash_signature": "2255140,9463274,5726753,12598534,1207260,5503724,18933630,2059869,752975,8976648,527540,496030,146371,11097153,14790958,5933198,1493675,8409106,9026077,7626286,8788836,8215254,3474756,2809207,322252,20070666,10289668,3563632,5703410,6745474,19826565,2480998,13054494,1998997,1882829,4657122,2102907,287519,580891,4370526,7895717,12322627,5652894,5536155,9907805,2309451,2314445,3552068,10812453,3983713,11318192,1226702,2695936,13816395,13162703,2190346,2442128,34665224,13418557,23596348,16972,6939630,24926,10477948,4748202,3588736,16320257,12247499,1227485,5340335,353496,4571267,8342335,393897,9045360,21064978,345110,1751761,8320328,125568,11169939,17603204,6311005,8040475,16255743,13313950,7184375,3008851,5509344,869246,11991749,9406805,8496009,1933446,4403311,15260,2084026,11300374,1227304,13367017,3355448,10937896,1559628,906526,1073119,1679611,18047992,4868123,2809101,6670278,777263,15337624,31049,11402668,3293050,3155184,3194247,7129116,5417232,6498476,37004134,17628968,21301022,15527420,7454318,2041327,9867102,4711713"}
{"url": "https://www.bbc.com/somali/articles/c78x70v2mr2o", "title": "Boqorad ku guuldarreysatay inay ninkeeda ka hor istaagto inuu la guursado", "text": "Xigashada Sawirka, AFP\nMarwada 1-aad ee boqorka qowmiyadda Zuluga Koonfur Afrika Misuzulu kaZwelithini ayaa ku guuldarreysatay in ay saygeeda ka hor istaagto qorshe uu markii 3-aad ku guursan lahaa.\nBoqorad Ntokozo kaMayisela, ayaa maxkamad ka dacwootay si ay ninkeeda uga joojiso aroos u ugali lahaa todobaadkan dabayaaqadiisa, laakiin maxkamadda ayaa ku gacansayrtay doodeeda, ka dib markii ay qiil ku filan weydey.\nBoqorka ayaa xaaskiisa ku guursadey sharci madani ah ka hor intii aan la caleemo-saarin 2021, waana sababta ay maxkamadda u aaddey, iyada oo ku doodeysa in maadaama guurkoodu ka horreeyey xilka boqortinimada uusan naag kale la guursan karin.\nXaakimka maxkamadda  oo lagu magacaabo Bongani Mngadi ayaa go'aankii uu ku diiddey joojinta guurka cusub ee boqorka wuxuu ku sheegyay in maadama boqoraddu horay u ogolaatay in lala guursado aysan u furneyn dood kale.\nSida laga sheegay maxkamadda horteeda, lammaaneyaasha ayaa sannadkii la soo dhaafay ku heshiiyey in ay guurkooda u beddelaan mid dhaqan, si ay boqorka ugu suurowdo in uu labeysto. Laakiin heshiiskaas ayaa sida la sheegay burey markii boqorku furriin dalbaday, isagoo ku andacoonayo in xiriirkoodu gaarey meel aan laga soo celin karin.\nBoqor Misuzulu, ayaa ku adkeysanaya in uu gar iyo gardarraba guursan doono gabadha uu calmaday oo lagu magacaabo Nomzamo Myeni, taas oo uu sheegay in aad u jecel yahay.\nEnd of Ugu akhris badan\nWaxaa xusid mudan in guurka xaasaska badan uusan Koonfur Afrika dambi ka aha haddii xeerka dhaqanka loo cuskado, sidaas oo ay tahay sharcigu wuxuu dhigayaa in marka ninku rabo in uu gododleeyo looga baahan yahay in uu guurkii madaniga ahaa buriyo ama uu u rogo guur dhaqameed.\nIllaa hadda ma cadda in aroosku u dhici doono sidii qorshuhu ahaa, waxaase soo baxaya warar lagu faafiyey warbaahinta Koonfur Afrika oo tibaaxaya in xafladdii arooska dib u dhac ku yimid sababo aan la shaacin awgood.\nBoqorka Zulugu ma leh awood siyaasadeed oo rasmi ah, doorka boqortooyaduna wuxuu ku kooban yahay magac-u-yaal, laakiin sidaas oo ay tahay wuxuu saameyn xooggan ku leeyahay bulshada dhexdeeda, isagoo sannad walba qaata miisaaniyad ku kacaysa malaayiin doollar.\nDuubka boqornimo ee Misuzulu ayaa indhawaalaba waxaa hareeyey eedo la xiriira kartidiisa hoggaamineed, ku waas oo uga imaanaya bulshada iyo dowladdaba. Waxaana tan iyo markii uu xilka qabtay Oktoobar 2022 uu qaaday tillaabooyin qar-iska-tuur ah oo keenay in mararka qaar muran la geliyo boqrnimadiisa\nMurankan ugu dambeeyey ayaa ku soo beegmay xilli ay taagnaayeen fadeexado hareeyey boqorka tan iyo markii uu xilka qabtay labo sano ka hor.\nDhawaan ayey ahayd markii uu xilka ka eryey labo kaaliye oo aad ugu dhawaa, ku waas oo u uku jirey Ra'isul Wasaarihiisi, taas oo dhiillo ka dhex oogtey golihiisa. Sababtoo ah wallow uu yahay boqorka beesha, haddana ma leh awood u uku qoro ama ku eryo xubnaha guddiga sare ee boqortooyada oo ku yimaada cod loo dhan yahay.\nBoqorka oo lagu xanto in yahay nin damac badan ayaa jagada kula wareegey si lamafilaan ah, ka dib markii aabihiis Goodwill Zwelithini uu kedis ah ugu geeriyoodey cudurka  Covid bishii Maarso 2021. Boqor Goodwill ayaa ahaa boqorkii ugu cimriga dheeraa qowmiyadda Zulu, wuxuuna korsiga boqortooyada ku fadhiyey muddo 50 sano ah, taasina waxay dhabbaha u xaartey in uu talada la wareego wiil aan taajka loo carbin.", "date": "2025-01-20", "scraped_at": "2025-11-02T07:50:07.345360+00:00", "category": "news", "text_hash": "8309e0cce18ef27b525d266298c175f6da2347fbd6280a4582f1eb7b080208f4", "minhash_signature": "9712849,1851573,2244376,6403973,18453596,4543937,17499904,27898333,2321661,1241414,10030500,7274940,662089,52707093,7565538,5994278,3259352,2928601,2889056,7262850,9289744,13686258,3261968,9693497,35271690,2365697,7201983,4575584,486206,28042817,13402631,182169,20526497,9743202,1245786,10575956,12676785,5628937,12241074,63335143,6565032,21408913,9182207,19256004,5825693,2370038,23631214,15952745,1397164,9152701,429459,1062168,3414387,16978541,13203740,12480870,2529702,1118631,24271757,1094586,3221940,31958107,12974552,1135814,13027010,911600,1905146,6071316,6966622,1171737,1092801,5032849,13065275,1424430,837027,1202725,10002201,9280134,185681,17650085,6847792,12154439,2844315,23048709,1534408,1259915,16210605,1540038,1889362,4184799,754846,13610508,11795642,13571642,1513604,12744256,4784700,28508988,2430326,230613,12250000,8053632,2975258,828640,7002799,15251836,1974722,9586432,4647304,20697631,6774578,3593991,7767305,197838,17195989,7493107,11293778,6399721,11919352,12244657,953807,2870158,6189717,8906015,18427622,14884338,398258,8766148"}
{"url": "https://www.bbc.com/somali/articles/cj5vp86d86vo", "title": "Daawo masjidka ay Israa'iil duqeeyeen", "text": "Diyaaradaha Israa’iil ayaa aroortii hore ee saakay weeraray xarun uu ku yaallo masjid, meel ka tirsan Daanta Galbeed ee la heysto, xaruntan ayay milatarigu sheegeen inay Xamaas u adeegsan jirtay abaabulka weerarrada, kooxaha caafimaadka falastiiniyiinta ayaa iyaguna sheegay in ugu yaraan hal qof u uku dhintay halkaas. Lifaaqa kore ka daawo warbixinta masjidka oo dhammeystiran:", "date": "2023-10-22", "scraped_at": "2025-11-02T07:51:07.130994+00:00", "category": "news", "text_hash": "be73aad31cca6c4b2a981da9ce3c88f6887d78d1e50e6182740730e372e900b2", "minhash_signature": "67219618,20681670,29474187,25285177,144442841,252699822,34880357,18773587,3251485,149870602,165810188,55597766,211105698,43723186,30697487,151594419,45150647,33986782,16381479,23888516,67709152,37382227,72694424,63306323,126498667,77606354,31314992,10385167,127314944,2794013,156455501,33875150,44436574,89523891,11824772,66905669,41224220,181803222,219036527,2178181,57480579,16760276,61923614,83865450,119093228,18126638,1702794,526100,67379322,115743452,37435827,52924669,88092622,17925844,73623747,342779759,12748160,7354672,14724332,3886401,90310215,93757261,146945519,82933775,149753550,44864914,66909389,49693269,141117422,10406959,34091710,241582184,1685708,15220800,210121875,165233781,52640468,18823006,50182980,121113559,243261199,383009120,35224636,27860582,1394944,63708348,38058935,21908876,118947794,86099286,57011163,58111222,82046776,38264568,99579840,122754640,46223193,58743183,68053796,193627114,16673743,20802434,13187777,398230585,1158334,32661724,43489176,35384780,27637079,125538355,20237618,104303201,84912563,137854388,54193112,74735977,48403613,158676254,144695485,30217389,166307396,62977584,110262871,25082359,13034113,97086653,21630628,69025148"}
{"url": "https://www.bbc.com/somali/articles/c4gxdkp0wrro", "title": "Muhiimadda ay leedahay shahaadada ay UNESCO guddoonsiisay Ugaaska beesha Ciise", "text": "Xigashada Sawirka, DIRE TV\nMunaasabad lagu qabtay magaalada Dirir-dhaba ee dalka Itooboiya  ayaa maanta shadaado lagu gudoonsiinayay ugaaska beesha Ciise, kadib markii dhawaan hay'adda Qaramada Midoobay u qaabilsan dhaqanka ee UNESCO ay si rasmi ah u aqoonsatay Xeer beesha Ciise, oo ah xeer qarniyo jiray oo ay ku dhaqmaan beesha.\nAqoonsashadan taariikhiga ah ayaa lagu saleeyay sida xeerkan uu u mideeyo bulshooyinka, uu u dhowro dhaqanka, uuna dhiiro galiyo bulshada geeska Afrika.\nUgaaska beesha Ciise Ugaas Mustafe Maxamed Ibrahim Ugaas Wacays ayaa sheegay in shahaadadan ay si gaar ah beesha iyo guud ahaan umadda Soomaalida ah uga dhigan tahay wax weyn oo u soo kordhay.\n\"Wax weyn ayey uga dhigan tahay maadama xeerkooda la aqoonsaday, lix boqol oo sano ka hor xeerkii aabayaasheen noo dhigeen in maanta adduunka aqoonasdo wax weyn ayey nooga dhigan tahay\" ayuu yiri ugaaska oo intaas ku daray \"Somaali oo dhan ayey sharaf u tahay, waa xeer Soomaali leedahay oo adduunka aqoonsaday.\nXeerkan ayaa la sheegay in muhiimad gaar ah uu leeyahay marka la fiiriyo taariikhda uu soo jiray iyo sida uu ku badbaaday mudada intaas la eg iyo sidoo kale qodobada ku qoran oo nolosha dhan walba taabanaya.\n\"Waxa ugu weyn waa waqtiga la dhigay oo ah waqti fog iyo sida loo ilaaliyay shan qarni ka hor xeer la dhigay oo ilaa hadda lagu dhaqmayo oo aan isbeddelin iyo xeerka oo marka la gudagalo wax kasta oo bulshada ku saabsan taabanaya\"\nEnd of Ugu akhris badan\nQodobada xeerkan ku jira waxaa ka mid ah qodobka dhigaya martigelinta qofka ka soo jeeda beesha ee taga meel kale oo reerku deggan yahay.\n\"Qofka jooga darafka ugu shisheeya waxa uu safrayaa isagoon sahay qaadan, reerkuu doonyo ayuu u hoyan karaa, hadii  la martigelin waayo waa la xukumayaa reerkaas\".\nShaqsiga la martigelin waayo ayaa ku doodaya in reerkii aabihiis lagu qadiyay, waxay noqoneysaa qodob uu jabiyay qofka loo martiyay.\nUgaas Mustafa ayaa sidoo kale noo shegay in ilaa iyo labo sano muddo laga joogo ay guddi dhallinyaro ah oo isabaabulay ay howsha bilaabeen iyagana ay la shaqeeyeen sidasina ay ku timid aqoonsiga UNESCO.\nWaxyaabaha xeerkan uu kaga duwan xeerarka kale ee beelaha Soomaalida ayaa la sheegay in ay tahay sida loogu dhaqmo iyo ixtiraamka loo hayo oo aan isbeddelin.\nXigashada Sawirka, IBRAHIM AXMED\nXeerka Ciisaha ayaa soo jiray sida la sheegay ku dhawaad 500 ilaa iyo 600 oo sano. Xeerka waxaa sameeyay 100 oday oo la soo xulay, waxaana lagu sameeyey magaalada Mile tuulo hoostagto oo la yiraahdo Waaruf, deegaankaasi oo u dhaxeeya magaalada Diridhaba ee Itoobiya iyo Jabuuti.\nHay'adda Qaramada Midoobay u qaabilsan dhaqanka ee UNESCO ayaa si rasmi ah u aqoonsatay Xeer Ciise, oo ah xeer qarniyo jiray oo ay ku dhaqmaan beesha Ciise ee degta dalalka Jabuuti, Itoobiya iyo Soomaaliya, waxayna ku dartay liiskeeda waxyaabaha dhaqanka aadmiga la xiriira.\nAqoonsashadan taariikhiga ah ayaa lagu saleeyay sida xeerkan uu u mideeyo bulshooyinka, uu u dhowro dhaqanka uuna geeska Afrika ugu dhiirrigeliyo caddaaladda.\nIn xeerkan ay aqoonsato UNESCO ayaa waxaa si wada-jir ah u gudbiyay dad kasoo kala jeeda Itoobiya, Jabuuti iyo Soomaaliya, waxaa lagu ansixiyay fadhigii 19aad ee guddi-goboleedka hay'adda kaasoo lagu qabtay magaalada Asunción, ee dalka Paraguay.\nWaxyaabaha kale ee xeerkan ay ku dooratay UNESCO waxa ka mid ah sida uu u xoojiyo qeynuunnada caalamiga ah sida xuquuqda haweenka iyo carruurta, dhowridda deegaanka iyo xallinta khilaafaadka.\nUNESCO ayaa ammaantay hannaankan oo ay u aragtay inuu tusaale dhif ah u yahay dhaqanka sharciga ah ee nool kaasoo dhiirrigelinaya dowlad-wanaagga iyo iskaashiga isagoo sidoo kale wax ka qabanaya caqabadaha maanta sida xallinta khilaafaadka iyo dhowridda deegaanka.", "date": "2024-12-16", "scraped_at": "2025-11-02T07:52:06.986894+00:00", "category": "news", "text_hash": "292d7113876c13c4ce3b83382a2eafdb5fe36e7baecf30b185eb2f4d791db9a9", "minhash_signature": "11450598,26267524,1147550,17647701,3980967,14876516,9754363,8378359,10759872,4680267,3609225,4526452,753490,4425411,7039707,27594407,26733706,1829084,5132862,3536107,10679794,4441270,34513302,248960,4376500,10381039,4745808,7534334,36153228,1646709,2072752,6834323,2511298,41622,3096031,13580266,16591668,3488932,2431976,523540,8580605,13853925,1635835,4123521,5562445,4291938,128218,3075791,3346520,18084195,7366006,6299018,6862138,14645579,110376,4578253,9139985,3913495,4336052,5934720,1736984,683187,425968,4699028,17399422,916299,35735582,10951928,7692685,5122766,10665575,26220698,5309795,9895013,4754889,10877429,2994126,6900829,11349563,20042658,73097,4628897,3327227,12701593,4029177,24528641,17271383,2920001,8163538,5472519,9716074,4554233,3536056,2185895,4044679,2465823,14934747,5316030,1492760,14240915,6896549,5567773,1594872,5216191,2983180,29435465,15583239,19870719,6093705,3734443,11366447,114672,10315846,11866688,5089401,7671173,5157178,5524054,26397683,1850029,3725129,5747641,13720312,2753144,23030511,4231436,11913428,5351542"}
{"url": "https://www.bbc.com/somali/articles/ckgyw8zw442o", "title": "Sida iskaashiga Turkiga iyo Soomaaliya uu u xoojiyay hannaanka caafimaadka dalka", "text": "Xigashada Sawirka, SOCIAL\nDhaqaatiirta ka howlgasha Isbitaalka Tababarka iyo Cilmi-baarista Recep Tayyip Erdogan ee magaalada Muqdisho ayaa noqday kuwo hoggaanka u haya daaweynta casriga ah, kadib markii ay aqoon ka korosadeen hannaanka daryeelka caafimaadka ee Turkiga.\nTababarro badan oo dhanka qalliinka xabadka ah, daaweynta gudaha iyo qalliinka wadnaha oo ay qaateen, dhaqaatiirta isbitaalka ayaa door muhiim ah ka cayaara horumarinta adeegyada daryeelka caafimaad ee guud ahaan dalka.\nDr. Cali Muhammed Warsame oo uu soo xigtay wargeyska Daily Sabah ee dalka Turkiga, oo xirfaddiisa kasoo bilaabay kaaliye ahaan sanadkii 2019, isbitaalkana dhaqtar ka ahaa tan iyo February 2025 ayaa sheegay in lix bilood oo tababar ah uu ka helay xirfadlayaasha Turkiga, taasoo sare u qaadday shaqadiisa.\n\"Qalliinka xabadka, Soomaaliya waxaa keliya lagu fuliyaa isbitaalkan,\" ayuu yiri. \"Waxaan sameynaa qalliinno waaweyn, oo ay ka mid yihiin kansarka, iyo dhaawacyada wadnaha iyo sambabbada.\" Ayuu intaa ku daray.\nDhaqtarka ayaa sheegay inuu door bidayo inuu Soomaaliya ka shaqeeyo beddelkii uu dibadda aadi lahaa, si uu bulshada u caawiyo.\nXigashada Sawirka, AA\n\"Hormuudka daaweynta casriga ah wuxuu ka dhashay isku darka taageero aan ka helnay dowladda Turkiga iyo tababarka dhaqaatiirta Soomaaliyeed iyo nidaam maamul oo hufan,\" ayuu yiri agaasimaha Isbitaalka Tababarka iyo Cilmi-baarista Recep Tayyip Erdogan Maxamed Xuseen Ashraf oo BBC-da la hadlay.\nEnd of Ugu akhris badan\nAgaasimaha ayaa sheegay in dowladda Turkiga ay isbitaalka ku taageertay qalab caafimaad, khubarro caafimaad oo caalami ah iyo habraacyo maamulka oo tayo leh.\n\"Waxaa la sameeyay iskaashi u dhaxeeya labada wasaaradood ee caafimaad ee dowladaha Soomaaliya iyo Turkiga. Tusaale ahaan, dhaqaatiirta Soomaaliyeed ayaa si joogto ah tababar uga hela gudaha iyo isbitaallada ay maamusho dowladda Turkiga, iyagoo waxbarashadooda sanadka ugu dambeeya kuq aata Turkiga\" ayuu yiri.\nIskaashiga dhow ee u dhaxeeya Turkiga iyo Soomaaliya ayuu agaasimaha sheegay inuu qeyb ka yahay tayada caafimaad ee isbitaalka.\nQaar ka mid ah daaweynta casriga ah ee isbitaalka looga soo doonto qeybo xitaa dalka ka baxsan sida dalalka deriska ah, ayuu agaasime Ashraf sheegay inay ka mid yihiin kilyo sifeynta oo dalka uusan lahaan jirin, qalliinnada wadnaha ee furan. \"Shilalka iyo dhibaatooyinka waaweyn markay dhacaan waxay u baahan yihiin qalliinno sida lafaha iyo madaxa,\" ayuu yiri.\nXigashada Sawirka, FACEBOOK\nBukaanno ka kala yimid gobollada Soomaaliya iyo sidoo kale dalalka deriska ah, sida Kenya, Itoobiya iyo Jabuuti ilaa Uganda ayuu agaasime Ashraf sheegay in lagu daaweeyo isbitaalka.\nIsbitaalka ayaa dhowaan noqday adeeg bixiyaha ugu fiican ee hay'adaha dowladda kadib abaal-marinta sanadlaha ah ee ay dowladda Soomaaliya bixiso oo lagu qabtay magaalada Muqdisho.\nAgaasimaha ayaa sheegay \"inay haatan u tartami doonaan isbitaalka adeegyada ugu fiican bixiya ee Bariga Afrika maaddaama ay Soomaaliya dhowaan ku biirtay bulshada Bariga Afrika\".\nXigashada Sawirka, FACEBOOK\nIsbitaalka Tababarka iyo Cilmibaarista ee Recep Tayyip Erdoğan oo Muqdisho laga furay 2015-kii, waxaa uu leeyahay ku dhowaad ​​250 sariirood, waxaana uu leeyahay daryeelka degdegga ah, qolalka qalliinka, sifeynta iyo qeybaha gubista.\nBixinta daryeelka caafimaadka ka sokow, xaruntu waxay u adeegtaa sidii xarun tababar, taasoo u sahlaysa boqollaal dhaqaatiir Soomaaliyeed ah iyo shaqaalaha daryeelka caafimaadka inay khibrad wax ku ool ah ka helaan iyadoo ay weheliyaan khubarro Turki ah sanadkii.\nIsbitaalka waxaa ka shaqeeya ku dhowaad ​​1,100 shaqaale ah, oo ay ku jiraan ku dhawaad ​​170 Soomaali ah iyo 30 dhaqaatiir Turki ah.\nMa ahan oo kaliya xarun caafimaad oo muhiim ah balse sidoo kale waxay noqotay calaamad muujinaysa saaxiibtinimada Turkiga iyo Soomaaliya.", "date": "2025-10-14", "scraped_at": "2025-11-02T07:53:07.040698+00:00", "category": "news", "text_hash": "87728fa5ebe301e747b5c2e48e71e936c40c68583ca2b232adc8f028ffc71944", "minhash_signature": "3805333,7552704,20398731,1454766,2744682,2700255,8526010,19157047,3771312,1685652,15589451,58766057,5336026,10301582,2193427,10147988,4351790,9171468,6223150,3908518,13210128,8317417,397793,15179258,547334,21371075,1045025,764493,4518309,5508452,3807993,21095121,2338938,13991883,2798427,211275,29582154,232075,291582,2695602,16121349,2937187,4931784,241794,5589965,4115187,12562029,6674888,321445,275598,3572723,872298,10538994,12338518,1467790,4578253,3332251,599404,16358596,12997223,1926012,10647633,5346677,5864050,16836816,4806521,8957875,20779721,19058787,3110083,9529765,7453450,5223295,14660673,8791966,35273018,2994126,1003617,5801309,219315,7911295,826783,1710570,11538298,8280055,18159559,6119364,2208026,2290410,3711971,3059808,9100168,6563015,3108937,15654316,5476988,11041340,666561,1492760,6893324,11685014,50875464,2599615,6938659,3623139,1865217,14520719,6522464,3604974,4423439,10302767,13164139,121339,7596487,5522808,9388250,10242625,7024020,3315222,8887468,3202128,39103,755147,19920912,2469752,12113131,126377,4388909"}
{"url": "https://www.bbc.com/somali/articles/cjel8vg8lqdo", "title": "Sagaal shey oo ay dumarku allifeen balse aadan ogeyn", "text": "Xigashada Sawirka, Getty Images\nHaddii lagu weydiiyo dadka ugu caansan adduunka ee wax ikhtiraacay waxaa kuguu soo dhacaya shaqsiyaad ay ka mid yihiin Thomas Edison oo sameeyay nalka iyo Alexander Graham Bell oo ah ninka sameeyay taleefoonka.\nMaxaad ka ogtahay haweenka wax allifay sida Mary Anderson ama Ann Tsukamato?Waxaa suuragal ah in aadan aqoon magacyadan, balse haweenkan waxay sameeyeen aalado wax weyn ku kordhiyay seyniska oo aan maalin kasta isticmaalno.\nXigashada Sawirka, HANNAH EACHUS\nKaddib markii ay ku biirtay ciidamada badda Mareykanka dagaalkii labaad ee adduunka, Grace Hopper waxaa loo diray in ay sameyso kombayuuter cusub oo lagu magacaabo Mark1\nWaxay hormuud ka aheyd in barnaamijyo loo sameeyo kombayuuterka sanadkii 1950-kii. Waxay sameysay luuqada kombayuuterka taas oo amarada ka dhigta luuqad uu kombayuuterka uu aqrin karo. Taasi waxay ugu dambeyn noqotay wax weyn oo lagu kordhiyay sida ay kombayuuterada u shaqeeyaan.\nHopper waxay sidoo kale gacan ka geystay erayga sida weyn loo yaqaan ee ah \"de-bugging\"  kaas oo macnihiisu yahay in uu saxo khaladaadka oo ilaa hadda adduunka si weyn looga adeegsado.\nGrace kombayuuterada ayey ka shaqeyneysay ilaa ay shaqada ka fariisato, waxayna noqotay sarkaalkii ugu da'ada weynaa ee ciidamada badda Mareykanka ka shaqeeya. Markii ay shaqada ka fariisaneysay waxay jirtay 79.\nEnd of Ugu akhris badan\nDr Shirley Ann Jackson waa haweeney u dhalatay Mareykanka oo cilmiga fisigiska taqaan. Cilmibaaristii ay sameysay laga soo bilaabo 1970-kii ayaa horseeday in la arko numbarka ku soo wacaya iyo in qofka marka uu taleefoon ku hadlayo uu sugo qofka kale ee soo wacaya.\nHal abuurkeeda isgaarsiinta waxa uu keenay in inta kale ay awood u helaan in ay soo saaraan Fax la qaadi karo, xargaha fibre optic loo yaqaan iyo saxamada cadceeda ku shaqeeya.\nWaxay aheyd haweeneydii ugu horeysay Mareykanka ee shahaadada PhD ka qaadata machadka tiknolojiyada ee Massachusetts iyo sidoo kale waxay noqotay haweeneydii ugu horeysay Mareykanka ee hoggaamisa kooxda ugu sareysa cilmibaarista jaamacada.\nXigashada Sawirka, Hannah Eachus\n1903-dii Mary Anderson oo booqaneysay magaalada New York ayaa dareentay in darawalka uu ku qasban yahay in uu furo daaqadaha si barafka muraayada hore u dhalaalo.\nMarkasta oo daaqada la furo qofka baabuurka saaran wuxuu dareemaa qabow. Markaa kaddib Anderson waxay la timid xal ah cinjir af leh oo muraada ka nadiifya barafka. Sanadkii 1903-dii ayaa lagu abaalmariyay in ay iyadu tahay qofka alifay ee ka faa'idaya aaladaas.\nAnderson marna faa'ido kama helin wixii ay aliftay, xitaa kaddib markii ay noqdeen qalab gaari kasta lagu dhajiyo.\nBatariyada cimrigoodu uu dheeryahay ayaa tamarsiiyay dayaxgacmeedyada loo diro hawada sare. Aad ayeyna muhiim u yihiin.\nOlga D Gonzalez-Sanabria waxay asal ahaan ka soo jeedaa dalka Puerto Rico, waxayna aliftasy farsamadii lagu sameeyay batariyadan sanadkii 1980-kii. Markii dambe waxay maamule ka noqotay xarunta cilmibaarista ee Nasa Glenn.\nCochrane waxay dooneysay mashiin alaabta u dhaqa si ka dhaqsiyo badan qofka shaqaalaha ee u shaqeynayay kaas oo ay adag tahay in uu ciladoobo.\nMashiinka ay sameysay wuxuu ahaa mid sida lugta u wareegaya kaas oo ku xiran matoor wareejiya, wuxuuna noqday mashiinkii ugu horeeyay ee isticmaala biyaha xoogga u tuurmaya.\nCochrane ninkeeda wuxuu ahaa in qamriga aad u caba, wuxuuna kaga dhintay deyn badan oo iyada laga doonayay in ay bixiso, taasna waxay ku dhalisay in wixii ay aliftay 1886-dii in ay ka faa'ido iyadoo sameysatay warshad soo saarta qalabkaas.\nXigashada Sawirka, Hannah Eachus\nMarie Van Brittan Brown oo aheyd kalkaaliso inta badan guriga kaligeed joogi jirtay ayaa la timid fakar ah in ay dareento ammaan iyadoo gurigeeda joogta.\nIyada iyo ninkeeda Albert ayaa sameeyay markii ugu horeysay qalabka ammaanka ee guryaha lagu xiro.\nSababta ku dhalisay in ay qalabkan sameeyaan ayaa ka timid sanadkii 1960-kii xiligaas oo dambiyadu bateen iyadoo booliskuna uu soo daahayay.\nQalabka ay sameeyeen waxa uu ahaa mid adag oo leh kaamero taas oo ku xiran albaabka guriga. Waxayna kala soconayeen shaashad u taalay qolkeeda jiifka taas oo laheyd gambaleel.\nXigashada Sawirka, Hannah Eachus\nTsukamoto wixii ay soo saartay waxay horseedeen in horumar weyn laga gaaro fahamka nidaamka uu u shaqeeyo dhiiga bukaanada qaba Kansarka taas oo keeni karta in laga daaweeyo cudurka.\nSanadkii 1991-dii ayaa Ann Tsukamoto lagu abaalmariyay wixii ay dunida ku soo kordhisay.\nTsukamoto waxay waxay sameysay cilmibaaris kale oo ku saabsan unugyada sida ay u koraan.\nStephanie Kwolek waxay sameysay fibre-ka fudud ee loo isticmaalo jaakadaha xabada celiya iyo qalabka kale ee dagaalka loo xirto.\nIlaa markii ay sameysay 1965-tii, qalabkaas oo ka xoog badan shan jibaar biraha, waxa uu badbaadiyay nolol badan, waxaana si joogto ah u isticmaala militeriga.\nNin lagu magacaabo Charles Darrow ayaa inta badan loo tiriyaa in uu alifay ciyaaraha sida jarta oo kale ah ee looxa lagu dheelo balse sharciyada lagu dheelo ciyaarahaas waxaa aliftay Elizabeth Magie.\nNin lagu magacaabo Charles Darrow ayaa inta badan loo tiriyaa in uu alifay ciyaaraha sida jarta oo kale ah ee looxa lagu dheelo balse sharciyada lagu dheelo ciyaarahaas waxaa aliftay Elizabeth Magie.\nMagie waxay dooneysay in ay soo bandhigto dhibaatooyinka hanti-goosadka iyadoo dadka dheelaya ciyaarta ay wax ku kala gadanayaan lacago aan sax aheyn.", "date": "2025-07-19", "scraped_at": "2025-11-02T07:54:07.544600+00:00", "category": "news", "text_hash": "0099b07cb192cd70b38483836b9d4ba034c0ed8b9c871dd8e6421aeba509cd27", "minhash_signature": "17105109,501774,10797337,25015774,14964764,6328264,11489096,4648382,1197336,14731766,9372440,4374040,21459476,6207214,727938,5216909,1485936,1380213,9120498,377064,3946842,2787876,3177616,4436629,3137403,6582295,3937769,9535144,335006,44303,6335813,3099039,5145165,2412120,4464259,374328,1226459,5597215,3497660,12302410,14982854,262620,8588460,5405112,11920891,1470623,7560908,1695249,926976,14911292,2024499,499821,1780679,13874932,1657095,2144769,1877717,19265996,2299056,961930,1964458,445805,7886965,1447226,5962382,16452465,3046894,4170397,325646,5168562,18776356,20073531,11020636,672543,78686,3606049,10991092,9819743,4147059,7600270,4344214,1397984,15760924,1411787,11270274,4929413,760739,4657169,5020058,11675932,30843780,9100168,13526046,16416855,5180684,22160923,3696506,2022488,2281609,2223933,11235136,5580227,4545074,16216962,2314220,312422,2174051,3575342,556584,6344826,11772338,187566,11639625,6086722,659421,899793,144036,3525709,1218680,2955948,1557765,2870158,2748834,314306,2507320,1189619,6364709,3983402"}
{"url": "https://www.bbc.com/somali/articles/cx25lj7vevxo", "title": "'\"Marka aan gool u dhaliyay Soomaaliya, kalama joogsaneyn dadka isoo wacayay'", "text": "Sakariya Cabdi Xasan waxa uu u ciyaarayay naadiga AFC Sudbury ciyaar aan aheyn heerka koowaad markii uu soo wacay taleefoon uusan fileynin. Taleefoonkaas wuxuu ahaa mid loogu sheegayay in uu ka mid noqdo xulka qaranka Soomaaliya.\nSakariya oo loo yaqaan Sak waxa laga keenay Netherland markii uu jiray sideed sano kaddib waxa uu isaga kala gudbay akadeemooyinka Leyton Orient, QPR iyo Tottenham.\nHadda waxa oo u ciyaaraa naadiga Wealdstone, in uu ka mid noqdo xulka qaranka Soomaaliya waxay aheyd wax uusan fileynin.\n\"Ma fileynin in ay suuragal tahay marka la fiiriyo heerka aan ka dheelayay\" ayuu BBC-da u sheegay Zakariya.\nMarkaa wixii ka dambeeyay waxa uu xulka Soomaaliya u dheelay 10 jeer isagoo labo jeer goolal dhaliyay.\nMuddo lix sano ah wax guul ah ma gaarin xulka, waxayna is reereebka koobka adduunka kaga jiraan halka ugu hooseeya. Sakariya rajo fiican ayuu ka qabaa balse waxa sugaya jid dheer.\nEnd of Ugu akhris badan\n\"Toban sano ka hor sidii aan aheyn waa ka fiicannahay, 5-0 ama 6-0 hada noolagama badiyo\" ayuu yiri Sakariya oo intaas ku daray \"Markii aan bilaabay in aan Soomaaliya u safto, hal jeer ayaan sanadkii bixi jirnay balse hadda joogto ayaan u baxnaa\"\nXigashada Sawirka, Getty Images\nSoomaaliya dagaal sokeeyey ayey soo martay, markii ugu dambeysay uu xulkoodu ciyaar gudaha ku martigeliyo dal oo lagu qabtay garoonka kubbadda cagta Muqdisho waxay aheyd sanadkii 1986. Sakariya waxa uu sheegay in halkaas markale lagu dheelo in ay tahay wax aad u weyn.\nHadii aan gurigeena ku dheelno, wax weyn ayey noo tahay\", ayuu yiri Sakariya.\n\"Marka aan si caadi ah u dheelno, waxaa noo yimaada taageerayaal boqol ama labo boqol gaaraya si ay noo taageeraan, waxaana ku dheelnaa Djibouti iyo meelo kale halkii aan gurigeena kula dheeli laheyn\".\n\"Taageerayaal garoonka soo buuxiya oo na taageeraya, waxay ahaan laheyd cajiib\".\nSak waxa uu aaminsan yahay in xulka qaranka Soomaaliya uu meel fiican ka gaari karo ciyaaraha Qaramada Africa ee AFCON.\n\"Waa cadahay in aan u dhaweyn guul, balse waa ka dhabeyn karnaa, tobanka sano ee soo socda, dhabtii waan u soo bixi karnaa,\" ayuu yiri Sakariya oo rajeynaya in uu dhiirogeliyo xirfadlayaal gudaha ka soo baxa.\n\"Kubadda cagta wax weyn ayey ka tahay Soomaaliya\" ayuu yiri Sak.\n\"Wiilasha, gabdhaha iyo qof kasta wuu dheelaa, waana isboortiga ugu weyn Soomaaliya, qof kasta ayaa daawada\".\nMa ahan oo kaliya taageerayaasha jooga dalka. Britain waxaa ku nool jaaliyad balaaran oo Soomaaliyeed, markasta oo uu xulka qaranka dheelayo, Sak wuxuu sheegay in teegeero balaaran ay ka helaan dalka.\n\"Marka aan gool u dhaliyay Soomaaliya, kalama joogsaneyn dadka isoo wacayay, fariimaha ii soo dhacaya waali ayey ahaayeen. Wax la barbardhigo ma lahan jaceylka ay dadka Soomaaliyeed i tusiyeen\"\nAbshir Aadan iyo Andreas Ali waxay labadaba u dheeleen naadiga Phoenix Next Gen oo ah naadi Soomaalidu leedahay oo deggan magaalada Bristol. Labadaba taageerayaal ayey u yihiin Sakariya.\n\"Waa cajiib in aad aragto qof aad isku meel ka soo jeedaan\", ayuu yiri Andreas oo intaas ku daray, \"in aad aragto qof heer caalami gaaray waxay taasi dhiirogelin u tahay jiil soo koraya\".\n\"Aad ayaan ugu faraxsanahay wiilashaas, bulshada oo dhan ayey ka farxiyeen, waqti unbaa naga xiga in ay guuleystaan\".\nHadii naadiga uu sii wanaagsanaado, Abshir waxa uu aaminsan yahay in Soomaali badan oo qurbaha ku nool u ciyaaraan xulka Qaranka Soomaaliya.\n\"Hada dadka ka yimaada dalalka sida Sweden, UK iyo adduunka oo dhan waxay fahmayaan in ay u ciyaari karaan xulka Soomaaliya\".\n\"Toban sano gudahood waxaan arki doonaa ciyaal badan oo Soomaali ah in ay ka ciyaaraan England, waxaana rajeynayaa in Soomaaliya loo dheelo iyo Sak Xassan in ay noqonayan hiigsi\".\nSoomaaliya muddo lix sano ah ciyaar kuma guuleysan balse barbardhacyo badan ayey galeen.\nMid ka mid ah kuwa aadka loo xusuusta waa markii loo soo baxayay koobka adduunka oo ay la dheeleen Guinea. Sak waxa ka horjeeda Serhou Guirassy oo ah weeraryahan u ciyaara Borussia Dortmund.\n\"Saddex gool ayuu ka dhaliyay Barcelona balse hal gool wuu ka dhalin waayay Soomaaliya,\" ayuu yiri Sakariya.\nSoomaaliya waxay rajeyneysaa in ay guulo gaarto ciyaaraha soo socda ee lagu soo baxayo.\n\"Waan jeclaan laheyn in aan guuleysano, balse barbardhac ma ahan natiijo xun\" ayuu yiri Sakariya.", "date": "2025-09-06", "scraped_at": "2025-11-02T07:55:07.211823+00:00", "category": "news", "text_hash": "539c4f774b1caf6ab27e2b53a82e993fb77e0f49645958fc2af1be0afd4f30b8", "minhash_signature": "2245547,619823,6288947,4473024,3651248,3571275,6186727,3035947,484907,3820921,1156291,6283743,14462148,20719240,13828342,373639,12637555,3521550,5744883,7089062,693391,14314923,9233275,4436629,10807544,206471,19138022,6585853,781488,3674815,1953322,11417628,3310396,2745590,74473,652525,994940,27031365,12504154,16526196,18409083,1705678,21160029,4422480,8099829,656981,3507141,7764323,10209733,6692134,3526258,1099219,8428050,8085109,5386072,1279159,14533391,361260,3852482,3886372,1926012,580480,687927,18991767,13089084,8059216,13609191,5647749,2422698,16869552,613892,10893426,8109075,1333185,1872674,509366,2768695,7256932,16826387,2511099,11661986,4302754,10267688,4597970,1531610,6353547,4476035,76660,10741053,9125254,829528,2733184,1540711,10027658,2152236,468377,16388921,8373214,1492760,1712891,9542717,3684610,14278395,1862631,11023869,989258,4438964,3701301,8623564,3558194,5039665,3233914,510585,4522627,92090,10548301,4780844,14017631,1701718,19490478,9545148,3918031,1538944,3784151,11825196,227509,2724679,11498927"}
{"url": "https://www.bbc.com/somali/articles/cx275rg17l1o", "title": "Maxaan ilaa iyo haatan ka ognahay gacan ka hadalkii dhexmaray ilaalada  mucaaradka iyo booliiska?", "text": "Xigashada Sawirka, baraha bulshada\nDowladda Soomaaliya ayaa ku eedeysay hoggaamiyeyaasha mucaaradka inay isku dayayaan inay khalkhal iyo xasilloni daro ka abuuraan magaalada caasimadda ah ee Muqdisho, kaddib iska horimaad khasaare geystay uu Arbacadii ka dhacay magaalada Muqdisho.\nRabshadahaan ayaa yimid kadib markii siyaasiyiin mucaarad ah oo uu ka mid yahay Madaxweynihii hore Shariif Sheekh Axmed ay gaareen saldhig ay ku xirnaayeen dad loo soo xiray arrimo la xiriira muran dhul, kuwaas oo baraha bulshada lagu baahiyay muuqaalo muujinaya iyaga oo la jirdilayo. .\nIllinka hore ee saldhigga booliska ee degmada Warta-nabadda ayaa ilaalada madaxda mucaaradka iyo kuwa booliska rasaas is weydaarsadeen shalay galabtii, waxaana ka dhashay khasaare dhimasho iyo dhaawac sida ay sheegeen labada dhinac oo la hadlayay warbaahinta gudaha.\nWarsaxafadeed kasoo baxay dowladda fedraalka Soomaaliya ayaa si adag loogu eedeyay siyaasiyiinta mucaaradka iyo ciidamo ay wateen iney isku dayeen inay xoog ku qabsadaan saldhigga degmada Warta Nabadda ee gobolka Banaadir.\n\"Dowladda waxay cambaareyneysaa falal liddi ku ah amniga caasimadda oo ay ku dhaqaaqeen xubno siyaasiyiin ah oo doonayey inay xoog kula wareegaan Saldhigga Booliska ee Degmada Warta Nabadda ee magaalada Muqdisho\" ayaa lagu yiri Warsaxafadeedka ay soo saartay wasaarada war-faafinta dowladda Soomaaliya.\nTaliyaha booliiska gobolka Banaadir Gaashaanle Mahdi Cumar Mumin oo la hadlay warbaahinta ayaa sheegay in ciidamo hubeysan ay saldhiga war-dheegley xoog ku galeen islamarkana ay halkaasi xabbad ka bilaabatay.\nEnd of Ugu akhris badan\n\"Waxaan shacabka Soomaaliyeed u sheegeynaa inay ogaadeen in meesha wax ka dhaceen ay tahay saldhiga booliiska, xabadaha meesha ay ku yaalaanna ay tahay saldhiga booliiska iridiisa, saldhig booliis waxaa loogu talagalay inuu nabad ka shaqeeyo inuu ammaan ka shaqeeyo laakiin ay sharci daro tahay inay ciidan ka baxsan boliiska inay awod ku yimaadaan si sharci daro ah inay ku yimaadaan taasa sababtay isku dhaca\" ayuu yiri Tiliye Mahdi.\nDhanka kale war-saxaafadeed ay booliiska soo saaren ayaa lagu sheegay in \"falka lagu weeraray saldhiga\", ay ka dhalatay inay xabsiga ka baxsadaan maxaabiis dambiyo culus galay.\nXigashada Sawirka, Shariif Sheikh Axmed\nMadaxda mucaaradka oo uu hogaaminayo madaxwaynihii hore ee Soomaaliya Shariif Sheekh Axmed ayaa beeniyay in ay weerareen saldhiga degmada Warnta-nabadda .\nWaxay sheegeen in ay halkaas u tageen si ay u soo eegaan islamarkana ay u so damiinteen mid ka mid ah dadka halkaasi ku xirnaa ee loo geystay jirdilka.\n\"Anaga sida la idin sheegey adeer Cali Iimaan iyo wasiirka ayaa noo yimid oo noo sheegay in ninka waayeelka ah uu ugu jiro wadne macmal ah, oo xitaa mar waxaa naloo soo sheegay inuu dhintay. Marka waxay dhaheen waxaan rabnaa inaad noo damiinatiin noo damiinta aan isbatal geysano ka dib wixii yimaado aan wada aragno intaas ayaan ku baxnay,\" ayuu yiri Shariif.\nWaxaa uu madaxwybihii hore Sheek Shariif Sheekh Axmed sheegay in markii ay goobtii saldhiga ay tageen laga soo xirtay albaabada ka dib-na xabad ay bilaabatay.\n\"Sida la idin sheegay markii aan meesha tagnay si caadi ah ayaan damacnay inaan u galno, albaabada waa la isku dhuftay anigaa la hadlay oo ku iri 'waxaan booqanaynaa dadka dhaawacan ee naga furo. Albaabka ayay isku soo dhufteen ka dib waxaa lagu taliyay inaan gadaal u laabano,.Waxaan go'aansannay inaan shirka jaraa'id meesha ku qabano ka dib-na ka soo tagno markaan is diyaarinay waxaa bilaabatay xabbadii, wiilasha waxaan dhahnay xabad ha ridina,\" ayuu intaa ku daray.\nRai'sul wasaarihii hore ee Soomaaliya Xasan Cali Kheyre ayaa dhankiisa sheegay in mid ka mid ah ilaaladiisa lagu dilay rasaastii halkaas ka dhacday, isaga oo sheegay in mid ka mid ah gawaaridiisa lala beegsaday qoryaha culus.\nHogaamiyayaasha mucaaradka ayaa dhanka kale ku baaqay in maalinta Sabtida ah la qabto dibadbax looga soo horjeedo dhacdooyiinka la xiriirka dhulka ee dowladdu ku lug leedahay.\nDhacdadan xalay ayaa dadka reer Muqdisho dib u xusuusisay iska hor-imaadyadii halkaasi ka dhacay waqtigii doorashada ee madaxwayne Farmaajo.", "date": "2025-09-25", "scraped_at": "2025-11-02T07:56:07.281006+00:00", "category": "news", "text_hash": "532a402be4b64c30792a14b63de12f7ee7b2469ef7e0397cf64371fd570c5c0b", "minhash_signature": "2395470,2618719,2853507,517904,664624,4101340,16008046,2874500,2152432,87201,3392584,6283743,22364905,28341918,3411809,6283179,18361533,241580,5292737,3609803,3220865,7706485,1345739,3071808,13461326,435317,2621276,1319761,19634784,3091049,3300196,5533441,11464638,11426436,9245985,4388580,27040487,2820412,5962881,4251841,11759181,13986751,5933987,844615,642838,13703500,13855608,1446965,1731201,3037579,15897621,11888884,2594533,25873249,1657095,3380392,2155849,7646476,1771973,3881173,5719712,1245488,584383,21376272,16545343,5801853,16379593,7629092,913390,685837,1113094,365975,14953688,4328122,3156845,16079447,907454,1751792,3128080,1329308,12196560,557154,3626715,1070034,10922802,10735583,3071689,4126625,8094193,3299567,826267,9932440,321316,2643363,15360148,1151704,3925786,6582396,1492760,2063850,9432699,902293,7964180,398514,22689459,1134682,1754542,316175,4496875,4619894,11665078,401050,13070988,3101243,2156484,4115662,13770686,2699799,12071910,5545643,423728,842303,1612194,7425861,14580053,20471515,5491447,10654409"}
{"url": "https://www.bbc.com/somali/articles/c1wg4d5pw23o", "title": "Waxa uu Xasan Sheekh ka yiri khilaafka kala dhaxeeya dhinacyada ay is hayaan, iyo xog ay BBC heshay", "text": "Xigashada Sawirka, Telefishinka Qaranka\nMadaxweynaha Soomaaliya Xasan Sheekh Maxamuud oo maanta khudbad ka jeediyay furitaanka Kalfadhiga 7-aad  ee labada aqal ee baarlamaanka Soomaaliya, ayaa ka hadlay qodobbo kala duwan oo ku saabsan xaaladaha dalka.\nWarbixintaan waxaan si gaar ah ugu eegi doonaa laba qodob oo madaxweynuhu khudbaddiisa ku soo qaaday.\nXigashada Sawirka, JBLTV\nMadaxweynuhu wuxuu sheegay in dabiiciyan khilaafka iyo kala aragti duwanaantu ay tahay wax qayb ka ah nolosha aadanaha, hase-yeeshee qaabka loo wajahayo ay ku xiran tahay saameyntooda.\nWuxuu sheegay in dowladdiisu ay diyaar u tahay tanaasul si loo qanciyo siyaasiinta iyo hoggaamiyaasha tabashada qaba, isla markaana loo helo midnimo iyo wadajir Qaran.\n\"Waxaan wali dadaal ugu jirnaa oo aanan ka harin walaalaha ka gows qabsaday inay qayb ka noqdaan geeddi-socodka xasilinta siyaasadda dalka. Haddana maqaamka iyo mas'uuliyadda oo lagu kabay odaytinimada iyo nabad-dooneynta mas'uuliyadda heer qaran, waxay na faraysaa in aan qof kasta oo wax tabanayo raadino, waana ku sii soconaynaa wadadaas Alle idankii\" ayuu yiri madaxweynuhu.\nMadaxweyne Xasan ayaa ku faanay in uu la fariistay Madasha samatabixinta oo ah siyaasiinta mucaaradka ah, oo ay ka wadahadleen qodobbo muddo la isku hayay, sida uu sheegayna ay dowladdiisu ka tanaasushay qodobbadii la isku mari waayay qaarkood oo baarlamaanku horey u ansxiyay sida arrinta doorashada.\nEnd of Ugu akhris badan\nMid ka mid ah khilaafaadka ugu adag ee dowladdu ay wajahayso waa midka kala dhaxeeya maamullada Puntland iyo Jubbaland.\nWaxaana hadalka madaxweynaha ka muuqanaya dabacsanaan iyo in uu rabo in hannaan wadahadal ah lagu xalliyo khilaafka taagan.\nHase-yeeshee Jubaland iyo Puntland ayaan si cad u muujin ilaa  iyo hadda mowqifkeeda, balse ilo ku dhow labada dhinac  oo BBC-da la hadlay ayaa sheegaya in wadahadallo hoose oo u socda dhinacyadaan ay jiraan.\nDhanka dowladda iyo Jubbaland xogtu waxey sheegaysaa in shuruudo la is waydaarsaday maadaama khilaafkoodu markii hore uu meel sare gaaray, hase yeeshee shuruudaha faahfaahin kama aynaan helin.\nXogtan oo ilo dhinacyadaas ku dhow ay BBC u sheegeen ayaan si madax banaan loo xaqiijin karin ilaa hadda.\nKhilaafka dowladda federaalka iyo maamulka Jubaland ayaa gaaray markii hore in madaxda dowladda federaalku ay si cad u sheegeen in aaney aqoonsaneyn doorashadii madaxweyne Axmed Maxamed Islaam (Axmed Madoobe) ee bishii Nofeember sanadkii 2024-kii dib loogu doortay markii saddexaad Kismaayo.\nKadibna waxaa xigay waaranno la isku jaray iyo hadallo ad-adag oo hawada la isku marinayay tan iyo markaa.\nPuntland iyo dowladda federaalka khilaafkoodu wuxuu ku saabsanaa dhinacyo kala duwan marar badan ayay is eedeyeen laba dhinac waxaana ay Puntland dowladda ku eedeysay faragelin iyo siyaasadeynta deeqihii dunida laga heli jiray.\nPuntland inta badan kama qayb gelin shirarkii dowladda federaalka iyo maamul gobolleedyada ee looga hadlayay xaaladaha dalka, waxaana marba marka ka dambeysa sii kordhayay khilaafka iyo tallaabooyinka sii hurinaya.\nXigashada Sawirka, ICRC\nMadaxweynaha dowladda federaalka Soomaaliya ayaa sheegay in dhaqanka Soomaalida aanu ku jirin in maxaabiis la kala haysto, taa badelkeedana waxaa uu tilmaamay in ay tahay in la maamuuso oo xitaa loo guuriyo si ay u dareemaan in la sharfay.\n\"Walaalayaal, ka mid maaha dhaqanka suuban ee Soomaalida in maxaabiis la kala haysto, balse waxaa dhaqan ah in ragga dagaalka lagu qabto in la marasheeyo oo qaarkood loo guuriyo, oo dib loogu celiyo reerahoodii iyo deegaannadoodii, taasoo keeni jirtay in ay noqdaan raggaasi danjirayaal nabadeed\".\nWuxuu madaxweyne Xasan u soo jeediyay dhinacyada maxaabiista kala haysta in aysan dib u eegin wixii shalay dhacay balse ay fiiriyaan berri si aan waqti uga lumin.\nDagaalkii kol hore ka dhacay Laasacaanood ee u dhaxeeyay Somaliland iyo ciidamo dadka deegaanka ahaa oo markaasi ka jiray deegaannada hadda noqday maamulka Waqooyi bari ayaa lagu kala qabsaday maxaabiis badan, inkastoo qaar siyaabo kala duwan loo sii daayay haddana weli waxaa la kala haystaa maxaabiis badan oo jeelasha ku jira.", "date": "2025-09-29", "scraped_at": "2025-11-02T07:57:07.328399+00:00", "category": "news", "text_hash": "53d1d3ac46b5e01734fdb9bcccdc9cc12d8fee19063d38354e30b070c60bfb2c", "minhash_signature": "6178901,3266965,3697230,15910430,14023657,6139539,554124,16339061,10810104,6611621,5550833,401635,2601348,14679189,27511261,10894305,3468730,836603,13780423,2154321,26339812,4756018,9300562,19058040,19945568,4349985,1973967,2764953,1501863,25999518,2457273,730704,17917622,14213746,561089,10917766,20108072,9963763,6674094,3213763,31937965,1880797,6689164,12891902,16200607,7705642,1033119,922837,17782765,388039,8915537,4066469,19008651,1313820,707819,594996,5079225,23107942,232426,1077325,5064237,1033442,670657,1602833,3025342,562689,8185875,4343192,33595286,1339644,3072405,2158682,618857,14643799,756830,22277755,2994126,12000638,4118503,11221205,24865778,2345522,3970142,16155433,7735342,4776216,1167473,7679422,2899158,7851890,7280729,16590928,1355672,14796954,18340581,1006604,15329403,1513267,1492760,1162994,20425575,2117419,2896249,11923550,100296,2572092,6170163,1680400,17239534,4077324,4463414,6450111,4703988,1028065,6961410,1700867,2824464,14039828,1849983,2447024,4772752,10611797,13755764,5082580,8720312,12939909,3769996,4815565"}
{"url": "https://www.bbc.com/somali/articles/cy50yrk6yypo", "title": "Waa kuma ciyaaryahanka noqon doona muslimkii ugu horreeyey ee u ciyaara xulka England?", "text": "Xigashada Sawirka, Getty Images\nDjed Spence ayaa rajeynaya in uu u noqdo dhiirrigelin jiilasha soo socda haddii uu noqdo ciyaaryahankii Muslimka ahaa ee ugu horreeyay ee u ciyaara xulka ragga ee England.\nDifaaca bidix ee Tottenham, oo hore ugu ciyaaray lix kulan xulka da'yarta England ee U-21, ayaa markii ugu horreysay looga yeedhay xulka qaranka ee da'aadda waaweyn si uu uga qayb galo isreeb-reebka Koobka Adduunka ee kula ciyaarayaan Andorra iyo Serbia.\nTani waa tallaabo weyn oo horumar ah oo ku saabsan waayaha ciyaareed Spence, oo hore uga tirsanaa Middlesbrough, isla markaana Tottenham ay amaah saddex jeer ugu dirtay kooxaha Rennes, Leeds iyo Genoa, ka hor inta uusan xilli ciyaareedkii hore ka helin boos joogto ah kooxda koowaad.\nInkasta oo Xidhiidhka Kubadda Cagta ee England (FA) aanu diiwaan gelinayn diin ahaan cidda ciyaartoydu yihiin, haddana wararka ayaa sheegaya in Spence uu noqon doono ciyaaryahankii Muslimka ahaa ee ugu horreeyay ee u ciyaara xulka qaranka England.\n\"Waan ducaystaa mar walba, Ilaahay ayaan had iyo jeer uga mahadceliyaa. Xilliyadii ugu adkaa ee nolosheyda, mugdiga aan waajahay iyo sidaan uga baxay, had iyo jeer waxaan aaminsanaa in Ilaahay I kaalmayn doono. Taasi waa arrin weyn oo aniga muhiim u ah iimaankayga.\"\nEngland waxay Sabtida klau ciyaari doontaa Andorra garoonka Villa Park, ka hor inta aysan u safarin Belgrade si ay Talaadada ula ciyaaraan Serbia.\nEnd of Ugu akhris badan\nXigashada Sawirka, Getty Images\nSpence wuxuu sheegay inuusan dareemaynin wax culays ah oo dhanka diintiisa ah, balse wuxuu rajeynayaa in sheekadiisu noqoto dhiirrigelin dadka kale saamaysa.\n\"Wax culays ah sabab kasta ha noqotee ma dareemayo. Waxaan kaliya kubadda cagta ciyaaraa aniga oo dhoola caddeynaya, faraxsan, wax walbana si dabiici ah ayay ku hagaagayaan,\" ayuu raaciyay.\n\"Haddii anigu sameyn karo, adiguna waad sameyn kartaa. Kaliya ma aha carruurta Muslimiinta ah, balse cunug kasta oo diin kasta ah. Haddii aad maskaxdaada u hureyso arrin, waad gaari kartaa\"\nKahor 15-kii December ee sanadkii hore, Spence wuxuu ciyaaray kaliya 64 daqiiqo oo horyaalka Premier League ah xilli-ciyaareedkii 2024–25.\nTaariikhdaas kaddib, wuxuu 90 daqiiqo ciyaaray 19 ka mid ah 22-kii kulan ee xigay ee Spurs ay horyaalka ciyaareen.\nIsbeddelkaasi wuxuu ahaa mid weyn. Spence si buuxda uguma jirin qorshayaasha tababaraha Spurs, Ange Postecoglou, ilaa xad aan xitaa lagu darin safka hore ee tartanka kooxaha Yurub (Europa League) marxaladdiisii kooxaha.\nMarkii dambe waxaa laga saaray ciyaarihii is-reebreebka, balse wuxuu 180 daqiiqo ku dheelay guushii wareegga 16-ka ee ay Spurs kaga adkaatay AZ Alkmaar.\nWuxuu beddel ku soo galay markii Spurs ay garaacday Manchester United kulankii finalka, taas oo u xaqiijisay Spurs koobkoodii weynaa ee ugu horreeyay muddo 17 sano ah, isla markaana u suurtagelisay inay ka qeyb galaan Champions League.\nSoo bixitaanka Spence xilli ciyaareedkii hore wuxuu ahaa mid aad u muuqda, ilaa xad la hadal hayay inuu ku biirayo xulka koowaad ee England, kaas oo uu bishii March uu u yeedhay tababare Thomas Tuchel.\nSi kastaba ha ahaatee, Spence looma dooran xilligaas in ka sii mid ahaado xulka, waxaana bedelkiisa lagu dhawaaqay da'yarka Arsenal, Myles Lewis-Skelly, oo loo arkay xiddig cusub iyo wajiga cusub ee garabka bidix, inkasta oo Spence uu haystay tirakoobkii ugu fiicnaa ee Premier League waqtigaas.\nLaakiin Spence wuu sii haystay booskiisa, waxaana kaddib markii uu ciyaaray daqiiqad kasta xilli ciyaareedka cusub ee Spurs ee Premier League, loogu yeeday inuu ku biiro xulka qaranka waaweyn.\n\"Waa arrin aad u weyn in England loo ciyaaro, boqolkiiba boqol,\" ayuu sheegay Spence.\n\"Macallinku wuxuu igu abuuray kalsooni, qof walbana waa isoo dhaweeyey. Waxaan hore ugu ciyaaray xulka da'yarta U-21, sidaas darteed wax yar ayaan ka ogahay heerka qaramada. Laakiin xulka waaweyn waligay maan helin jaanis aan ugu ciyaaro.\"\nSpence wuxuu markii ugu horreysay u saftay xulka England U-21 bishii March 2022, isaga oo tababare Lee Carsley u ciyaaray ciyaar ay la ciyaarayeen Albania.\nCarsley wuxuu rabay inuu Spence la aado tartankii Yurub ee da'yarta U-21 ee 2023, kaas oo England ku guuleysatay iyagoo Spain kaga adkaaday ciyaarta kama danbaysta ahayd, balse dhaawacyo ayaa ka hor istaagay daafacaas inuu ka qeyb galo tartankaas.\nCarsley, korodhka magaca iyo muuqaalka Spence wax lala yaabo uma arko. Wuxuuna sheegay in uu filayey in heerkan iyo mid ka sarreeyaba gaadhi karo, marka loo eego xirfadda kubadeed ee uu leeyahay.", "date": "2025-09-05", "scraped_at": "2025-11-02T07:58:07.915895+00:00", "category": "news", "text_hash": "6c30bd55773e5db06cb8a704a021d1e2c85e0a44b56ec0b8109c365d99c3cf8f", "minhash_signature": "7626688,683819,894413,8337975,7299463,16591702,39242137,12408168,8196676,4495767,2291584,9642927,4514682,1430640,1781591,1836811,1190035,3497521,8138654,4084204,2842072,1140864,10089936,2563282,1285901,10301057,19737728,10226107,9025006,2701622,5995088,21064092,7899729,10697394,3015969,7769431,2335700,4401786,802617,994482,1566491,5673898,8798986,12001276,4713165,9812271,3638660,6689646,12916407,2688797,115863,11389810,8064452,16614838,17016237,2248595,4169532,74276,1092966,5983040,195428,1177829,4970179,728341,1653058,21523121,2035693,1554501,6179182,1004836,6804646,378970,4439286,2440496,6908917,5481578,4912484,3377135,5715295,864616,4050583,11471357,7165644,6918553,316360,1774649,5649325,2051009,3284667,29847554,2490497,14409520,3096163,16928819,4347000,7259983,4302971,196393,1187783,13110159,2863091,4692460,3322593,4975395,1430467,6090322,385862,1692562,5552924,11822193,13813680,11109350,3352309,3145221,11825317,5124605,8421498,10553579,9305217,11904178,8988035,607030,8685728,2784767,6337092,3132253,10045197,12094518"}
{"url": "https://www.bbc.com/somali/articles/cy6q7jd991qo", "title": "M﻿axaad ka taqaannaa Mahad Karate, hoggaamiyaha awoodda badan ee Mareykanku raadinayo?", "text": "Xigashada Sawirka, Social Media\nMahad Karate waa mid ka mid ah hoggaamiyeyaasha ugu awoodda badan ee ururka Al-Shabaab oo iyaga iyo dadka deegaanka oo kaashanaya ciidamada dowladda uu dagaal ku dhexmarayo qeyb ka mid ah gobollada Soomaaliya.\nHoggaamiyahan ayaa loo arkaa in uu kaalin weyn ku leeyahay dagaalkaas, oo xooggiisu ka socdo gobolka Hiiraan. Dhowr jeer ayuu ururku soo weeraray gobolkaas toddobaadyadii ugu dambeeyay ka dib markii dadka deegaanka oo is-abaabulay iyo ciidamada dowladda ay ka qabsadeen dhul ballaaran oo muhiim u ahaa kooxdan.\nH﻿addaba, waa kuma hoggaamiyahan, oo maxaynu ka naqaan noloshiisa Shabaab kahor, iyo hadda ba?\nWaa uu magacyo badan yahay, laakiin kan rasmiga ah waa Cabdiraxmaan Maxamed Warsame. Waxa uu caan ku yahay magaca Mahad Karate. Sida ay shaacisay dowladda Mareykanka, waxaa la rumeysan yahay in uu ku dhashay magaalada Xarardheere ee gobolka Mudug.\nWaxa uu dhashay intii u dhaxeysay sanadihii 1957 1962-dii. Waa ku xigeenka hoggaanka ururka Al-shabaab, waxaa na la sheegay inay hoos tagaan qeybta awoodda badan ee sirdoonka kooxdan ee Amniyaadka loo yaqaanno iyo xitaa qeyb ka mid ah maamulka dhaqaalaha ee kooxdan.  Mareykanku waxay sheegeen in uu ku hadlo afafka Soomaali, Carabi iyo Sawaaxili.\nXigashada Sawirka, AP\nKahor Al-Shabaab iyo burburkii doaladdii Soomaaliya, waxa uu Mahad ka tirsanaan jiray sirdoonkii Soomaaliya ee dowladdii kacaanka, sida dad kala duwan oo aqoon u leh Mahad u sheegeen BBC.\nEnd of Ugu akhris badan\nMa ahan isaga oo keliya, laakiin rag kale oo badan oo ka tirsanaan jiray ciidamadii dowladdii Kacaanka ayaa ka hor burburka iyo ka dib ba ku biiray ururrada Islaamiga ee hubeysan ee Soomaaliya.\nKuwoodda ugu magaca dheer waxaa ka mid ah Xasan Daahir Aweys, oo ahaa hoggaamiye sare oo ka tirsanaa ururkii Itixaad oo mar ahaa kan ugu ballaaran, ugu na awoodda weyn ururrada islaamiga ah ee Soomaaliya. Waxaa la rumeysan yahay in uu Mahad ka mid yahay aas-aaseyaasha kooxda Al-Shabaab, laakiin ma ahan nin magaciisa iyo muuqiisu ba ay aad u shaac baxeen billowgii kooxda.\nWaxa uu ku eedeysan yahay in uu door weyn ka qaatay weerarro iyo qaraxyo ay kooxdu ka geysatay dalalka deriska ah oo ay Kenya iyo Ugaandha ka mid yihiin.\nWaxaa ka mid ah weerarkii sanadkii 2015 ka dhacay Jaamacadda magaalada Gaarisa ee gobolka  Waqooyi-Bari Kenya, kaasi oo ay ku dhinteen ku dhawaad 150 qof.\nXigashada Sawirka, Reuters\n‘Shan milyan oo doolar ayaa dulsaaran madaxiisa’\nKadib weerarkii Jaamacadda Gaarisa, dowladda Mareykanka ayaa duldhigtay shan milyan oo doolar madaxa Mahad Karate. Lacagtaas waxaa loo balanqaaday ciddii keenta xog horseedi karta in lasoo qabto ama la dilo.\nSi la mid ah, waxa ay Mareykanku lacag dhan Lix milyan oo doolar ku doonayaan madaxa hoggaamiyeha Al-Shabaab Axmed Diiriye, oo bedelay Axmed Godane oo Mareykanku ku dilay duqeyn 2014-kii. Laakiin Mareykanku weli kuma guuleysan doonistooda. Sidaas oo ay tahay, marar kala duwan ay dowladaha Soomaaliya iyo Kenya shaaciyeen dilka hoggaamiyaha qarsoon, Mahad Karate.\nHorraantii bishan, dowladda Soomaaliya iyo Mareykanka oo iskaashanaya ayaa duqeyn ku dilay Cabdullaahi Nadiir oo lagu tilmaamay in uu ahaa ninka la qorsheynayay inuu la wareego hoggaanka sare ee Al-Shabaab, kadib Axmed Diiriye, hoggaamiyaha xilligan.\nXigashada Sawirka, AFP\n‘Karate iyo Al-Shabaab ka hor’\nSida uu BBC u sheegay, Janaraal Yuusuf Siyaad Indhacadde oo ay isyaqaanayn Mahad Karate Shabaab kahor, waxa uu ninkan ka tirsanaa jiray ururkii hubeysnaa ee Itixaad, oo loo arko halka uu kasoo bilowday saanqaadka xagjirnimo ee badi hoggaamiyeyaasha al-Shabaab.\nUrurkaas ayaa maamulkii ugu horreeyay oo Islaami ah ka hirgeliyay gobolka Gedo kahor inta aysan ciidamada dowladda Itoobiya gudaha usoo gelin gobolkaas bilowgii sagaashanaadkii si ay ula dagaalamaan kooxdan.\nWaxa uu sidoo kale ururkaas oo mar maamuli jiray qeybo ka mid ah deegaannada Puntland halkaas dagaal ku dhexmaray ciidamadii jabhada SSDF ee uu aasaasay madaxweynihii hore ee Puntland iyo Soomaaliya ba Korneel Cabdulaahi Yusuf Axmed.\nWaxa uu Mahad Karate ka qeybgalay dagaaladdii dhexmaray ururkaas iyo jabhadii xilligaas jiray, ee ka dhacay qeybo ka mid ah Soomaaliya.\nK﻿adib burburkii Itixaad, Yusuf Indhacadde iyo dad kale oo kala duwan ayaa BBC u sheegay in uu Mahad Karate u guuray dalka Kenya, isaga oo ku noolaa magaalada Nayroobi.\nIndhacadde waxa intaas ku daray in Mahad Karate uu ka mid ahaa Koox Soomaali ah oo tagay Afghanistan, halkaas oo la rumeysan yahay inay tababar kusoo qaateen. Waxaa kooxdaas ka mid ah ahaa Aadan Xaashi Ceyrow oo ahaa hoggaamiyihii ugu horreeyay ee al-Shabaab, Axmed Godane oo bedelay Ceyrow iyo xubno kale.\nXigashada Sawirka, SOCIAL MEDIA\nMahad Karate iyo Noloshii Nayroobi\nDad kala duwan, oo xog-ogaal ah oo magacyadooda qariyay sababo amni dartood, waxay BBC u sheegeen in Mahad Karate oo ka shaqeyn jiray shirkad lacagaha xawisha in lagu xiray magaalada Nayroobi kahor inta uusan ku biirin al-Shabaab. Waxa uu xarrigaas dhacay kadib weerarkii argagixiso ee Mareykanka lagu qaaday bishii September 2001dii. Waxaa laga soo xiray xaafadda Islii.\n“Waxaa la sheegay in tuhun soo galay. Sidaas ayaa lagu xiray kadibna qareen ayaa loo qabtay, muddo kadib na waa la sii daayay ”, ayuu yiri mid ka mid ah dadka aan la hadlanay, oo si dhow ula socday arrinkan. Siideynta kadib, waxaa la sheegay in Mahad uu tagay Itoobiya halkaas oo uu uga sii gudbay Soomaaliya. Ma jiro dukumeentiyo iyo xog rasmi ah oo dhanka dowladda Kenya ah oo xaqiijinaya ama beeninaya arrinkan.", "date": "2022-10-14", "scraped_at": "2025-11-02T07:59:07.667562+00:00", "category": "news", "text_hash": "0f2adc853ad83b5569ab711dfb8c51fc0b590f47a2b2e10a39fb905bfb5ae7c2", "minhash_signature": "347385,1212103,2147681,6916072,374660,2758311,6203556,4153390,903323,4194441,9057702,3901088,6069786,3566172,7831123,3245666,1142966,3630222,4960825,1265416,6723976,670344,493005,5750040,2149864,13309,5080583,3509491,576857,10753328,7518102,10016870,872513,1326624,6344945,697401,4878597,6756323,524275,4202107,20714658,858929,1656704,131132,8099829,786674,17942908,4279711,1222676,492060,5932307,8186461,4646073,4330801,12302185,5255990,3022472,15715817,850614,2945745,1139390,8457226,2208150,4695426,781790,514575,950913,4924770,7837536,7318093,8662180,2356508,5842005,1289544,115695,590170,8409733,6899924,2291864,1891575,1731742,2008856,3016825,12552806,3087750,2430187,623112,2763278,9584780,27240581,376708,395161,5291839,3278330,7884027,12402354,2127772,16492388,443240,462300,10003490,26112663,3898353,7773423,5638931,9170496,3113744,11914660,8623564,19498403,992688,15777022,1570370,1235267,9880756,13494,3501562,7414025,7482945,409774,11422834,3127349,11472464,9616211,668486,2522082,5990101,3223884"}
{"url": "https://www.bbc.com/somali/articles/cq83kzpzd2wo", "title": "Maxaan ka naqaannaa Mufti Xaaji Cumar Idriis, wadaadka ay geeridiisu gilgishay Itoobiya?", "text": "Xigashada Sawirka, FANA\nMagaalada Addis Ababa ee dalka Itoobiya waxaa ku geeriyooday Mufti Xaaji Cumar Idiriis oo ahaa madaxweynihii hore ee golaha Arrimaha Islaamaka Itoobiya, islamrkaana ahaa caalim si weyn looga yaqaanno dalkaasi.\nGeerida wadaadka ayaa timi kaddib in muddo ah  uu xanuun la jiifay sida lagu sheegay war-qoraal ah oo lagu baahiya bar uu golahaasi ku leeyahay internet-ka.\nMarxuun Xaaji Cumar ayey si weyn u tabiyeen geeridiisa warbaahinta dowladda Itoobiya iyadoo madaxda dalkaasi ay ka tacsiyeeyeen geeridiisa.\nMadaxweynaha dalka Itoobiya Taye Atsek Selassie, ayaa qoraal uu soo dhigay bartiisa X, sheegay in caalim Xaaji Cumar lagu xasuusan doono \"waxqabadkiisii wanaagsanaa\"\nRa'iisul Wasaaraha Itoobiya Abiy Axmed oo ka tacisyeeyey geerida marxuunk ayaa ku tilmaay inuu wax badan qabtay intii uu hoggaaminayey Golaha Arrimaha Islaamka ee Itoobiya \"Mar walba waxaan xasuusan doonaa waxqabadka Haji Umer intii uu hogaaminayay golaha, gaar ahaan isku soo dhoweynta dhinacyada kala duwan iyo sidii uu u ansixiyay Shuurada Sare ee Arrimaha Islaamka.\" Ayuu yiri Abiy.\nSheekh Haji Ibraahim Tufa, madaxweynaha Golaha Sare ee Arrimaha Islaamka ee Itoobiya, ayaa ku tilmaamay in Xaaji Cumar Idris uu  noloshiisa oo dhan ugu huray barashada diinta, adeegga ruuxiga ah, iyo dadaallada uu ugu jiray midnimada Muslimiinta.\nEnd of Ugu akhris badan\nSida la mid ah madaxda Itoobiya culimada diimaha kale ee dalkaas ayaa ka tacsiyey iyagoo ku tilmaamay inuu ahaa shaqsi ummadda oo dhan u adeegi jiray.\nXigashada Sawirka, FANA\nSheekh Cumar Idriis waxa lagu  xasuustaa erayo la falgalay hab-nololeedka dadka Itoobiyaanka oo ay ugu mudan yihiin kuwo uu kaga hadli jiray is caawinta iyo midnimada.\n\"In aad qof caawiso, waxa kaaga filan in uu qof yahay\" waa mid ka mid ah hal-ku-dhegyada uu ka tagay wadaadkan geeriyooday.\nOraahdaas caanka baxday oo marar badan lagu adeegsaday fagaarayaal kala duwan waxa uu sheekhu ula jeeday in caawimaaddu aanay ku xidhnayn diin, dhaqan, aragti iyo aamminaad kale oo qof la caawinayaa uu ramaysan yahay.\nHadalladaas waxay sidoo kale hadal qabsi u noqday qaar ka mida madaxda Itoobiya oo marka ay khudbadaha jeediyaan adeegsada hadallada uu horrey u yiri Caalim Cumar.\n\"Shacabka Itoobiya ma kala garanayaan qowmiyadda iyo diinta, laakiin siyaasiyiinta ayaa kala qaybsan.\" Xaaji Cumar Idiris\nXigashada Sawirka, SOCIAL\nSida uu BBC-da u sheegay Sheekh Junayd Xamse, guddoomiye ku-xigeenka  Golaha Sare ee Arrimaha Islaamka Itoobiya, oo aqoon u lahaa Muftiga ayaa ku tilmaamay nin kaalin weyn u lahaa arrimah horumarinta Islaamka ee dalka Itoobiya.\n\"Wuxuu runtii ka mid ahaa culimadii waaweynaa ee dalka, wuxuu muddo ka mid ahaa mu'asaaska dalka, wuxuu dadaal badan galiyey xalaqaadka cilmiga \"\nXaaji Cumar ayaa soo noqday madaxweynaha majliska culimada, golahi fatwada, isagoo sanadkii 2019-kiina loo doortay madaxweynaha Golaha Arrimaha Islaamka Itoobiya oo muddo soo hayey xilkaas.\nSida Junaydi xusay Xaaji Cumar ayaa ka mid ahaa guddi uu Ra'iisul Wasaaraha Itoobiya dhisay oo samaysay dadaallo badan oo ku saasanaa isbaddelkii arrimah islaamka ee dalkaasi iyo dhismaha shuruuc iyo xeerar.\n\"Golaha arrimaha Islaamku wuxuu iska ahaa hay'ad laysan sharci kolba loo cusboonaysiiyo lixdii bilood ama sanadkii, laakiin intii joogay ayuu baarlamaanka dalku ay fadhiisten golahana u ansixiyey hay'ad qaanuuni ah oo sharci ah\"ayuu BBC-da u sheegay Junaydi.\nMufti Xaaji Cumar Idris, ayaa noqday Muftigii ugu horreeyeey oo Ra'iisul Wasaare Abiy Axmed guddoonsiiyo shahaado Sharaf Dr, ah oo ay siisay jaamacad Addis Ababa sanadkii 2011-kii\nMufti, Xaaji Cumar Idriis ayaa ku caan ahaa inuu dadka ugu yeero in la is caawiyo, midnimada la ilaashado lagana shaqeeyo samalka.\nSida uu BBC-da u sheegay Sheekh Junayd Xamse, guddoomiye ku-xigeenka  Golaha Sare ee Arrimaha Islaamka Itoobiya, marxuunka ayaa la tilmaamaa inuu  ku dhashay deegaanka Jineto, oo ka tirsan maamulka Amxaarada ee dalka Itoobiya.\nMuddadadii dheerayd ee ka shaqaynayey cilmiga diinigaa iyo hoggaaminta goloyaal kala duwan oo Islaamka Itoobiya mufti Cumar Idriis ayaa kasbaday in dadka Itoobiyaanku jecladaan hadalladisii u badnaa is kaalmeynta iyo isku duubnimada.", "date": "2025-10-20", "scraped_at": "2025-11-02T08:00:07.562207+00:00", "category": "news", "text_hash": "2cad7ccae9521e34a24d9d275c431292f785a041efa2b899bac0d5b65d3cf335", "minhash_signature": "12139804,5257326,2147681,12062948,1102227,378372,10738103,6286335,1045122,4080253,37006217,5564862,5930506,11957284,5853897,11604399,15928456,4770858,9033016,4938769,1002078,9100553,2792684,2137324,5243419,26355128,20220574,12307415,1916563,351455,12407885,1716405,7584333,2420681,68496,13213969,26506685,18632847,1090215,12165604,16111605,20094196,616185,755307,2905469,4892736,4867142,1168202,3860907,5701135,2689814,1189729,4328065,211855,14202851,14632578,11472582,52457663,7585403,7353426,2147937,9597218,5080193,13786185,1246920,9787954,5276430,3235649,440037,6239304,6477986,862021,1041954,2012167,6939579,11318281,8229706,32953126,2031643,9436387,8565763,4628869,9612587,475783,1747422,876426,13847320,7271228,15781973,21434660,879411,8387284,8584869,7782277,1227122,484016,13185176,2011015,1492760,4415858,2799680,160610,9606613,14009795,8415734,3514299,15746671,14264420,1444185,3234254,2641075,2920885,5459727,8605831,5676644,5152761,3528372,381538,3746773,4519595,1281483,9232222,4021963,2731233,6623475,544796,605915,2655148"}
{"url": "https://www.bbc.com/somali/articles/cd6701w5932o", "title": "Waa maxay caado go'a maxayse haweenku la kulmaan marka ay marayaan marxaladdan?", "text": "Sanad walba 18-ka Oktoobar waxaa caalamka laga xusaa maalinta wacyigelinta caado go'a, iyadoo sanadkan halkudhigga uu yahay \"Daawada Habka Nolosha ee Daryeelka Caado Go'a,\" kaasoo diiradda lagu saarayo doorashooyinka hab-nololeedka haweeneyda ee lagu horumarinayo caafimaadka haweenka ku guda jira marxaladdan iyo kadib.\nHaweeney walba way martaa marxaladda caado go'a, calaamaduhuna waxay caadi ahaan billowdaan da'aadda hore ee 40-meeyada.\nHaddaba, waxaan halkan idinkugu soo gudbineynaa xaaladaha ay haweenku maraan marka ay kusii dhowaadaan da'da uu dhiigga caadada uga istaago, iyo waxyaabaha u fududeyn kara.\nXigashada Sawirka, Dr Samiira Amoore\nCaado go'a waa marxalad ay la kulmaan haweenka marka ay da' noqdaan amaba marka dhiigga caadada uu ka istaago, taasoo caadi ahaan dhacda marka ay ku dhow yihiin da'da 51 sano.\nTan ayaa calaamad u ah dhammaadka sanadaha dhalmada iyo billowga weji cusub oo nolosha ah.\nWaxaa marxaladdan ka horreeya sanado uu dhiigga caadadu noqdo mid aan joogto ahayn, waxaana loo yaqaannaa xaaladda ka horreysa caado go'a. Waxay bilaabataa agagaarka da'da 46.\nEnd of Ugu akhris badan\n\"Waa xaalad keeneysa in hooyadu ay caadada iska weydo muddo sanad ah, taasoo sababteeda ay tahay ugxaamaha oo yaraada, oo dheecaannadii jirka lagu soo deyn lahaa oo caadada keeni lahaa ay yaraadaa,\" ayay tiri Dr Samiira Axmed Amoore oo ah dhaqtaradda haweenka iyo qalliimadooda kana howlgasha isbitaalka Rajab Tayib Erdogan oo hore loo oran jiray Digfeer ee magaalada Muqdisho.\nHeerarka hormoonka ayaa isbeddelaya - gaar ahaanna hormoonka oestrogen, kaasoo maamula doorka dhiigga caadada.\nMarka ay haweenku sii gaboobaan, ugxan-side yaasha ayaa soo saara ukumo yar, heerarka hormoonka oestrogen ayaa sabbeeya kadibna si tartiib tartiib ah ayay isku sii dhimaan, tan ayaana horseedeysa calaamadaha caado go'a.\nBalse tan ma dhacdo hal habeen keliya, waxayna marxaladdan qaadataa sanado badan.\nKahor caado go'a waxay haweenku maraan marxalad ka horreysa oo haweeneydu ay ku imaaneyso caado qalqal taasoo bilaabata marka ay gaarto da'da 45 sano.\nDr Samiira ayaa sheegtay in dunidu ku kala duwan tahay da'da ay haweenku caadada uga go'do, laakiin cilmi-baarisyo la sameeyay la isku raacay in haweeneyda ay caadadu ka go'deyso qiyaastii marka ay gaarto da'da 51 sano.\nCaadi ahaan caado go'a waxay ku xiran tahay da'da, laakiin waxaa dhici karta in gabadha ayadoo aan gaari 40 sano ay caadada iska weyso, taasoo loo yaqaanno caado go' soo degdegta, sida ay sheegtay Dr Samiira.\n\"Waxyaabo badan ayaa keeni kara, waxaa ugu badan jirka oo is weerara marka cudurrada qaar ay ku dhaxaan ugxan-sideyaasha, waxaa kale oo keeni kara hiddo-sideyaasha haddii ay wax ka khaldan yihiin amaba cudurka kansarka oo kale oo keeni kara in ugxaanta laga saaro taasoo sababeysa in caadado ay tagto,\" ayay tiri.\nXigashada Sawirka, Getty Images\nCaado go'a - iyo sanadaha ka horreeyaba - haweenku siyaabo kala duwan ayay u saameeyaan.\nMaskaxda, caadada, maqaarka, murqaha iyo dareemayaasha ayaa waxaa dhammaantood saameyn ku yeesha heerarka hormoonka oestrogen ee sii yaraanaya.\nWaxaa jira calaamado badan waxaana laga yaabaa inaad qaarkood ama dhammaanba isku aragto marka aad da'da caado go'a kusii dhowaato, mararka qaarna waxaa laga yaabaa inaadanba arag wax calaamad ah.\nCalaamadaha ugu badan sida ay sheegtay Dr Samiira waxaa ka mid ah:\nHaweenka oo dhan ma isku arkaan calaamadahan - balse badankood waa isku arkaan, qiyaastii 75%.\nXigashada Sawirka, Getty Images\nDr Samiira ayaa sheegtay in wax laga qaban karo calaamadaha, waxaana ka mid ah in haweeneyda loo sameeyo beddelka hormoonka si ay u hesho dheecaannadii jirka uu soo deyn lahaa.\n\"Waxaa sidoo kale haweenka la siiyaa fitamiinno sida calcium iyo fitamiin D, kuwaasoo ka caawiya in lafaha hooyadu aysan jilcin oo si fudud u jabin,\" ayay tiri.\nHaweenka maraya marxaladdan ayaa sidoo kale lagula taliyaa inay cunaan cunno isku dheellitiran, oo ay dufantu ku yar tahay kuna badan yahay fitamiinka calcium si ay lafahooda xoog u yeeshaan.\nInay joogto u jimicsadaan, si uu uga yaraado isku buuqa, murugada iyo dabeecadda oo is beddesha.\nInay joojiyaan sigaar cabidda si looga hortago xanuunnada wadnaha iyo kuleylka daran.\nXigashada Sawirka, Getty Images\nFaham-darro la xiriirta marxaladdan ayaa badanaa keenta in haweeneydu ay qarsato inay caadado ka go'day sida ay sheegtay Dr Samiira Amoore.\n\"Marka ay isku aragto kuleyl badan, gubasho iyo lafaha oo xanuunaya maba ka fekereyso inay caadado ka go'day ee cudurro kale ayay u maleyn kartaa, waxay haweenku ku leeyihiin kolostarool baa i haya amaba lafo-xanuun,\".\nHaweenka qaar ee gaaray da'da caado go'a ee weli rajo ka qaba inay ubad dhalaan ayaa iyagana qariya, sida ay dhaqtaraddu sheegtay.\n\"Hooyooyinka qaar maba tagaan isbitaalka, waxay ka baqaan in la dhoho ugxaantaada ayaa yar oo da'da caado go'a ayaad ku jirtaa markaana ay niyad-jabaan\". Ayay tiri Dr Samiira Amoore.\nDr Samiira ayaa sheegtay in caado go'a aysan ahayn wax ceeb ah balse ay tahay wax si dabiici ah ay u maraan haweenka oo dhan waxayna kula talisay haweenka inaysan qarsan haddii ay gaaraan marxaladda caado go'a oo aysan ka xishoon inay raadsadaan talo caafimaad.", "date": "2025-10-19", "scraped_at": "2025-11-02T08:01:07.600020+00:00", "category": "news", "text_hash": "07b88922c652095194fcf8ff165022208cb65eec84d177753542162f4134df0f", "minhash_signature": "7994644,1386301,1620500,9232815,1598634,931390,9003733,7012614,5451904,4480320,4329132,25870,4101058,7508713,3864424,5721527,49042,10774366,26649860,14081590,6764861,3761457,8476646,4436629,8385926,4479795,9836654,4567514,128896,3421287,1983464,2594346,826334,654154,8591573,4356283,3113150,7413397,5190951,558793,3134139,3035592,5258270,5911017,21387760,2745989,8870317,2392608,5509805,113077,6123570,4266775,2287932,4973788,5055456,17222250,3281943,930709,11212409,6123346,6552810,7311267,19205451,2039078,5817087,73298,8225990,1442424,1474392,4178469,1189398,10722663,6960236,2041172,16625952,2474081,1484351,2613654,9600744,4318814,4291615,9768682,1630121,3407184,697157,2258621,4961978,7541737,2772496,13112448,3872929,11842705,4891690,2779322,4559488,1357565,18734108,3315876,1492760,14482139,3107964,3125424,243738,2364913,8483902,465699,7398957,862773,4227496,1214860,9034799,8887210,5970533,690982,1974360,118322,9236176,471455,1877844,761004,4682619,607030,5563452,3355179,4173615,11020761,2182672,14074168"}
