{
  "url": "https://www.bbc.com/somali/articles/cgkyer30v88o",
  "title": "Ninka ugu da'da weyn adduunka 'Ma jirto sir ka dambaysa cimri dhererka'",
  "text": "Xigashada Sawirka, PA Media\nNinka ugu da’da weyn adduunka ayaa shaaca ka qaaday in aysan jirin “siro gaar ah” oo uu ku soo gaaray cimrigaan xilli uu u dabaaldegayay 112-sano jirkiisa.\nJohn Tinniswood, oo ku dhashay magaalada Liverpool taariikhda marka ay ahayd 26 Agoosto 1912, ayaa u sheegay Guinness World Records in uusan \"wax fikrad ah ka haysan gabi ahaanba\" sababta uu u noolaa muddada intaa la eg.\nNinka ugu cimriga dheer ayaa taageera kooxda kubadda cagta ee Liverpool, waxa uuna ku nool yahay guri dadka lagu daryeelo oo ku yaal Southport.\nNinkaan ayaa noqday qofka ugu da’da weyn adduunka bishii Abriil kadib markii uu geeriyooday Juan Vicente Pérez Mora oo 114 jir ahaa.\nWaxa uu sheegay in uu ahaa nin aad u firfircoon markii uu yaraana uu sameeyn jiray “socod badan”, laakiin waxa uu rumaysnaa in dadka kale uusan “waxba ka duwanayn”, waxa uu intaa ku daray: “Waad noolaan kartaa waqti dheer ama waqti gaaban laakiin waxba kama badali kartid wax kasta oo ku saabsan.\"\nEnd of Ugu akhris badan\nMr Tinniswood, oo dhashay sanadkii uu dagay (quusay) markabkii Titanic, ayaa sheegay uu dib u xasuusanayo noloshiisii hore.\n\"Sababta aan u noolahay muddadaas dheer, wax fikrad ah kama haysto, \" ayuu yiri. \"Ma jirto wax gaar ah oo aan sameeyay ayuu sii raaciyay.\n\"Aad ayaan u firfircoonaa yaraanteydii, socod badan ayaan sameyn jiray. mana garan karo in taasi ku lug leedahay\" ayuu yiri.\n\"Laakiin aniga, ma jirto wax aa dadka uga duwanaa, wax gaar ah ma jirin.\"\nMr Tinniswood waxa uu dhashay 20 sano ka dib markii la aasaasay kooxdii uu ugu jeclaa kubadda cagta ee Liverpool, waxa uuna taageerayay tan iyo inta ay qaadayeen koobabka marka laga reebo laba xilli cayaareed oo ka horeysay dhalashadiisa, waana mar ay ku guuleysteen qaadista laba horyaal oo kala ahaa sanadihii1901 iyo 1906.\nXigashada Sawirka, Family photo\nMarkii uu qarxay dagaalkii koowaad ee adduunka waxa uu jiray laba sano, sidoo kale xilligii uu u dabaal dagayay 27-sano jirkiisa ayuu bilaabmay dagaalkii labaad ee adduunka.\nWaxa uu ka soo shaqeeyay ciidamada gaar ahaan waxa uu door weyn ka qaatay mushaaraadka ciidanka, isku dubaridka iyo saadka, balse waa uu ka badbaaday dagaalkii labaad ee adduunka.\nXaaskiisa ayuu ka bartay goob ku taala magaalada Liverpool, oo lagu cayaaro qoob ka cayaarka, waxa ayna is guursadeen 1942.\nGabadhooda Susan waxa ay dhalatay sanadkii 1943, lamaanaha ayaana ku faraxsanaa noloshooda ka hor inta aysan dhiman xaaska ninkaan 112 jirka ah sanadkii 1986.\nDagaalkii labaad ee adduunka ka dib, waxa uu xisaabiye u ahaa Shell iyo BP ka hor intii aanu ka fadhiisan 1972.\nWaxa uu sheegay in uu cuni jiray kalluunka iyo baradhada oo uu cuni jiray Jimce kasta balse uusan laheyn wax nidaam ah oo u gaar ah.\nXigashada Sawirka, PA Media\n\"Waan cunaa wax kasta oo la ii keeno, waxaana lamid ahay dadka kale, mana jirto wax ii gaar ah\" ayuu yiri.\nTan iyo markii uu gaaray da’da 100-jirka, sanad kasta dhalashadiisa waxa uu kaarka dhalashada ka heli jiray boqortooyada, waxaana kaarkii ugu horeeyay siiyay boqoradda Queen Elizabeth II.\nMar wax laga weydiiyay waxa uu u maleynayo in dunida ay wax badan iska beddeshay tan iyo carruurnimadiisii, waxa uu sheegay in aysan jirin kala duwanaasho ra’yigiisa ah, ama in wax badan ay iska badashay, waxa uu raaciyay in hadda dunidu ka adag tahay tii hore, ama ay adag tahay inay ka fiicnaato sidii ay ahayd waagaas.\n\"Malaha meelaha qaar waa ay jirtaa, laakiin meelaha kale way ka sii daran tahay,\" ayuu raaciyay.\nNinka ugu da'da weyn ayaa ahaa Jiroemon Kimura oo u dhashay Japan, kaas oo gaaray da'da 116-sano iyo 54 maalmood, waxa uuna dhintay sanadkii 2013.\nHaweeneyda adduunka ugu da’da weyn, waa Tomiko Itooka oo 116 jir ah oo u dhalatay Japan.",
  "date": "2024-08-26",
  "scraped_at": "2025-10-29T17:06:29.725999+00:00",
  "category": "news",
  "text_hash": "e2bc0070cc5ed80144262eb6444edc02cfc2263c0eed7f82e201f121929f5b2f",
  "minhash_signature": "20308354,554631,7101421,9955399,1910112,3378140,1294051,25549822,18556113,12059481,3688786,4526452,12390857,17871914,9929052,8878422,2245732,10774366,11705254,7529534,2410935,5992851,51635377,6859998,7643015,7196594,2369043,9670079,3504249,3352076,98639,558384,3046794,1550469,4929674,3805810,16607695,1683887,503779,8391521,27988226,6765098,2340481,3931041,10027915,3696570,5873194,7550635,4496981,9603603,1912406,23775489,5900591,561399,16807929,57663,5197414,7688278,10574916,3895914,23191835,2658378,8217252,5086795,14109085,12146411,7651487,1159877,5928028,9756635,9129124,6599956,1160466,4676195,9483879,1464297,925552,9964018,831702,2487434,14558252,8362873,3154094,5788536,2214729,11130385,7289127,7628062,3505368,14681248,9441091,2142779,2244962,13120419,5292842,14726090,1810808,5316030,2435620,17561845,4525585,2264914,940830,5827161,10980063,16817570,23655680,4979386,5845260,7496959,2299445,5837923,7977364,4295963,11122363,9652985,1094438,2099611,605029,4505261,14649620,5559022,1301767,21481662,1590738,846130,3057923,1377522"
}