{
  "url": "https://www.bbc.com/somali/articles/cr43zq6kp5yo",
  "title": "Jacayl ka bilowday xabsi: Sida nin Muslim ah oo reer Afgaanistaan ah  u guursaday haweeney Yuhuudi ah",
  "text": "Xigashada Sawirka, Sammi Cannold\nMarkii Kabul ay gacanta u gashay Taliban bishii Agoosto 2021, adduunku wuxuu arkay sawirro muujinaya jahawareerka ay dadka Afgaanistaan ku jireen iyagoo ku soo daadanaya garoonka diyaaradaha,  si degdeg ahna u isku dayaya inay baxsadaan.\nWashington D.C., caasimadda Maraykanka, nin hore uga tirsanaa ciidamada badda oo lagu magacaabo Safi Rauf ayaa bilaabay hawl uu isagu gaar u qaaday: inuu caawiyo asxaabtiisii iyo dadka uu la shaqayn jiray ee ku xanniban Afgaanistaan.\nMarnaba ma uusan filayn in intii uu ku jiray hawshaas badbaadinta nolosha uu la kulmi doono jacaylkiisa noloshiisa, isla markaana isagoo Muslim ah uu jeclaan doono haweeney Yuhuudi ah oo diinteeda iyo nolosheedu si weyn uga duwanyihiin tiisa.\n\"Waan yara ka labalabeeyay ka hor inta aan caawin qofkii ugu horreeyay,\" ayuu xasuustaa. \"Laakiin taas ayaa wax walba i beddeshay. Markaas ka dib waxaan caawiyay qof kale, dabadeedna qof kale.\nSi lama filaan ah ayay arrintu isugu beddeshay hawl ballaadhan annagoo caawinayna boqolaal qof oo ku sugan Afgaanistaan iyo tiro badan oo annaga naga mid ah oo Washington joogtaa.\"\nEnd of Ugu akhris badan\nXigashada Sawirka, Sammi Cannold\nSafi, oo ku dhashay xero qaxooti ah una soo haajiray Maraykanka isagoo dhalinyaro ah, ayaa isku arkay dhexda hawl samatabbixin ah oo aad u adag.\nXaaladdaas adag gudaheeda ayuu la kulmay Sammi Cannold  oo ah agaasime masraxeed ka shaqeysa magaalada New York, taasoo si degdeg ah u isku dayaysay in la soo saaro saaxiib qoyskeeda ah oo ku xanniban Kabul.\nXigashada Sawirka, Sammi Cannold\n\"Aniga gebi ahaanba ma aqoon cidna,\" ayay tidhi Sammi. \"Markaas ayaan daawaday barnaamij gaar ah oo telefishin ah oo ka warramaya Safi iyo kooxdiisa. Waxaan u diray farriin qoraal ah anigoo waydiinaya inuu i caawin karo. Wuxuuna iigu jawaabay in waxa ugu habboon ay tahay inaan tago Washington oo aan ku biiro kooxdiisa is xilqaamayaasha ah.\"\nMarkaas ayay buuxsatay boorsooyinkeeda, raacday tareen una safartay magaalada Washington D.C., iyadoo si toos ah u gashay xarunta hawlgalka oo ay ka buuxeen rag badankood ahaa askar hore. \"Anigu waxaan ku noolaa jahawareerka masraxa,\" ayay tiri iyadoo qosleysa. \"Tani waxay ahayd isbeddel weyn oo lama filaan ah.\"\nSammi waxba kama aysan aqoon Afgaanistaan, balse waxay lahayd xirfado mid degdeg ah ka dhigtay qof aan laga maarmi karin.\n\"Waxaan horay ugu baranay shaqooyin la xidhiidha waraaqaha xogta kombiyuutarka iyo isgaadhsiinta,\" ayay tidhi. \"Markaas ayaan noqday sarkaalka isgaadhsiinta ah.\"\nXigashada Sawirka, Safi Rauf\nInkasta oo ay jireen xaalad degdeg ah iyo jahawareer ka jiray xarunta hawlgalka, haddana arrin kale ayaa si tartiib ah u socotay.\n\"Ma jirtay shucuur? Waxaan u maleynayaa in jawaabtu tahay haa,\" ayay tidhi Sammi. Waxay xasuusatay inay fiirisay da'da Safi bog internet ah si ay u ogaato haddii \"uu ku habboon yahay in dookheeda uu yahay.\"\n\"Magaca Safi iyo da'diisa ayaan ka raadiyay Google, sababtoo ah shaqadu way daalisay xilligaas, wuxuuna u ekaa da' weyn marka la barbar dhigo sida uu hadda u egyahay,\" ayay raacisay.\nSocodkoodii dheer ee ugu horreeyay wuxuu dhacay abbaaro saddexdii habeenimo, iyagoo sugaya dadkii laga daadgureynayay inay ka gudbaan barta hubinta ee Taliban. Waxay ku wareegeen taallooyinka magaalada Washington ilaa ay ka gaareen Lincoln Memorial.\nXigashada Sawirka, Getty Images\n\"Waxay u muuqatay sidii filim,\" ayay tidhi Sammi. \"Markaas ayaan bilaabay inaan isweyddiiyo: ma ninkaan baa aan guursan karaa?\"\nMarkii dambe ayay mar kale kulmeen, waxayna halkaas ku wadaageen dhunkashadoodii ugu horreysay, iyagoo taagan hareeraha waddada, hadlaya oo dareemaya isku soo dhowaansho xooggan.\nXigashada Sawirka, Sammi Cannold\nSafi wuxuu yidhii, \"Sammi waxay mar walba igu oran jirtay goormaad i geyneysaa guriga waalidkaa.\"\nLaakiin Safi iyo qoyskiisu waa Muslimiin, halka Sammi ay tahay Yuhuudi. Si kastaba ha ahaatee, jacaylkoodu wuu sii xoogaystay.\nXigashada Sawirka, Andy Henderson\nSi kooban haddaan u dhigo, Safi si dhab ah ayuu jacayl ugu dhacay,\" ayay tidhi Sammi. \"Wuxuuna aad u xiiseeyaa muusigga gaar ahaan qaabka heesaha Les Misérables, oo ah meel aan aniguna aad ugu xeeldheerahay.\"\nXigashada Sawirka, Sammi Cannold\nBishii Diseembar 2021, Safi wuxuu u safray Kabul si uu uga qaybqaato howlaha gargaarka bini'aadantinimo isaga iyo walaalkiis. Inkasta oo loo digay inuusan tagin, Safi wuu ku adkeystay, isagoo sheegay in Amnesty International ay u ballanqaadday inay ka difaaceyso waxyeellada Taliban.\nLaakiin maalintii ay ahayd inay dhammaystiraan hawshaas, Taliban ayaa qabatay Safi, walaalkiis, iyo shan ajnabi oo kale.\n\"Markii hore way na kala saareen, anigana meel gaar ah ayay i geeyeen qol yar oo aan ka badnayn lix lix feet dherer iyo ballacba. Ma jirin daaqad, mana jirin sariir,\" ayuu yiri.\nXigashada Sawirka, Sammi Cannold\nDhanka kale, Sammi waxay ku sugnayd New York iyadoo walaac iyo cabsi ku jirta, mar kasta oo ay fiiriso khariidadda Google si ay u ogaato meesha uu joogo. Markasta oo ay eegto, waxay arki jirtay inuu ku sugan yahay xarunta dhexe ee sirdoonka Taliban.\n\"Si fiican uma aqaan magaalada Kabul, balse waan ogaa inuu ku jiro xaalad aad u xun,\" ayay tidhi.\nKa dib dhowr toddobaad, Safi wuxuu ku guuleystay inuu saaxiibo la noqdo mid ka mid ah waardiyayaasha, isagoo si qarsoodi ah u siin jiray lacag si uu u helo fursado kooban oo uu taleefan ugu waco Sammi.\nXigashada Sawirka, Safi Rauf\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, James Gourley / Getty Images\nQolka yaraa ee lagu hayay ayuu Safi mararka qaar kor ugu fuuli jiray garbaha walaalkiis si uu u helo isgaadhsiinta ulana hadlo Sammi ama ugu diro farriin gaaban oo oranaysa: \"Ma fiican tahay? Waan ku jeclahay.\"\n\"Waxay awoodnay inay is wacno markii ugu horreysay kadib 17 maalmood,\" ayay tidhi Sammi. \"Muuqashada codkiisa iyo xaqiijinta inuu nool yahay waxay ahayd nafis weyn.\nLaakiin weli cabsi weyn ayaa jirtay haddii la ogaado inaan wadahadalnay, waxa dhici lahaa lama hubo.\"\n\"Muddadii 70 maalmood ah ma arag iftiinka qorraxda,\" ayuu yidhi Safi. \"Waxaan ku xirnayn xabsi hoos u yaal dhulka aniga iyo toddobo ajnabi oo kale — ilaa midkood uu si daran u xanuunsaday.\nXigashada Sawirka, Safi Rauf\nXigashada Sawirka, Sammi Cannold\nXigashada Sawirka, Sammi Cannold\nWadahadallada lala galay Taliban waxay qaadatay waqti, laakiin maalintii 70-aad way ogolaadeen inay sii daayaan Safi. Sammi waxay sheegtay in mar ay Taliban ku hanjabeen inay dilaan Safi haddii Mareykanku uusan samayn wixii ay rabaan.\n\"Markaas dambe ayaa naloo sheegay inaan aniga iyo waalidka Safi u safri doonno Qatar maadaama halkaas ay ka socdeen wadaxaajoodyadu.\" Sammi ayaa siisay safar Qatar waxayna halkaas kula kulantay waalidka Safi markii ugu horreysay.\nXigashada Sawirka, Sammi Cannold\nWaxay noloshooda ku sii waddeen Maraykanka, waxay wada degnaayeen guriga isla markaana dabadeedna is guursaday, iyadoo xafladda guurkuna ay isku darsatay dhaqamada Afghanistan iyo Yuhuudda. Martidii xafladda ka soo qayb gashay waxaa ka mid ahaa Afgaan iyo Yuhuudi iyo sidoo kale qaraabo iyo asxaab.\nXigashada Sawirka, Sammi Cannold",
  "date": "2025-10-25",
  "scraped_at": "2025-10-29T17:13:28.694417+00:00",
  "category": "news",
  "text_hash": "c5246ee8b9ce178aafd17baba9a5fbb6b734b68fa4ea1f7dd80224fac89aadf3",
  "minhash_signature": "638255,4101254,6920833,4369161,16283563,247256,3738324,7699687,9183325,5452882,671617,2199975,4514682,1630519,3882951,3265610,293816,4944333,3779146,12318857,241448,1860416,1889509,4436629,4222622,4198466,4860242,8939627,8979708,2222076,1459866,613726,685149,5433044,732938,3108809,1426073,1220546,2772879,536019,2498503,5673898,495068,1453437,352200,3657723,1942562,1790540,6949463,2723702,8371475,3212322,165134,1566301,5888680,3755336,3378639,6711568,3551765,4832158,14907115,523835,23246171,4481602,7475968,10924757,5507912,919376,25091574,28391159,1979039,4859227,798224,8832151,2148399,1155802,5293469,365441,985293,790787,3769,1418664,5884571,2900986,1654717,1289640,58909,1312149,8997239,5880364,8574602,1633072,2177913,1441607,2679830,1307694,527261,4715428,520680,1452042,10885500,8400362,36393,3061024,8412982,26946277,2997385,4392986,3135102,524974,2873140,10568024,3021211,9466704,759821,450510,5646661,3111015,117725,717998,7359590,607030,3626894,9566767,6768113,433084,1539892,2934252"
}