{
  "url": "https://www.bbc.com/somali/articles/cp3dnp3jgdgo",
  "title": "Boqorkii Sacuudiga ee uu dilay wiil uu adeer u yahay 50 sano ka hor",
  "text": "Xigashada Sawirka, C Maher/Daily Express/Hulton Archive/Getty Images\n25-kii March 1975-kii, waxaa caasimadda Riyaad lagu dilay Boqor Sacuudiga Faysal. Waxa toogtay wiil uu adeer u yahay ooku dhex-toogtay gudaha qasriga boqortooyada.\nMarkii rasaasta la ridayay waxaa ag taagnaa wasiirkiisa shidaalka Axmed Zaki Yamani.\nSannadkii 2017, Dr Mai Yamani, oo ah gabadh uu dhalay wasiirkii hore ee Shidaalka scauudiga  ayaa la hadashay BBC.\n\"Weligay ma hilmami doono maalintaas, xanuunkaas jirkeyga ayuu saaqay, wali waan xasuustaa, aabbahay. Bal qiyaas qof bini'aadam ah oo ag taagan lataliyihiisii, sayidkiisii, saaxiibkii, oo xabbad af-saar looga dhigay.\"\nBoqor Faysal ayaa saddex xabbadood oo is xig xiga lagu dhuftay, ka dib markii uu foorarsaday si uu u dhunkado gacanta wiil uu adeer u yahay oo salaamay.\nEnd of Ugu akhris badan\nAabaha Dr Yamani oo muddo15 sano ah ahaa wasiirka daacadda u ah Boqor Faysal ayaa warbixin siinayey boqorka, waana sababta uu dhinaciisa ugu u taagnaa.\nBoqor Faysal oo ahaa boqorkii saddexaad ee boqortooyada sacuudiga  ee qaniga ku ah shidaalka , waxa uuna ahaa wiil saddexaad.\nMarkii la toogtay boqorka waxaa  loola cararay Isbitaal, balse wax yar ka dib wuu dhintay.\nXigashada Sawirka, Claude Salhani/Sygma/Getty Images\nDhowr mayl meel magalada u jirta maalintaas, Mai Yamani oo 18 jir ah ayaa ku sugaysay aabaheed.\n\"Waxaan fadhiyay gurigii aabbahay oo ay ku wareegsan yihiin buugaagtiisa. Wuu soo galay, isaga oo ay ka muuqato wajigiisa xanuun iyo murugo iyo a xanuun badan. Wuxuu si toos ah ugu gudbay qolka cuntada oo waxaa uuna dhawaaqay afka labadiisa isaga hal kelmad oo ahayd - 'Balaayo'.\"\nKani ma ahayn ninkii ana naqaana oo ahaa  nin ku caan baxay degenaan iyo aamusanaan, ka dibna wuxuu u sheegay inantiisii ​​wixii dhacay.\n\"Waxa ahayd10-kii subaxnimo wefti Kuwait ah oo arrimaha shidaalka ah ayaa joogay, waxayna doonayeen inay la kulmaan boqor Faysal oo jooga qasriga, aabbahay oo ahaa wasiirka shidaalka ayaa u soo galay inuu boqorka warbixin siiyo,\" ayay tiri.\n\"Amiirkaas oo ahaa mid la yaab leh oo ay isku magac yihiin, Faysal [Ibu Musaed] oo boqorku adeer u yahay, ayaa weftiga ku dhex milmay wasiirkii shidaalka ee Kuwait, ka dibna wuu i isku duubay wiilka uu adeerka u yahay si uu u salaamo.\n\"Wiilkii adeerka uu u ahaa ayaa bistoolad yar jeebka kala soo baxay oo ku toogtay boqorka, saddex xabbadoodna madaxa ayuu kaga dhuftay, aabbahayna meel aad ugu dhow ayuu taagan yahay.\"\nSida ay sheegayaan wararka qaar wakhtigaas, gacankudhiiglaha ayaa sida muuqata u sheegay booliiska in Yamani uu u taagan yahay meel aad ugu dhow uuna u maleeyay inuu isagana uu dili doono.\nYamani waxa uu isbitaalka u qaaday boqor Faysal, halkaas oo la  xaqiijiyay geerida boqorka.\n\"Intaas ka dib, wax walba waa ay aamuseen, waddooyinka Riyadh waxay ahaayeen kuwo faaruq ah, [waxaa jiray] aamusnaan.\"\nFaysal waxa uu boqor ka noqday Sucuudiga sannadkii 1964-tii, isaga oo xukumayay \" Saxare le'eg Galbeedka Yurub \", waxaana Ingiriisku uu ku ammaanay inuu yahay\"saaxiibka cusub ee Carbeed\", shaqadiisa waxay ahayd \"inuu casriyeeyo mid ka mid ah dalalka ugu dib-u-dhacsan Bariga Dhexe\", sida uu weriyaha BBC-da David Dimbleby u sheegay xilligaas - laakiin ma sameyn karaa isaga oo aan lumin kursigiisa?\nMid ka mid ah wiilasha gaar ahaan curadka Cabdulcasiis Al Sacuud, Faysal waxa uu u halgamay ololihii aabbihii ee ahaa in la mideeyo jasiiradda Carabta taas oo horseedday in la aasaaso boqortooyada magaceedu yahay Sucuudiga, 30 sano ka hor xilligaasi.\nCabdulcasiis Al Sacuud, Faysal markii dambe waxa uu ra'iisal wasaare ka noqday walaalkii ka weyn oo boqor noqday markii aabbahood dhintay.\nMarkii uu Faysal laftiisu boqor noqday, waxa uu caan ku ahaa siyaasi caqli badan, cibaado badan, hawlkar ah iyo isbedel-doon, waxa uu ahaa nin ka hawlgeli jiray caasimadaha dibadda ee adduunka oo dhan.\nWaxa kale oo loo arkayey in uu yahay masuul doonaya in uu u isticmaalo shidaalka cusub ee la helay si uu u Sacuudiga uga hirgaliyo dawladnimada casriga ah, waxbarashada, caafimaadka iyo nidaamka garsoorka dalka Sucuudiga uu sibadal ku sameeyo.\nLaakiin dib-u-habaynta boqor Faysal ayaan mar walba ka farxin dadka muxaafidka ah ee ku jira mad-habta adag ee Islaamka ee qoyskiisu ay isbahaystaan.\nMarkii bartamihii 60-aadkii uu Faysal furay telefishinkii ugu horreeyay ee Sacuudi Carabiya, ayaa weerar hubeysan lagu qaaday dhismaha, kaasoo uu hoggaaminayay wiil wlaal la ahaa  ninkii markii dambe dilay.\nBoqor Faysal waxa uu sidoo kale hirgaliyay waxbarashada gabdhaha.\nDr Yamani ayaa yiri: \"Boqoradda Iffat [xaaskiisa labaad] waxa ay waxbarashada gabdhaha ka bilowday boqortooyada Sacuudiga.\n\"Aad baan ugu hanweynahay inaan ka mid ahaa 9-kii hablood ee ugu horeeyay ee wax ka barata dugsigeedii, boqor Faysal waxa uu ku qanciyay hay'adaha diinta in aad haweenka wax barataan oo ay noqdaan hooyooyin wanaagsan, waxaana la oran jiray Daar Al Xanan oo ah dugsigii jilicsanaanta.\nXigashada Sawirka, Bettmann Archive/Getty Images\nYamani waxa uu bilaabay in uu u shaqeeyo boqor Faysal 1960. Tani waxay ahayd mid aan caadi ahayn maadaama uu ahaa nin aqoon sare iyo qareen, balse aan ka tirsanayn qoyska boqortooyada Sucuudiga.\nBoqor Faysal ayaa akhriyey maqaallo uu qoray kuwaas oo indhihiisu qabteen oo soo jiitay.\n\"Aabahay waxa uu furay xafiiskii ugu horeeyay ee sharciga ka dibna waxa uu bilaabay in uu qoro maqaaladii ugu kicinta badnaa ee uu ku dalbanayo dimoqraadiyad iyo dawlad wanaag, waxa u saxeexay qof la yidhaahdo Abu Mai, oo ah aabbe gabadh la yidhaahdo Mai, sababtoo ah anigu waxa aan ahaa curadkiisii, markaa Faysal oo markaas boqorka ahaa ayaa yiri waa ayo ninkani? Sababtoo ah wuxuu raadinayey lataliye sharci.\"\nBoqor Faysal waxa uu markii dambe Axmed Zaki, ama Sheekh Yamani sidii uu ku caan baxay ka dhigay wasiirka shidaalka.\nWaxa ay si wada jir ah boqorka iyo dadkii la shaqeynayay ​​u dejiyeen siyaasad ay markii ugu horreysay si buuxda u siisay Sucuudigu in uu si buuxda u maamulo hantida faraha badan ee uu ku helay shidaalka, kana dhigo mid awood u leh oo lagula xisaabtamo dunida Carabta iyo caalamkaba.\nSannadkii 1973-dii, ka dib dagaalkii u dhexeeyay Israa'iil iyo dalalka Carabta ee ay deriska yihiin, Sucuudigu, oo hadda ah dalka ugu badan ee soo saara shidaalka  adduunka, ayaa horseeday ololihii shidaalka loogu adeegsaday markii ugu horreysay  sida hub siyaasadeed oo kale.\nShidaalka la geeyo wadamada taageera Israel waa la dhimay, taasoo oo ka dhigtay qiimaha Shidaalka mid sareeya  adduunka. Waxaa uu ahaa Sheekh Yamani qofka loo soo dhiibay oo baahiyay.\n\"Waxa aan rabno waa ka bixitaanka ciidamada Israa'iil gebi ahaanba dhulka Carabta ee la haysto. Ka dibna waxaad heli doontaa shidaalka heer la mid ah, wxaa uu halkaas jeediyay Sebtembar 1973.\"\nWaxa uu qiray in kororka baaxadda leh ee ku yimid qiimaha shidaalka ay ka dhigan tahay isbeddel ku yimaada isu-dheelitirka awoodda adduunka ee u dhexeeya waddamada soo koraya, kuwa wax soo saara iyo waddamada horumaray ee warshadaha leh.\nIsbeddelkaas ku yimid miisaanka awoodda waxa la aqoonsaday markii, 1974-kii (sanad ka hor intaan la dilin), Boqor Faysal wxaa loo aqoonsaday ninka sannadka ugu saameynta badan ee majaladda Time.\nDr Yamani ayaa tiri: \"Ma garanayno sababta dhabta ah ee loo dilay boqorka, marka laga reebo in gacan ku dhiiglaha uu ahaa nin dhibsaday, aniga oo 18 jir ah xilligaas, waxaan dareemay xanuunka aabbahay, weli waan xasuustaa.\"\nSheikh Yamani ayaa 11 sano oo kale ahaa wasiirka shidaalka ee Sucuudiga, ilaa 1986-dii.\nDr Yamani waxa ay u sii gudubtay jaamacad ku taalla dalka Maraykanka, waxayna noqotay haweenaydii ugu horreysay ee ka soo jeedda Sucuudiga ee PhD ka qaadata Oxford.\nWaxay qortay buugaag badan oo ku saabsan aqoonsiga Carabta waxayna sidoo kale la taliye u noqotay bangiyada sida Goldman Sachs iyo shirkadaha shidaalka sida Shell.",
  "date": "2025-10-17",
  "scraped_at": "2025-10-29T17:29:29.671247+00:00",
  "category": "news",
  "text_hash": "7d845258f39e19facb610bc63406b38980d552a3025752c45b3c366b5dbb8402",
  "minhash_signature": "3273954,326403,427176,13411730,758347,1610317,876964,2930933,4266885,1087221,435048,702095,306341,318763,9000988,157413,7931555,5388887,3527905,303314,5440322,4250698,737103,5430019,3412188,3327435,3566180,3575606,1094060,3115697,5992410,9047085,38984,2011482,1882829,5122444,634355,7269220,4905659,6950974,805258,276833,46621,2957978,4970266,1386249,9862535,282330,3123243,3525984,2175283,3326261,2715671,2958550,761523,756850,4945686,391765,1718492,170734,8523986,1895227,2628939,2736766,3183686,2525003,2493089,657010,2131651,576338,827239,9301586,5267856,872345,2956709,206006,1627527,13692141,1739408,2708673,4127004,441541,1336348,4088799,1595163,6899998,1007441,2084049,2329198,7615159,1294765,5477997,799145,2879173,659758,356890,1412156,2022488,1118325,3349502,5913569,2599733,3927538,5093839,797460,5304025,14909764,9087071,7564552,4396102,1497776,1192921,2041391,13316183,1413606,2708734,2407718,3311558,1917737,3222704,192050,3453828,5968211,6403121,3698090,317105,2095137,1190519"
}