{
  "url": "https://www.bbc.com/somali/articles/cp8e15m94mgo",
  "title": "Muhiimad intee le'eg ayey u leedahay Somaliland isku xirka dekedaha Berbera iyo Jebel Cali",
  "text": "Xigashada Sawirka, Getty Images\nShirkadda dekedaha caalamiga ee Dubai ee magaceeda loo soo gaabiyo DP World ayaa daahfurtay istaraatiijiyad cusub oo ah marinka maraakiibta ee isku xiraya dekedda Jebel Cali ee Imaaraatka Carabta iyo Dekedda Berbera ee Somaliland.\nAdeegga cusub ayaa shaqaynaya sagaal maalin oo kasta, waxaana sida shirkaddu sheegtay uu kor u qaadayaa Isku xirka  caalamiga ee shaqada DP World, waxaana uu xoojinaya booska ay Berbera ka taagan tahay marin biyoodka badeed oo noqonaya albaab iyo xarun loo soo maro Bariga Afrika.\nSomaliland ayaa dhankeeda ku tilmaamtay Khadka dhanka Maraabiibta ee sida tooska isugu xiraya dekedaha Jabal cali iyo Berbera inay tahay talaabo meesha ka saaraysa caqabadihii laga kala kulmi jiray badeecadaha iyo alaabooyinka gaaraya dekedda berbera .\nMaareeyaha dekedaha Somaliland Cali Diiriye Axmed ayaa uga waramay BBC sida uu khadkani ku yimid iyo waxyaabaha uu kusoo kordhinayo Dekedda Berbera oo uu sheegay inay samaynaysay horumar muddooyinkii u dambeeyay.\n''Dekedda Berbera in muddo ahba waxaa ka socday horumar maalinba meel gaarayay oo isa soo tarayay. Khadkan maraakiibta ee cusub ee u kala gooshaya ama isku xiraya dekedda Berbera Jebel Cali, waxa uu qayb ka yahay koriinka ay dekeddu samaynaysay, arrintaasi ayaana sabab u ah shirkadaha faraha badan ee gaadiidka ka shaqeeya badda ay la socdaan horumarka. Waana gaadiid cusub oo inoo soo kordhay oo dekedda aan horay u imaan jirin, si toos ahna uga dhex shaqaynaya labada dekedood.\nEnd of Ugu akhris badan\nQorshaha isku xirka labada dekedood ayaa sida uu maareeyuhu sheegay ay ka wada shaqeeyeen shirkada DP World ''Qorshahani waxa uu ku yimid oo iska kaashaday oo in muddo ahna ka wada shaqaynayay hay'adda maamulka dekeddaha Somaliland iyo shirkada DP World oo inta badan masuuliyadoodu tahay inay si dhow uga wada socdaan fudaydinta ganacsiyada iyo isweydaarsiga dekedda ka dhacaya ee wixii culays ah ee jira meesha looga saari lahaa ama loo fudaydin lahaa ka shaqeeya. Marka daraasado iyo cilmi baaris aan samaynay ayaan ku ogaanay inay daruuri tahay in la yareeyo shixnadaha dekeddeena ku socda oo dekedo badan soo mari jiray'' ayuu yiri.\nXigashada Sawirka, Government of Dubai Media Office\nMaareeyaha dekedaha Somaliland ayaa sheegay in alaabaha laga soo qaado Dubai ay soo mari jireen dhowr dekedood oo ay kamid yihiin Jeddah iyo Jabuuti, muddo dheer dabadeedna ay gaari jireen Berbera. ''Si aan arrintaasi meesha uga saarno waxaanu samaynay in aanu abuurno oo aan aasaasno isku xir toos ah oo inta ay toos uga yimaadaan dekedda Jebel Cali u yimaadaan Berbera''.\nKhadkan tooska ee isku xiraya labada dekedood ayaa leh faa'iido badan sida uu aaminsan yahay maareeye Cali Diiriye.\n''Arrintani faa'iidooyin badan ayay yeelanaysaa runtii, waa marka koowaade alaabihii ama shixnadihii daahi jiray ee dekedaha faraha badan marka ay soo maraan ku dambayn jiray dekeddeena, horta degdeg ayay u imaanayaan oo wakhtigii wuu yaraanayaa, wakhtigii aad buu u soo yaraanayaa, boqolkiiba 60 ayaan wakhtiga yaraynay, waxa kale oo ay inoo kordhinaysaa in dekeddu ay kor u kacdo, waxa kale oo imaanaya in ganacsato kale oo meelo kale mari jiray oo alaabahooda kala soo dagi jiray ay soo noqdaan oo ay dekeddii isticmaalaan, waxa kale oo aynu ka faa'iideynaa in dhaqaalaha dalka iyo wadamada jaarka ee aan dekeddaha lahayn sida Itoobiya oo kale uu kobac fiican ka helo, kana faa'iideystaan fursadaha.\nShirkada DP World ayaa heshiiska maamulka dekedda Berbera ku saxiixday heshiis bishii Maajo 2016, waxaana ay si rasmi ah maamulka dekedda ula wareegtay sannadkii 2017. Heshiiska ayaa dhigayay muddo 30 sano ah oo maamulidda dekedda. Saamiga shirkadda ayaa ahaa 65% ay qaadanayso halka Somaliland ay lahaanayso  35%. Sannadkii 2018 Itoobiya ayaa ku biirtay qayb ka lahaanshaha saamiga Dekedda oo ay heshay 19%, taasi oo ka dhigtay saamiga hadda ee DP World 51 boqolkiiba.\nDaraasad uu sameeyay Bangiga Adduunka sanadkii 2022 ayaa dekedda Berbera ay ka gashay kaalinta 144 xagga maamulka dekedaha caalamka.",
  "date": "2025-10-17",
  "scraped_at": "2025-10-29T17:04:28.329305+00:00",
  "category": "news",
  "text_hash": "105fa3e328a41205aee35b4075f5774251b9c7ec79d3092a7ca478c378ba84cd",
  "minhash_signature": "9427475,298232,22010378,3817217,5772667,2042482,1304980,3539336,12261727,921944,9040234,5511786,407343,2344137,50199,6523054,26485586,5027315,9804829,6735730,4150525,4893798,4500555,2763048,26135879,11582237,1871991,1840941,30693538,13337208,6664123,943003,706323,6889537,460526,477651,5140796,6535664,9459607,1142270,1458724,1172851,16043586,245173,8189390,8310551,9218893,10821,3246563,5438786,4151894,3068901,18757490,4484791,696961,18936315,12634778,3326531,23629077,15494552,350326,10647633,15981442,9525020,1372069,8910152,9953014,8414746,5912268,8734571,12862652,2147748,217895,2621949,28054381,23531567,2994126,5935350,6347135,81119,221039,1152336,9127258,1447790,735604,7423067,453480,5956025,3598552,17073727,425330,8570332,10592367,1255589,3131750,7568618,2206680,6582396,5160377,2281373,8465478,6782332,14235054,7643189,15407363,5278327,4146480,12359870,5419083,1713101,5197106,4621555,4178238,17551708,8340864,14722159,8758625,1885911,8406162,578222,32154432,5281629,4430273,1294284,10841711,7160400,14040451,1530156"
}