{
  "url": "https://www.bbc.com/somali/articles/cvgnzed386ko",
  "title": "Saynisyahanno markii ugu horreysay uur-jiif ka sameeyay hiddo-side laga qaaday maqaarka bini'aadamka",
  "text": "Xigashada Sawirka, OHSU/Christine Torres Hicks\nSaynisyahannada Mareykanka ayaa markii ugu horreysay sameeyay ugxan-bani'aadam marxalado hore ku jira, iyaga oo wax ka beddelay DNA laga soo qaaday unugyada maqaarka bini'aadamka, kaddibna ku bacramiyay shahwo.\nFarsamadan waxay ka caawin kartaa dadka aan uur qaadi karin cudur ama gaboobid darteed, iyada oo suuragal ka dhigaysa in unug kasta oo jirka ka mid ah ay noqon karayso halka laga bilaabo abuurka nolosha.\nHabkan weli wuxuu u baahan yahay horumarin weyn  taasoo qaadan karta illaa toban sano  ka hor inta aan rugaha taranka ayna ka go'aan gaadhin isticmaalkeeda.\nKhubarradu waxay sheegeen in tani ay tahay horumar weyn, balse ay lama huraan tahay in si furan bulshada loola yeesho dood ku saabsan waxa saynisku suurtagal ka dhigay.\nIlmo-dhalista horey waxay u ahayd sheeko fudud: shahwada ninka ayaa la kulanta ugxanta haweeneyda. Labadooda ayaa isu darsama si ay u sameeyaan ugxan-bani'aadam, sagaal bilood kadibna ilmo ayaa dhasha.\nEnd of Ugu akhris badan\nHadda saynisyahannadu waxay beddelayaan xeerarkii. Tijaabadan ugu dambeysay waxay ka bilaabataa maqaarka bini'aadamka.\nHabka ay adeegsadeen kooxda cilmi-baadhista ee Jaamacadda Oregon Health and Science wuxuu ka qaadaa unug maqaarka dhexdiisa, gaar ahaan qaybta unugga loo yaqaan \"nucleas\" taasoo sidata dhammaan koodhka hidde-sideyaasha jirka lagu dhiso.\nNucleas-kaas ayaa lagu dhex ridaa ugxan laga qaaday qof deeq bixiye ah, taasoo laga saaray dhammaan tilmaamaha hidde-sideedkeeda.\nIlaa hadda, farsamadan waxay la mid tahay tii loo adeegsaday samayntii Dolly [Dolly waxay ahayd laxdii ugu horreesay ee lagu sameeyo tijaabo nuqul lagu abuuro xoolo waaweyn, iyadoo la adeegsanayo unug jirka ah oo laga qaaday wan kale oo weyn]  taasoo dhashay sanadkii 1996.\nXigashada Sawirka, OHSU\nSi kastaba ha ahaatee, ugxantan diyaar uma aha in lagu bacrimiyo shahwo, maaddaama ay horay u sidato dhammaan tirada buuxda ee kromosoomyada.\nBani'aadamku wuxuu ka dhaxlaa 23 xirmo oo DNA ah mid kasta oo waalidiintiisa ah, taasoo isu geynaysa 46 kuwaasoo ugxanta horay u sidato.\nMarka xiga, waxa la sameeyaa waa in la qanciyo ugxanta inay iska tuurto kala bar kromosoomyadeeda, iyadoo loo marayo hannaan ay cilmi-baarayaashu ugu yeereen \"mitomeiosis\" eray ka kooban laba hab oo unugyadu u kala qaybsamaan: mitosis iyo meiosis.\nDaraasaddan oo lagu daabacay joornaalka Nature Communications, ayaa muujisay 82 ugxan oo shaqaynaysa. Kuwaas waxaa lagu bacrimiyey shahwada qaarna waxay u gudbeen marxaladaha hore ee koritaanka uurjiifka. Midna lama horumarin wixii ka baxsan marxaladda lixda maalmood ah.\n\"Waxaan gaarnay wax loo maleynayay inaysan macquul ahayn,\" ayuu yidhi Prof Shoukhrat Mitalipov, oo ah maamulaha Jaamacadda Caafimaadka iyo Sayniska ee xarunta daaweynta unugyada uurjiifka iyo hidde-sidaha.\nFarsamadan weli si buuxda looma hagaajin, maadaama ugxantu si aan kala sooc lahayn u doorato kromosoomyada ay iska tuurayso.\nWaxaa muhiim ah in ay dhammaadka haysato hal nuqul oo kasta oo ka mid ah 23-ka nooc ee kromosoomyada si looga hortago cudurro, balse mararka qaar waxay haysataa labo nuqul oo noocyo ah, halka qaarna aysanba haysan.\nSidoo kale, heerka guusha ayaa aad u hooseeya (qiyaastii 9%), kromosoomyaduna waxay seegaan hannaan muhiim ah oo ah inay is-bedbeddelaan (Hido-sideyaashu kala wareegaan), taas oo la yiraahdo crossing over.\nProf. Mitalipov, oo ah khabiir caan ah oo hormuud u ah cilmi-baadhistan, ayaa ii sheegay:\n\"Waa in aan farsamadan hormarinnaa illaa ay ka noqoto mid dhammeystiran.\nUgu dambeyn, waxaan aaminsanahay in mustaqbalku halkaas u socdo, sababtoo ah dadka aan ilmo dhali karin way sii badanayaan.\"\nXigashada Sawirka, OHSU/Christine Torres Hicks\nTiknoolajiyaddan waxay qayb ka tahay meel cilmi-baadhis cusub oo sii fidaysa, taas oo ujeeddadeedu tahay in shahwo iyo ugxan lagu sameeyo bannaanka jirka bini'aadamka, taas oo loo yaqaan in vitro gametogenesis.\nHabkani weli wuxuu ku jiraa heerka cilmi-baadhista sayniska, lama gaarsiin isticmaal caafimaad, balse himiladu waa in lagu caawiyo lammaaneyaasha aan ka faa'iidaysan karin IVF (bacriminta dibedda jirka) sababtoo ah ma haystaan shahwo ama ugxan ay isticmaalaan.\nWaxa uu gacan ka geysan karaa caawinta dumarka waayeelka ah ee aan lahayn ugxan shaqaynaysa, ragga aan soo saarin shahwo ku filan, ama dadka ay daaweynta kansarku u sababtay bacrami la'aan.\nCilmigani sidoo kale wuxuu beddelayaa xeerarkii hore ee waalidnimada. Farsamada maanta laga hadlayo looma baahna in unug maqaarka laga qaado haweeney  waxaa sidoo kale laga qaadi karaa nin.\nProf. Paula Amato, oo ka tirsan Jaamacadda Oregon Health and Science, waxay tiri:\n\"Marka laga soo tago rajo u abuurista malaayiin qof oo aan ilmo dhalin karin sababo la xiriira shahwo ama ugxan la'aan, habkan wuxuu sidoo kale suurtagal ka dhigi karaa in lammaanayaasha isku jinsi ah ay helaan ilmo hiddo ahaan labadooda la xidhiidha.\"\nProf. Roger Sturmey, oo ah bare ka tirsan Jaamacadda Hull kuna takhasusay daawada taranka, wuxuu sheegay in sayniskani yahay \"mid muhiim ah\" isla markaana \"laga gaadhay horumar weyn.\"\nWuxuu intaas ku daray:\n\"Isla mar ahaantaas, cilmi-baadhis noocan ah waxay muujinaysaa muhiimadda ay leedahay in si furan [aad] bulshadu ugala hadasho horumarka cusub ee cilmi-baadhista taranka.\nHorumarka noocan ah wuxuu inoo sheegayaa in loo baahan yahay sharci adag iyo maarayn hufan, si loo hubiyo isla xisaabtanka loona dhiso kalsooni dadweyne.\"\nProf. Richard Anderson, ku xigeenka agaasimaha Xarunta MRC ee caafimaadka taranka ee Jaamacadda Edinburgh, ayaa isna yiri:\n\"Kartida lagu abuurayo ugxan cusub waxay noqon lahayd horumar weyn.\"\nWuxuu intaas ku daray:\n\"Waxaa jiri doona walaacyo badan oo xagga ammaanka ah (safety concerns), laakiin daraasaddan waa tallaabo loo qaaday dhanka caawinta haween badan si ay u helaan carruur hiddo ahaan iyaga la xiriira.\"",
  "date": "2025-10-01",
  "scraped_at": "2025-10-29T17:02:28.230273+00:00",
  "category": "news",
  "text_hash": "4ba09d2072c91b05f4ef5a31e7bd8e601513c7d431527e224c98c8d1cd56cc0b",
  "minhash_signature": "673498,1143887,9531831,7884599,8776876,2607901,5062882,3623519,1517767,10209077,8277106,7768248,2918944,13643058,2072890,3185765,9818521,3630222,3779146,5982630,7346500,11058203,1363551,147494,5113,1101544,6056618,1264297,22519055,1070922,6750828,47883,5386332,1513678,8533952,8145340,5555485,1699790,15301069,1186237,8665411,591763,631753,1833494,18916221,14700902,6347595,5330083,6249486,10124534,2385,870315,12974394,201464,4111942,4540522,32448977,5079713,705560,7883939,4295613,1802985,1180767,1526783,10675192,7027693,2257858,797003,2451961,2363592,2599769,8108001,1583419,955039,6601254,627882,1181349,1909876,2316608,10828324,486827,6290931,7313756,7755963,2606860,9257478,2235962,15579511,6601458,869246,1510018,38105,10461704,4619912,692792,3076513,4723736,18017328,1492760,506065,4222108,13967292,2738257,1258535,519690,271114,5352172,5224541,3823240,4558138,1316527,5206810,613375,27457262,22084643,2943192,13161517,1213160,4158217,15379117,700639,7156830,5289675,2130433,791337,1435870,8876819,4079318"
}