{
  "url": "https://www.bbc.com/somali/articles/cm27k0y8zlgo?at_medium=RSS&at_campaign=rss",
  "title": "Waa kumaa madaxwaynaha Muslimka ah ee Trump ka caawiyay heshiis muhiim ah?",
  "text": "Xigashada Sawirka, Getty Images\n\"Anigu xabsiga ayaan ku jiray laakiin waxaad ku dhawaatay inaad halkaas gaarto\" ayuu Ra'iisal wasaaraha Malaysia Anwar Ibrahim kula kaftamay madaxweynaha Maraykanka Donald Trump markii ay kulmeen.\nWuxuu ahaa kaftan diciif ah - mid uu si degdeg ah uga gudbay marka loo eego dabeecadda Trump ee ku yartahay maaweelada- laakiin sidoo kale waxaa la oran karaa waa hadal ka soo yeeray siyaasi  ruug-caddaa ah.\nWaxa uu hadda heshiis la saxeexday Trump si uu hoos ugu dhigo cansuuraha wax-soo-saarka Malaysia ee Maraykanka lagana dhigo 24% ilaa 19%. In kasta oo tafaasiil badan oo kale aan la bixin, hubanti kasta oo ah in canshuuraha aan kor loo qaadi doonin waa la soo dhaweynayaa iyadoo ay jirto dhammaan hubanti la'aanta arrintaa ku xeeran.\nLaakiin tan ugu muhiimsan guud ahaan, Anwar ayaa xaqiijiyay ka qaybgalka Trump ee shir madaxeedka gobolka kaas oo si isdaba joog ah su'aalo loo waydiiyay.\nMadaxweynaha Mareykanka ayaa ku sugnaa kulanka Ururka wadamada koonfur bari Eeshiya , ama loo soo gaabiyo Asean, ee ka dhacay Kuala Lumpur si uu goob-joog uga noqdo \"heshiiska nabada\" ee aadka loo wada sugayay ee u dhaxeeya Thailand iyo Cambodia, kaas oo Anwar abaabulay.\nEnd of Ugu akhris badan\nWaxa uu sidoo kale dhexdhexaadiyay xabad joojinta jilicsan ee udhaxeysa Thailand iyo Cambodia ka dib isku dhacyo lagu hoobtay oo xuduuda ka dhacay horaantii sanadkan .\nWaxaa uu heshiiska sidoo kale ku soo beegmay ka dib markii Trump ku hanjabay inuu canshuuro ku soo rogayo labada dhinac haddii dagaalku aysan joojin.\nQaar ka mid ah dadka wax falanqeeya ayaa ku tilmaamay guul diblumaasiyadeed oo u soo hoyatay Malaysia, halka qaar kalena ay sheegeen in Anwar uu si sahlan ku gaaray goobta saxda ah ee waqtiga saxda ah - sanadkan, waxa uu ahaa ra'iisul wasaaraha Malaysia islamarkana ah hogaamiyaha ururka wadamada koonfur bari Eeshiya.\nLaakiin Anwar waxa uu ku doodi karaa in uu sugay fursadan muudo 25 sano oo waqtigiisa ka mid ah – wxaa uuna soo maray wakhti qalafsan, xilligaas oo laba jeer la xiray.\nXigashada Sawirka, Getty Images\nAnwar ayaa markii ugu horeysay isku tilmaamay hogaamiye arday ah oo soo jiidasho leh oo aasaasay dhaqdhaqaaqa dhalinyarada Islaamka ee Malaysia, ABIM.\nSannadkii 1982-kii, waxa uu ku biiray xisbigii muddada dheer xukumayay ee United Malays National Organisation (UMNO), taas oo dad badan ka yaabisay iyaga oo ka filayey in uu ka fogaan doono kooxda xukunka haysa.\nLaakin waxay caddaysay dhaqdhaqaaq siyaasadeed oo caan ah - wuxuu si degdeg ah u fuulay jaranjarada awoodda wuxuuna qabtay jagooyin wasaaradeed oo badan.\nSannadkii 1993-dii, waxa uu noqday ku xigeenka ra'iisal wasaarihii xilligaas Mahathir Mohamad, waxaana si weyn loogu arkayey dhaxal sugaha. Taasi waxay ahayd ilaa ay isku khilaafeen maaraynta dhibaatada dhaqaale ee Aasiya 1997, taas oo aad u saamaysay Malaysia.\nAnwar ayaa shaqada laga ceyriyay sanadkkii xigay, ka dibna waxaa lagu xiray kiisas la xiriira musuqmaasuq iyo in uu caruur fara-xumeeyay – eedeymahaa oo uu ilaa maanta diidan yahay, isagoo ku dooday inay qeyb ka ahaayeen olole sumcad dil ah oo lagu doonayay in xilka looga xayuubiyo.\nSannadkii 2004tii, sanad ka dib markii Mahathir uu xilka ka degay, maxkamadda sare ee Malaysia ayaa laashay xukunkii ahaa inuu faraxumeyn sameeyay waxayna sii daysay Anwar. Waxa uu u soo baxay isaga oo ah hoggaamiye mucaarad xoog leh, isaga oo u horseeday guushii abid ugu xoogganayd doorashadii 2013-kii.\nWax ka yar hal sano ka dib, isaga oo isu diyaarinaya inuu ka qeyb galo doorasho, waxaa lagu soo oogay dacwado cusub oo ah in uu sameeyay galmo isku jinsia ah , isaga oo dib loogu celiyay xabsiga.\nKadib 2016-kii, dhacdo naxdin leh, Mahathir waxa uu ka soo laabtay hawlgabnimadii si uu ugu tartamo jagada ugu sareysa, iyadoo hogaamiyihii xilligaas Najib Razak uu wajahay eedeymo musuqmaasuq.\nXigashada Sawirka, Getty Images\nMahathir oo markaas 92 jir ahaa ayaa heshiis aan la filaynin la galay Anwar oo weli xiran, isagoo ballan qaaday inuu sii dayn doono Anwar haddii la doorto, ugu dambayntiina uu ku wareejin doono xilka Ra'iisul Wasaaraha. Isbahaysigoodu wuxuu dhaliyay guul taariikhi ah 2018, laakiin isbahaysigu ayaa isbadalay oo awoodda laguma wareejin.\nDoorashadii 2022, isbaheysiga Anwar ayaa ku guuleystay kuraastii ugu badnaa, laakiin weli way ka yaraadeen tirada loo baahan yahay si loo dhiso dowlad.Maalmo is-mari waa ka dib, boqorku wuxuu u magacaabay rai'sul wasaare.\nDadka qaar waxay moodayeen in muddo-xileedkiisu uu gaaban yahay. Laakiin ku dhawaad ​​​​saddex sano kadib, 78-jirka ayaa horey u sii hayay shaqada in ka badan seddexdii qof ee ka horreeyay.\nGuusha ugu weyn ee Anwar ayaa laga yaabaa in ay tahay xasiloonida siyaasadeed ee uu u muuqdo in uu ka keenay waddan soo maray saddex ra'iisal wasaare intii u dhaxaysay 2020 ilaa 2021.\n\"Malaysia maalmahan waxaa mararka qaarkood loo arkaa inay ka mid tahay kuwa ugu xasiloon Koonfurta Bari ee Eeshiya, taasoo sidoo kale ka dhigtay mid soo jiidata maalgashadayaasha,\" ayay tiri Syaza Shukri, oo ah borofisar cilmiga siyaasadda ka dhiga Jaamacadda Caalamiga ah ee Islaamka.\nLaakiin qiimaha maciishada ayaa kor u kacaya, sida dalal kale oo badan. Bishii July, 20,000 oo mudaaharaadayaal ah ayaa isugu soo baxay waddooyinka Kuala Lumpur iyagoo dalbanaya in Anwar uu xilka iska casilo, sababo la xiriira kor u kaca qarashka iyo dib u habeynta dhaqaalaha.\nKuwo kale waxay ku eedeeyaan maamulkiisa inuusan wax ku filan ka qaban kor u qaadida Malaysia oo loo dhan yahay marka loo eego Islaamiyiinta sii kordheysa.\nXigashada Sawirka, Getty Images\nSaaxadda Caalamka, Anwar aad buu u guulaystay. Raiisel wasaare ahaan, wuxuu isu-dheellitiray dhaqaalaha dalkiisa ee soo ifbaxaya  iuusan dhexda u gelin harddanka Mareykanka iyo Shiinaha.\nWaxa uu sidoo kale ku casuumay shir madaxeedka hogaamiyaha Shiinaha Xi Jinping. Xi ayaa booqasho rasmi ah ku tagay Malaysia bishii April, ka dib 12 sano oo khilaaf u dhaxeeyay, balse wuu ka baaqsaday shir madaxeedka toddobaadkan.\nLaakin joogitaanka Trump arrin yar uma ahayn dhaqaalaha Koonfur Bari Aasiya ee ku tiirsan suuqa Maraykanka. Waxay ka dhigan tahay in dalal kale, sida Thailand iyo Vietnam, ay sidoo kale ka wada hadli karaan faahfaahinta canshuuraha taasi oo imika ay ku guuleysteen.\nAnwar waxa uu ahaa nin aad ugu firfircoon dhinaca diblomaasiyadda. Sannadkii ugu horreeyay ee uu Ra'iisul Wasaaruhu ahaa, waxa uu booqday dhammaan dalalka Koonfur Bari Eeshiya , marka laga reebo Myanmar, oo ay ka socdeen dagaallo sokeeye tan iyo markii ay ciidamadu la wareegeen awoodda sannadkii 2021-kii.\nDoorkii uu ku lahaa xabad joojinta Thailand iyo Cambodia ayaa sidoo kale kor u qaaday mawqifka Anwar, laakiin guushan dublamaasiyadeed wax yar ayey uga dhigan tahay dadka caadiga ah ee Malaysia.\nMarka ay timaado gudaha dalkiisa Waxa guriga ka guuxaya waa u doodista uu u hayo qadiyadda Falastiin, oo aad u sii xoogaysanaysay tan iyo markii uu dagaalka Qaza bilaabmay 2023-kii.\nJawaabta taasi waxay muhiim u noqon doontaa qaabka uu uga badbaado doorashada soo socota, ee ku beegan 2028.",
  "date": "2025-10-28",
  "scraped_at": "2025-10-29T17:40:30.039969+00:00",
  "category": "news",
  "text_hash": "b5c90fa1ff64c00738f4acf0e9c4cf4fd979b70535f6707779b38304f48899d7",
  "minhash_signature": "276769,2765648,129876,7453948,8168639,5712311,2106806,91926,1225900,1345751,3024833,8391547,804375,846327,1846850,3782764,1646368,2853476,900660,2668728,8838905,1004084,7854746,671465,3244535,2824751,1045025,11068615,759480,10244325,5734538,1606647,4844681,15932976,10417591,6258197,2411045,365956,813326,3129305,3274880,7319586,1029334,10220879,1324486,2309451,2346184,4626019,10164993,9272011,6242229,973970,78410,1972378,4657773,7681680,1321969,10578093,2487685,11062079,832300,3483719,2705589,842536,1710398,9096036,7485114,7505751,1500067,5530576,4831745,9028696,3783292,3789024,2198451,202506,315762,641273,2377282,186616,3374734,713417,1385887,563713,29735727,4659076,4069056,10330660,2852213,1318893,1043510,239904,11443749,5523348,9531775,735849,1651702,287643,1227304,2454737,3601662,4687136,8734663,2774193,3231593,9170496,1934466,2431652,1802443,654186,19448627,1881404,4693802,9456774,4568935,11571684,3049992,5452866,1928043,1152686,2072042,5153713,2297652,12155701,868951,7633074,4319021,3635578"
}