{
  "url": "https://www.bbc.com/somali/articles/c4g7zz2zlneo",
  "title": "Hadii aad sameyso siddeedaan caado 24 sano oo dheeraad ah ayay cimrigaaga ku dari kartaa",
  "text": "Xigashada Sawirka, Getty Images\nWaa la yaabnaa markaan aragno waayeel gaaray da'da 100 sano, waayo ma aha qof walba oo intaas gaaro. Sababtoo ah qofkasta ma noolaado waqtigaas dheer,  waxaa jira siyaabo badan oo lagu hagaajin karo laguna kordhin karo cimriga.\nDad badan cimri dheerida waxay ku timaadaa hiddo-side, balse daraasado ayaa muujinaya in hab nololeedkeennu uu saameyn ku yeelan karo cimrigeenna. Dhammaanteen waan ognahay hal dariiq oo sahlan oo cimriga lagu dheerayn karo, taasoo ah in la qaato hab nololeed caafimaad leh.\nSu'aashu waxay tahay: Waa maxay hab nololeed caafimaad leh?\nDaraasad dhowaan la sameeyay ayaa tilmaantay siddeed caado oo muhiim ah oo cimriga qofka ku kordhin kartaa ilaa 24 sano. Tani waxay yaraynaysaa khatarta dhimashada xilli hore. Kooxda cilmi-baarayaasha waxay noocan dhimashada ugu yeereen \"geeri hore\"\nSahanka hadda la sameeyay ayaa daboolay 2,76,000 oo qof.\nEnd of Ugu akhris badan\nKuwa soo socdaa waa siddeed siyaabood oo aad ku noolaan karto waqti dheer.\nKuwani  waa siddeeda qaab oo cimriga ku dheerayna\nXigashada Sawirka, Getty Images\nCunto kala duwan oo dheellitiran ayaa muhiim ah. Inta badan dadka waxay ogyihiin in cuntooyinka degdega ah, kuwa sokorta badan leh iyo kuwa cusbada badan ay caafimaadka waxyeello u leeyihiin. Sidoo kale, cuntooyinka si aad ah loo shiilay waa in laga fogaado.\nCuntadu waa inay ka koobnaataa miraha, khudaarta, badarka isku dhan, iyo borotiinka, sababtoo ah waxay ka hortagaan cudurrada daba dheeraada iyo bararka.\nJimicsi maalinle ah\nHelidda jimicsi dhexdhexaad ah maalin kasta waa muhiim si loo helo caafimaad guud oo wanaagsan. Jimicsiga joogtada ah wuxuu hagaajiyaa caafimaadka wuxuuna sidoo kale yareeyaa halista ah in la qaado cudurrada daba dheeraada.\nJimicsigu wuxuu hagaajiyaa tayada hurdada. Waxaa la ogaaday inuu xiriir la leeyahay arrimo badan oo nololeed. Daraasado badan ayaa muujinaya in hurdada u dhexeysa toddobo ilaa sagaal saacadood ay guud ahaan caafimaadka u wanaagsan tahay. Hurdadu waxay ka caawisaa jirka inuu soo kabto waxayna kaa ilaalin kartaa dhibaatooyin kala duwan.\nSi aad hurdada wanaagsan u hesho, khubaradu waxay kugula talinayaan in laga fogaado cabbitaanka khamriga iyo sigaarka, in la cuno quraacda subax kasta, in la cuno khudaar, in la jimicsado, iyo in si joogto ah loo xakameeyo heerka birta ee jirka.\nXigashada Sawirka, Getty Images\nWelwelku ma aha oo kaliya waxyeello maskaxda ah, laakiin sidoo kale wuxuu saameeyaa caafimaadka jireed. Waxa uu keeni karaa dhibaatooyin badan, oo ay ku jiraan cudurka wadnaha.\nXiriirrada dhow ee aan la leenahay qoyska iyo saaxiibada waa kuwo muhiim ah si aan u joogtayno xiriirada. Waxay yareeyaan fursadaha aan ku dareemeyno kelinimo. Xiriirradani sidoo kale waxay naga ilaalinayaan saameynta xun ee welwelka iyo walbahaarka.\nSida ay sheegtay Lydia Danworth oo ah Saxafiyad dhinaca Sayniska ah oo buug ka qortay saaxiibtinimada, waxa ay sheegtay in marka qofku go'doomiyo hab-dhiska difaaca jidhkiisa uu daciifo. Unugyada dhiiga cad ee qofka caynkaas ah waxay beddelaan hawlahooda jireed, taas oo daciifisa hab-dhiska difaaca.\nShanta xeer ee kor ku xusan waa in la raaco si loo helo caafimaad wanaagsan. Saddexda xeer ee soo socda ayaa noo sheegaya waxa aan iska ilaalino si aan u noolaano nolol dheer.\nKa fogaanshaha dhammaan noocyada daroogada, oo ay ku jiraan mida xooggan sida 'opioids,' waa lama huraan caafimaad wanaagsan. Ka fogaanshaha wax kasta oo la qabatimo, gaar ahaan qabatimada daroogada.\nIsticmaalka xad dhaafka ah ee khamriga waxay sababi kartaa cudurro ay ka mid yihiin beerka oo shaqadiisa gaba, dhiig karka iyo kansarka. Isticmaalka khamriga wuxuu keeni karaa beerka cirrhosis joogto ah, cagaarshow darran ama ama beerka oo si kedis ah u shaqadiisa u joojiy. Sidaa darteed, isticmaalka xad dhaafka ah ee khamriga waa in laga fogaado.\nSigaar cabbiddu waxay keeni kartaa cudurro badan. Ka fogaanshaha sigaar cabbista waxay kordhin kartaa cimriga qofka.\nDr. S. Chandrasekhar, madaxa waaxda daawada guud ee Jaamacadda Caafimaadka ee Government Stanley, ayaa sheegay:\n\"Dhakhaatiirtu waxay sheegayaan in haddii qofka uu joojiyo sigaar cabbista ka hor da'da 40, cimrigiisu wuxuu ku kordhi karaa ilaa 10 sano.\"\n\"Waa sidaas, haddii qofku joojiyo sigaar cabbista kadib da'da 40, waxyeellada sigaar cabbistu ku reebtay jirkiisa waxay hoos ugu dhici kartaa ilaa 90%. Si kastaba ha ahaatee, lama hubo in cimrigiisu si buuxda u kordhayo.\"\nDaraasaddu waxay muujisay in dadka la qabsaday qaab-nololeedkan caafimaad qaba ay gaareen cimri dhan 87 sano — taasoo 10 sano ka badan celceliska cimriga dadka Mareykanka.\nDabcan, wax kasta ma damaanad qaadi karaan cimri dheer, balse siddeedaas caado ee kor lagu xusay waxay kaa caawin karaan inaad ku socoto waddada saxda ah ee cimri dheer lagu gaaro.",
  "date": "2025-10-16",
  "scraped_at": "2025-10-29T17:03:29.910737+00:00",
  "category": "news",
  "text_hash": "a1cc3071cf2bb1ee5cdba73a535165fde81b2d6aea4ad9b27b9c2ace971760aa",
  "minhash_signature": "415796,13937476,13659921,301905,28036597,5909172,1668739,2046361,17430809,3727746,647562,4526452,3282246,824495,4780491,24048437,7274250,10774366,389230,795831,1189589,10682150,5025998,4436629,2651553,1177624,4496282,5480805,5188676,14399094,3501538,27986184,7248286,904143,5911277,8526966,2042612,2685667,6152238,12709264,7534763,7927437,21169313,1689224,170360,5651233,370404,8876288,4848575,1729594,5893713,5036709,397395,12301952,9859881,4592616,1194453,1696773,24928778,10295832,8374935,7049267,7666081,4875732,1214915,2334096,1628223,6746441,5325776,7175813,2029772,2101689,385463,3197147,80619,1306452,6012273,3493822,894778,1493625,3403499,4738748,2437790,8765309,3742811,6650005,1751296,749698,610401,5312239,4409413,9085164,922338,6372677,442355,660401,396220,994430,8851445,5271572,4260183,6897321,587259,13792776,4967129,129687,573084,4555887,7267565,7773462,19510064,3117693,2793288,3555895,24640037,5505401,398978,6766401,14603972,20462258,5183424,10758580,2314697,11248212,3911181,4344121,10202796,4683316"
}