{
  "url": "https://www.bbc.com/somali/articles/cyepwnxk64lo",
  "title": "Afar dal oo Yurub ah oo oggol baasaboor Soomaaliga",
  "text": "Cabdishakuur Casoowe\nXigashada Sawirka, Getty Images\nBaasaboorka Soomaaliya ayaa dhowrkii sano ee lasoo dhaafay u muuqday mid soo xoogaystay marka loo eego sida uu ahaa wixii ka dambeeyay burburkii dowladdii dhexe ee 1991-kii.\nInkastoo uu meel hoose uga jiro liiska kala sarraynta baasaboorrada, haddana waxaa muuqata in uu sanadkan ka horreeyo waddamo kale oo waawayn, oo ay ku jiraan Pakistan, Ciraaq, Suuriya iyo Afghanistan, sida lagu sheegay xogta ay shaacisay hay'adda Passport Index ee qiimaysa sharciyada socdaalka caalamka.\nHorumarka uu sameeyay baasaboorka Soomaaliya waxaa ka mid ah in waddamada Yurub qaarkood ay si rasmi ah u aqoonsadeen muddo dheer kaddib.\nD﻿adka heysta baasaboorka Soomaaliga ayaa marka ay dalbadaan dal-ku-galka Talyaaniga waxaa baasaboorkooda si caadi ah loo saaraa fiisaha.\nEnd of Ugu akhris badan\nDalal badan oo kale ayaa qofka Soomaaliga ah aan baasaboorkiisa ku dhajinin fiisada, iyagoo warqadda caddeynta fiisaha si gaar ah u siiya. Dowladaha sidaas sameeya waxaa ka mid ah UK, inta badan dalalka Yurub, Canada, Australia iyo Mareykanka.\nW﻿axaa xusid mudan in Talyaaniga uu ka mid yahay gumeysteyaashii Soomaaliya, sidoo kalena yahay dalkii ugu horreeyay ee aqoonsaday dowladnimada Soomaaliya.\nTan iyo bartamihii sanadkii 2018-kii, dalka Norway ayaa aqoonsan baasaboorka ay dowladda Soomaaliya siiso muwaadiniinteeda.\nDadaal dheer kaddib ayay safaaradda Norway ku dhawaaqday xilligaas in ay aqbashay jiritaanka baasaboorkan, sidaas awgeedna ay dadka wata u saari doonto dal-ku-galkeeda (Visa), haddii ay shuruudaha kasoo baxaan.\n\"Wada-shaqayn dhow oo ay yeesheen mas'uuliyiinta socdaalka ee Norway iyo Soomaaliya awgeed, Norway waxay aqoonsan doontaa Baasaboorka Soomaaliya laga billaabo 1-da bisha August 2018. Waxaa ku jira baasaboorka diblomaasiga iyo kan shaqaalaha dowladda iyo baasaboorka muwaadiniinta caadiga ah ee ay soo saarto waaxda socdaalka Soomaaliya,\" ayaa lagu yiri qoraal markaas ay safaaradda Norway ee Soomaaliya soo dhigtay boggeeda Twitter-ka.\nMacluumaadkan waxaa daabacay X.  Waxaan dalbanayenaa fasaxaaga ka hor inta aan la furin, waxaa laga yaabaa inay isticmaalayaan cookies iyo farsamooyin kale. hadii aad u bahato akhri X xeerarka cokie iyo kan ku saabsan xogta gaarka ah ka hor inta aadan aqbalin. si aad u aragto xogta guji ‘aqbal oo soco’.\nDhammaadka X boggan\nMacluumaadkan lama heli karo\nWaddamada kale ee Yurub, UK iyo dalal badan oo kale waxay baasaboorka Soomaaliya dadka wata u aqoonsan yihiin qaxooti, haddii ay dal-ku-gal u oggolaadaanna kuma dhajiyaan baasaboorka.\nTaas baddalkeeda waxay soo raaciyaan warqad caddaynaysa in fiisaha la siiyay qofka, macluumaadkiisana ay ku xusan yihiin.\nHase yeeshee, dowladda Sweden ayaa si gaar ah u qaddarisa baasaboorka Soomaaliga ah ee noociisu uu yahay diblomaasiga.\nXigashada Sawirka, Getty Images\nTan iyo bishii Jannaayo ee sanadkii 2020-kii, Sweden waxa ay aqoonsanayd baasaboorka diblomaasiga ee Soomaaliya, gaar ahaan kan la soo saaray 2014-kii ama wixii ka dambeeyay.\nBalse, dhammaan noocyada kale ee baasaboorka Soomaaliga ma aqoonsana Sweden, sida lagu sheegay bogga internet-ka ee safaaradda Sweden.\nWaddamada Yurub ee aqoonsan baasaboorka Soomaaliya waxaa kale oo ka mid ah Belgium.\nHoraantii sanadkii 2019 ayey dowladda Belgium, oo ah waddan ka tirsam Midowga Yurub ku dhawaaqday in ay aqoonsan tahay labada baasaboor ee Soomaaliga ah ee kala ah service-ka iyo diplomatic-ga.\nBayaan 1-dii bishii Aprile e sanadkaas lasoo dhigay bogga Twitter-ka ee safaaradda ay Belgium ku leedahay Nairobi ayaa lagu xaqiijiyay aqoonsiga noocyada baasaboorka Soomaaliya.\nDhowr waddan oo ku yaalla Koonfurta Qaaradda Ameerika ayaa baasaboorka Soomaaliya lagu aadi karaa iyadoo aan wax dal-ku-gal ama fiiso ah loo qaadanin.\nDalalkaas ayaa kala ah:\nWaxaa jira waddamo kale oo sidaas si la mid ah soo dhaweeya muwaadiniinta Soomaaliya.\nXigashada Sawirka, Getty Images\nWaddamadan qofka u socda waxa kaliya ee looga baahan yahay waa inuu tikit goosto, toosna ugu dhoofo. Sidaas awgeed, marka uu ka dago ayaa la siinayaa aqoonsi muujinaya joogitaankiisa.\nWaxaa ka mid ah:",
  "date": "2022-08-01",
  "scraped_at": "2025-10-29T17:01:28.252131+00:00",
  "category": "news",
  "text_hash": "b024511b407205b035fa3eedfc4044434f60038d56b7992115980f15701dc953",
  "minhash_signature": "8722549,470243,21414,5704648,1663105,15875600,3570223,7843798,23285041,15972761,3392584,504298,8880680,14252843,4037318,42294639,11816118,1824084,3779146,4569130,15168516,12707123,12249710,4436629,683878,15296947,6513653,19932985,28048798,1458185,72532,7201218,15685583,14910325,18100553,7144653,11778615,3395169,7568288,2753696,7257737,4139673,5533976,21456650,1047629,1205454,18430904,8876288,356453,7513789,14533397,8964175,22807905,4254907,12302185,25742195,3389774,10966480,6452276,3385452,1736984,3744806,26519550,2625943,367417,1643023,5507204,7125131,8981281,4524645,16599127,2592073,2767371,1984311,3452536,2744291,11709215,3571159,19042229,9278459,20709,7634282,8828317,2482137,9926135,610207,560018,3309294,2627819,2490756,6843178,5424284,388672,11655603,3096599,3151873,133531,8183901,1227304,8893143,20811783,6303826,2784535,6925822,4891968,6128187,6060472,5518395,1945178,2010569,1009201,2841459,9218958,2483454,12581921,1972613,12211196,10800052,580268,713392,1353405,19399871,11262047,3754056,350320,22943600,708039,887214"
}