{
  "url": "https://www.bbc.com/somali/articles/cyv61zv5nnzo",
  "title": "Maxaad ka taqaan masaajidka Qiblateyn ee ka mid ah kuwa ugu faca weyn Afrika",
  "text": "Xigashada Sawirka, Wikipedia\nXukuumadda Somaliland ayaa ku dhawaaqday inay doonayso inay dayactirto masjidka qadiimiga ah ee taariikhiga ah ee  la yiraahdo Qiblateyn, kaasoo ku yaalla magaalada Seylac.\nCabdullaahi Daahir Jaamac oo ah wasiirka awqaafta iyo arrimaha diinta ee Somaliland ayaa BBC u xaqiijiyey qorshaha dib u dhiska masjidka ee xukuumaddiisa, isagoo ka mid ahaa guddi wasiirro ka kooban oo halkaa u tegey inay soo daraaseeeyaan, kana talo bixiyaan sida loo dayactiri karo masaajidka.\nMasaajidkan oo caan ku ah labo mixraab ama qiblo oo uu leeyahay, ayaa lagu tilmaamaa in uu astaan u yahay soo gaaritaankii diinta islaamka ee Afrika.\nWasiirka ayaa BBC u sheegay in sababta ay u dayactirayaan masjidka ay tahay maadaama uu taariikh fac weyn u leeyahay Islaamka.\n\"Umad walba taariikhdeeda way uruurisaa, sidaa darteed ayaa madaxweynaha Somaliland wuxuu dhawaan magacaabay guddi ay wasaaradda arrimaha diinta hogaaminayso, waxaana loo xilsaaray in masjidkaas xaaladiisa iyo dib u dhiskiisa ka hawgalaan, safarkayagana arrintaas ayuu ku saabsanaa\" ayuu yiri wasiirku.\nEnd of Ugu akhris badan\nWuxuu intaa ku daray in masjidka taaariikhdiisa aad loo ilaaliyey, ayadoo labadii qiblo ay sidoodii u jiraan.  \"Waxaa wax lagu farxo ah in raadkii masjidka uu weli nool yahay oo meel laga duuli karo oo dayactirkiisa laga bilaabi karana uu taagan yahay\" ayuu yiri mar uu ka hadlayey wixii ay la soo kulmeen ka guddi ahaan.\nWasiirku ma uusan faahfaahin qaabka ay dib u sdhiska u wajihi doonaan, laakinse wuxuu sheegay in maadaama masjidkan uu yahay goob taariikhi ah uu dib u dhiskiisa ka duwanaan doono masaajidda kale, ayadoo taariikh badan la baari doono, khubarana lala kaashan doono.\nWasiirka arrimaha diinta ayaa sheegay in uu masaajidkaas sii ahaan doono goob cibaado, isagoo dhanaka kalena noqon doono goob taariikhi ah oo ay dadku soo booqdaan.\nMaxamuud Sheekh Axmed Dalmar waa aqoonyahan arrimaha Islaamka ka faallooda, wuxuu ka warramay sababta uu masjidkaas magaca 'Qiblateyn' kula baxay.\nXigashada Sawirka, HCC\n\"Horta kolley taariikhdaasi baadhis badan bay u baahan tahay, waxay se tilmaamaysaa taariiikhda islaamka wakhtigii aan jasiirad carab aan la soo dhaafin, Nebigu NNKH intii aan la hijroon ee uu Maka joogay, marka uu tukanayo waxay qibladiisu ahayd Quddus oo looma tukan jirin Maka. Markaa waxaa jira masjid ku yaalla Madiina agagaarkeeda oo la yidhaahdo Qiblatayn, oo iyadoo lagu tukanyo oo loo jeedo Quddus ayay aayadi soo degtay oo xaggii Quddus oo waqooyi ahayd laga jeestay oo koonfur oo ay markaa Maka ka xigtay loo jeestay, sidaana Masjidkii labada qiblo lahaa loogu bixiyey, kan se ma hubo oo taariikh bay u baahan tahay. Waa suuragal in yadoo xaggaa loo tukado ay soo gaadhay in Maka ay sax tahay, iyo in ay tahay muujinta taariikhaas si loo xasuusnaado\" ayuu yiri Sheekh Dalmar.\nDadka yaqaanna masjidkan taariikhiga ah waxay sheegaan in la dhisay qarnigii 7aad, inkastoo aan si madax banaan loo xaqiijin.\nDhismahan qarniyaasha jira ayaa waxaa soo gaaray burbur balaaran.  Waxaa jira meelo qodmay iyo meelo uu ka muuqdo aasaaska masjidka.  Sannadkii 2007 ayaa arrintaas iyo dayactir la'aanta masjidka haysata waxaa lagu xusay warbixin uu xaaladda masaajidkaas ka diyaariyey khabiir warbixinta u diray UNESCO.\nXigashada Sawirka, X\nSheekh Nuur Abukar Qaasim oo ah Aqoonyahan Soomaaliyeed ayaa bartiisa X ku qoray in labada mixraab ee masjidka ay taagnaayeen ilaa 2016, markaas oo uu dumay gidaarkii xigay dhinaca qiblada.\nAqoonyahannada ayaa sheegaya in masaajidka uu maray dhowr marxaladood oo dayactir ah, ayadoo labada mixraab ay aad isugu dhow yihiin oo ay isku jiraan 2-3 darajo.\nMasaajidka Qiblateyn waxaa kaloo xeyndaabkiisa ku yaalla qabriga Sheekh Babu Dena.\nMasjidka Qiblateyn ayaa ka mid ah kuwa ugu faca weyn qaaradda Adrika, waxaana isku wakhti la dhisay isaga iyo masjidu saxaaba oo ku yaalla Massawac, Eritrea iyo Masaajidka Al Nagashi ee ku yaalla Itoobiya.\nIlaa hadda waxaa la ogyahay in uu jiro masjd ku yaalla Madiina oo isgana leh laba mixraab.",
  "date": "2025-09-30",
  "scraped_at": "2025-10-29T17:35:29.990820+00:00",
  "category": "news",
  "text_hash": "66d64694f2bccbebbbf9585961dae88440116da9d3a3315c633d5a837549c272",
  "minhash_signature": "3271083,14043013,2147681,1307547,13812132,7204899,1791341,5164655,1342468,7047966,2389551,1054646,2780419,15726196,291107,28415329,2245732,3018814,341759,1829565,1129759,8358145,234574,896683,10496211,4143403,4072062,17715146,6063701,4415294,18022916,822662,11695412,9213366,7040364,1397425,1774737,1747185,8277094,7458342,170582,5971462,7011846,10116716,12081838,844876,71208,10260726,11347017,7431405,10028979,2059512,13251219,15470589,2684046,11641010,5122329,8917456,2135870,6796723,14612718,256822,2097636,827482,1104052,2766391,22504486,616949,5563121,10592481,10660746,3378983,4511061,9432295,3066902,6862429,389781,4590718,3330209,17928939,5222810,6603528,4818424,8504389,1459702,4229868,10559625,13632,9796879,13764889,9254633,1259425,6973988,1535060,3701443,34089301,10272568,6582396,1492760,17652362,3208148,24724683,4739371,2643305,2968226,3289530,15136779,4868123,8019611,6371570,1009201,16011731,5564528,5193173,3936462,16683706,4195543,561811,7202501,741036,5098039,3180083,8104085,1591002,6244906,395412,4598474,3358644"
}