{
  "url": "https://www.bbc.com/somali/articles/cly937ngje5o",
  "title": "Maxaa u xal ah jilbo xanuunka?",
  "text": "Xigashada Sawirka, AFP via Getty Images\nMarka aad gaadho da'da soddomeeyada, waxaa laga yaabaa inaad bilowdo inaad dareento xanuun fudud oo jilbaha ah, si gaar ah marka cimiladu is beddesho, sidoo kale waxaad dareemi kartaa murqaha oo adkaada ama kala bixiddoodu yara dheeraato subaxdii markaad toosto. Mararka qaarkoodna waad ka labalabayn kartaa inaad foorarsato — dhammaan calaamadahan waxay muujinayaan in kala-goysyada jilbahaagu aysan ahay sida ay hore ahaan jireen.\nArrimo ay ka mid yihiin cayilka, difaac-jidhka oo hooseeya, iyo hidde-sidaha ayaa dedejin kara korodhka dhibaatooyinka jilbaha.\nXanuunka jilbaha waa mid ka mid ah dhibaatooyinka ugu badan ee dadka waaweyn la kulmaan, wuxuuna saameeyaa wax walba laga bilaabo socodka ilaa guud ahaan noloshaada.\nDr. Anikar Chhabra, oo ah dhakhtar qalliin lafaha ah oo ka tirsan Mayo Clinic ee magaalada Phoenix, Mareykanka, ayaa sheegay: \"Jilbuhu waa mid ka mid ah kala-goysyada ugu muhiimsan jidhka. Wuxuu xambaarsan yahay culays jidheed gaadhsiisan tallaaboyinka aan qaadayno.\"\nCilmi-baadhisyo ayaa muujinaya in ilaalinta xoogga murqaha ku wareegsan jilbaha ay yarayn karto cadaadiska kala-goysyada iyo xanuunka jilbaha.\nEnd of Ugu akhris badan\nDr. Alexis Colvin, oo ah borofisar ku takhasusay qalliin lafaha oo ka tirsan Icahn Clinic ee Mount Sinai, magaalada New York, ayaa sheegtay in jimicsigu uu hagaajin karo caafimaadka jilbaha.\n\"Jilbaha waxaa ku jira dareere u eg saliidda mishiinka,\" ayay tidhi Colvin. \"Jimicsigu wuxuu kiciyaa soo saarista dareerahaas, taas oo yaraysa qallafsanaanta iyo bararka. Waxa kale oo uu jilbahaaga ka dhigayaa kuwo si fiican u shaqaynaya.\"\nJimicsiga sida oo kale wuxuu xoojiyaa lafaha jilbaha laftiisa, isaga oo yaraynaya halista ah in lafuhu daciifaan ama khafiifaan.\nDr. Chhabra wuxuu sheegay in xoojinta jilbaha ay si gaar ah muhiim ugu tahay dadka waaweyn, sababtoo ah waxay siinaysaa xasilooni murqaha ah oo yaraysa khatarta lafo xanuunka.\nJimicsiyada jilbaha waxay leeyihiin faa'iidooyin kale oo la yaab leh—sida kor u qaadista fikirka, dareenka, iyo awoodda jirka ee lagu garto dhaqdhaqaaqyada iyo meeshay ay taagan yihiin xitaa adiga oon fiirin.\nDr. Colvin waxay sheegtay in ay kula talinayso dadka in ay bilaabaan jimicsiga marka ay gaadhaan soddomeeyada.\nDr. Chhabra wuxuu kugula talinayaa inaad maalin kasta 15 daqiiqo ku bixiso, saddex ilaa afar jeer toddobaadkii, adigoo samaynaya jimicsiyo kala duwan oo jilbaha ah—gaar ahaan kuwa lagu sameyn karo guriga adigoon qalab gaar ah u baahnayn.\nXigashada Sawirka, AFP via Getty Images\nSidoo kale wuxuu kugula talinayaa inaad la tashato tababare si aad u hubiso inaad si sax ah u samaynayso. Halkan waxaa ku yaal qaar ka mid ah jimicsiyada muhiimka ah ee lagu sameeyo guriga:\nBooditaanka raha (Jumping Frogs): Jimicsiyadani waxay xoojiyaan jilbaha, yareeyaan xanuunka, waxayna hagaajiyaan tayada nolosha dadka qaba xanuunka jilbaha.\nCilmi-baaris ayaa muujisay in haddii si sax ah loo sameeyo, aysan jirin halis dhaawac ah, hase yeeshee Dr. Chhabra wuxuu sheegay in haddii si khaldan loo sameeyo ay dhaawici karaan jilbaha.\nKor u qaadista Lugta (Leg Raises): Jimicsigan wuxuu ku lug leeyahay inaad jiifto, adigoo mid ka mid ah jilbaha laabayo, kan kalena toosinayo oo kor u qaadayo dhowr ilbidhiqsi, kadibna si tartiib ah u dhigayo.\nCilmi-baaris ayaa muujisay in kor u qaadista lugta keliya ay xoojiso murqaha jilbaha, isla markaana yareyso khatarta dhaawacyada la xiriira jimicsiga.\nDr. Chhabra wuxuu sidoo kale soo jeediyay jimicsi kale oo xoojinaya murqaha: \"Istaag faraha cagahaaga, si tartiib ah kor ugu qaad ciribta adigoo jilbaha toosinaya, hal ilbidhiqsi hayso, kadibna si tartiib ah u dhig.\"\nGuud ahaan, waqtiga aad ku bixiso jimicsiyada xoojinaya jilbaha waa maalgashi muhiim ah oo kor u qaadaya caafimaadkaaga mustaqbalka fog.",
  "date": "2025-10-15",
  "scraped_at": "2025-10-29T17:22:29.226968+00:00",
  "category": "news",
  "text_hash": "dfedcf06291de4069573007860c25a81933ec32766a921b85fc476ceb025d4cb",
  "minhash_signature": "3106805,645683,1271515,30655,336952,4673109,33006893,5798464,10539802,5453817,6787455,60070,7558929,17236049,11104018,1514375,11765614,6892689,9118229,668424,2954848,1807197,9361831,33595775,1307865,74098,29720247,5701741,1606462,15013532,9212808,1646094,26995450,7503232,13328097,5567651,3033890,2307610,24164158,1449679,1781467,16604256,23726744,5110286,4170454,22387603,877897,6352729,2396153,8137573,12726992,3619519,1096875,1390814,5440680,19204094,7476676,4621872,6268265,3818188,2735060,9597218,34965670,548307,3208332,279189,2275386,15733091,1276833,11297775,16233174,875712,7158381,4940669,10327273,19163531,2342640,25221060,3867845,1516896,6874812,14531174,2802426,2475480,4812791,17547878,4823880,6740993,492241,13944914,1922415,9100168,2884469,16603524,5121682,6439796,3227675,11012637,292484,6602139,9766998,12342115,5092415,7068430,18833699,2490793,6840376,3841072,7399531,6438481,12408374,243380,4963386,13854155,21476428,3525398,263292,8558591,13321518,5328560,10803235,574293,2221315,1580644,24612813,8170968,2314311,3062348"
}