{
  "url": "https://www.bbc.com/somali/articles/cd1nrvxy587o",
  "title": "Ismaaciil Cumar Geelle oo BBC-da u sheegay waqtiga uu xilka ka dagayo",
  "text": "Xigashada Sawirka, Getty Images\nMuddo 23 sano ah ayuu Ismaaciil Cumar Geelle xukumayay dalka Jabuuti oo ay ku nool yihiin shacab tiradoodu dhan tahay hal milyan oo ruux, balse hadda waxa uu ku dhawaaqay waqtiga uu ka dagayo xilka.\nWareysi gaar ah oo uu Madaxweyne Geelle siiyay BBC-da ayuu uga hadlay arrimo ay ka mid yihiin qorsheyaasha dowladdiisa, mucaaradka, sicirka nolosha, kobaca, halista kooxaha jihaad doonka ah, xiriirka Soomaaliya iyo xasaradaha Itoobiya.\nIsmaaciil Cumar Geelle waddankiisa waxa uu buundo uga dhigay ganacsiga ay dowladda Shiinaha la wadaagto qaaradda Afrika, sidaasna waxa uu ku noqday marinkeeda cusub.\nBalse dadka kasoo hor jeeda waxa ay maamulkiisa ku qeexeen mid shacabka muquuninaya oo ka hor istaagaya waxyaabaha ay xor u yihiin.\nWariyaha BBC-da, Nicolas Négoce, oo dhowr oo wareystay Madaxweynaha Jabuuti ayuu u sheegay in uu xilka wareejin doono sanadka 2026-ka, oo ku beegan marka uu dhammaado muddo xileedka hadda u socda.\nEnd of Ugu akhris badan\nTaas ayaa ka dhigan in Geelle uusan mar kale usoo istaagi doonin tartanka doorashada madaxweynaha marka ay doorashada xigta dhacayso.\nXigashada Sawirka, Getty Images\nSu'aalaha la waydiiyay inta uu wareysigu socday waxaa ka mid ah mid ku saabsanayd sida uu u arko dadka u badan dibad joogga ee baraha bulshada soo dhigaya baaqyada ay ugu jeedinayaan in uu xilka iska casilo, maadaama ay ku eedeeyeen in uusan shacabkiisa u qabanin wax ku filan.\nIsagoo ka jawaabayay su'aashaas ayuu Madaxweyne Geelle yiri: \"Haddii aad dibad joog tahay micnaheeda ma aha inaad mucaarad noqoto. Haddii aadan rabin inaad ka shaqyaso gudaha dalkeenna micnaheeda ma aha inay fasax kuu tahay inaad abuurato sheekooyin aan jirin.\"\nInta badan dadka reer Jabuuti iyo kuwa dhaliila maamulka Madaxweyne Geelle ayaa tusaale usoo qaata sicirka nolosha ee qaaliga ah. Waxyaabaha sida gaarka ah aad looga cawdo waxaa ka mid ah qiimaha korontada oo sarreeya.\n\"Ma nihin waddan saliidda soo saara. Ma nihin waddan leh wabiyo oo korontada ka dhaliya gudaha. Waxaan hoos dhigay qiimihii korontada oo horay u sarreeyay. Waddamada dariskeenna ah marka laga reebo Itoobiya, xitaa maba haystaan adeeg koronto oo la isku hallayn karo. Waa inaan ku faanno waxa aan haysanno ilaa hadda,\" ayuu yiri Madaxweyne Geelle.\nXigashada Sawirka, Getty Images\nMar uu ka hadlayay heerka faqriga ayuu yiri: \"Wax roob ah ma aannaan helin muddo saddex ilaa afar sano ah. Ma jiraan beero. 6% ilaa 8% kobac dhaqaale ah kama imaado meel cidlo ah. Waxa uu ka imaadaa shaqo joogto ah oo aan u hayno sidii aan u cirib tiri lahayn faqriga iyo jaajada.\"\nDhinaca khatarta kooxaha loogu yeero argagixisada ayuu sidoo kale ka hadlay madaxweynaha Jabuuti, waxa uuna si gaar ah diiradda u saaray hadal hal sano ka hor uu yiri hoggaamiyaha Al-Shabaab, Axmed Cumar, oo ku baaqay in la weeraro Mareykanka iyo Faransiiska saldhigyada ku leh Jabuuti.\nWaxa uu sheegay in dowladdiisu aysan halis gooni ah dareemeynin.\n\"Mar walba waan isdifaaci doonnaa. Way dhihi karaan wax kasta oo ay rabaan balse annagu waan kasoo hor jeednaa qalalaasaha, argagixisada, xagjirnimada iyo wax walba oo wax u dhimaya xornimadeenna iyo xornimada dadka kale,\" ayuu yiri.\nXigashada Sawirka, Getty Images\nWaxaa kale oo Geelle wax laga waydiiyay sida loo sii xoojin karo xiriirka Jabuuti iyo Soomaaliya, maadaama uu bishii June Muqdisho uga qayb galay caleema saarka Madaxweyne Xasan Sheekh Maxamuud, dhawaanna uu madaxweynaha Soomaaliya qudhiisa booqday Jabuuti.\n\"Waligeed ma jirin caqabad noo dhaxaysay annaga iyo Soomaaliya, tan iyo sanadkii 2000. Waxaan ka mid nahay taageerayaasha tirada yar. Waligeen kama aannaan cago jiidin, mar walbana waan taageeri jirnay [Soomaaliy] si ay dowladnimadooda usoo ceshtaan.\"\nDhanka kale, mar uu ka hadlay xasaradda Itoobiya waxa uu sheegay in ay socdaan dadaallada dib u heshiisiinta, ayna rajaynayaan in ay natiijo fiican kasoo baxdo.\n\"Itoobiya way badbaadi doontaa. Annagu waxaan mar walba u xusul duubaynaa in la helo Itoobiya mideysan oo horumarta,\" ayuu yiri madaxweynaha Jabuuti.",
  "date": "2022-07-20",
  "scraped_at": "2025-10-29T17:08:29.741924+00:00",
  "category": "news",
  "text_hash": "b77bf81c40499246084324091367a70d2baadc975507d19fc8bc48977a6e2b81",
  "minhash_signature": "4121492,9794783,17169987,4078497,1759059,3361393,4565440,8378359,5026093,4806415,1786162,4526452,1148157,12911215,2471777,2409529,23871820,4011106,4874497,6062655,7512143,5718863,204914,4436629,2457185,5013278,9811408,25861182,10393832,81276,11887664,2364212,7449761,1989321,2448289,2795974,5524090,5597215,23389128,11828107,1022442,1842392,25561581,17105264,25654799,3956655,9878557,3455323,14043515,1094176,11656401,3048396,302336,5007551,25833180,1958357,7123834,6177143,2956139,3337469,14466210,615590,11475407,19582406,11166526,10220532,7591779,1571315,6356195,10772691,2676708,6878191,14953688,5525616,11653318,232624,6118447,7227288,8248516,32794,11506488,7306943,3876351,1825766,1574701,739241,2482019,29457570,6346695,7719083,4526270,834278,10087646,5769848,7164507,11009701,1095607,190105,812358,27615924,10456939,13164568,22886940,7296709,483451,16985418,4322676,2238366,11070008,10001623,4380980,256264,3087863,2617020,6300135,21162517,14431355,9314290,6849199,16195249,3970829,1055918,9010322,1861837,754368,40154965,3571176,5315148"
}