{
  "url": "https://www.bbc.com/somali/articles/cx2x1dlvvkyo",
  "title": "Taariikh cusub oo qorantay: saddex dumar ah oo markii ugu horeysay u taagan madaxtinimada Tanzania",
  "text": "Markii ugu horreysay taariikhda siyaasadda xisbiyada badan ee Tanzania, haweenka u tartamaya xilka madaxweynenimo ayaa soo muuqday iyagoo tiro badan leh iyo heer siyaasadeed oo aad uga sareeya sidii hore weligeed la arki jiray.\nDoorashada guud ee 2025 waxay noqon doontaa mid uu madaxweyne dumar ah difaacanayso kursigeeda, iyadoo ay jiraan laba dumar ah oo kale oo wata calamada xisbiyada mucaaradka.\nWaa doorasho leh saddex dumar ah oo u taagan madaxweynenimo, taasoo muujinaysa isbeddel weyn oo dhanka siyaasadda iyo bulshada ah.\nFalanqeeyayaashu waxay leeyihiin xaaladdani ma aha oo keliya natiijada siyaasadda xisbiyada gaar-gaar ah. Waa calaamad muujinaysa in bulshada reer Tanzania, iyada oo loo marayo doodda dadweynaha iyo waaya-aragnimadii sannadihii la soo dhaafay, ay bilaabeen inay aqbalaan hoggaanka haweenka ee jagooyinka sare.\nHalka doorashooyinkii hore lagu tirin jiray haweenka faro ku tiris, hadda 2025 wuxuu isu beddelayaa sanad taariikhi ah oo joogitaankooda ay miisaan cusub ku yeelatay doodaha siyaasadeed.\nEnd of Ugu akhris badan\nMarkii ugu horreysay ee magac dumar ah lagu arkay warqadda codbixinta madaxweynaha waxay ahayd 2005, markaas oo Anna Senkoro ay u tartantay madaxweynenimada iyada oo matalaysa xisbiga PPT Maendeleo.\nInkasta oo ay kaalinta siddeedaad ka gashay tartanka toban musharrax, haddana tallaabadeedu waxay furtay waddo ay haween kale ku dhiirradaan. Doorashooyinkii ugu horreeyay ee xisbiyada badan ee 1995 iyo kuwii xigay ee 2000 kama aysan qaybgalin wax musharrax dumar ah.\nTobban sano kadib, Anna Mghwira oo ka socotay xisbiga ACT waxay kaalinta saddexaad ka gashay doorashadii 2015, taas oo calaamad u noqotay bilowga muuqashada haweenka ee jagada ugu sarreysa ee dalka. Si kastaba ha ahaatee, doorashooyinkii 2015 iyo 2020, matalaadda haweenku way koobnayd. Cecilia Mwanga (Demokrasia Makini) iyo Queen Sendiga (ADC) ayaa u tartamay 2020, balse waxay ku dhammeysteen meelo hoose.\nTallaabadii ugu weynayd waxay timid 2021, markaas oo Samia Suluhu Hassan, ahayd ku-xigeenkii Madaxweyne John Magufuli doorashooyinkii 2015 iyo 2020, loo dhaariyay madaxweyne kaddib geeridii Magufuli.\nMarkii ugu horreysay taariikhda Tanzania iyo Bariga Afrika, waddan waxaa hogaaminayay madaxweyne dumar ah. Dhacdadan waxay u muuqataa inay noqotay dhiirrigelin siyaasadeed oo isbeddel horseeday. Tan iyo markaas, doodda ku saabsan kaalinta haweenka ee hoggaanka waxay yeelatay xoog cusub.\nSanadka 2025 wuxuu noqonayaa rikoodh cusub oo dhinaca haweenka ah.\nXigashada Sawirka, TBC\nSanadkan, taariikh cusub ayaa ka qorantay dalka Tanzania. Waa markii ugu horreysay oo saddex haween ah ay si rasmi ah ugu tartamayaan xilka madaxtinimada dalka.\nSamia Suluhu Hassan oo ka socota xisbiga CCM, ayaa u tartameysa muddo-xileedkeedii ugu horreeyay iyadoo hore xilka u heshay kaddib geeridii madaxweynihii hore, John Magufuli. Sida dastuurka dhigayo, haddii ay doorashada ku guuleysato, tani waxay noqon doontaa muddo-xileedkeedii ugu dambeysay.\nMwajuma Noty Mirambo oo ka tirsan xisbiga UMD, waa siyaasi hore uga soo shaqeysay ciyaaraha, kadibna u gudubtay golayaasha deegaanka, iyadoo dhowr jeer isku dayday iney gasho baarlamaanka. In kastoo ay la kulantay caqabado badan, maanta waxay sheegaysaa inay diyaar u tahay hoggaanka ugu sarreeya dalka.\nSaum Hussein Rashid oo ka socota xisbiga UDP, ahna xoghayaha guud ee xisbigaas, waxay si xooggan u taagan tahay u doodidda sinnaanta jinsiga iyo la dagaallanka tacaddiga lagula kaco haweenka. Iyaduna waa musharax kale oo kamid ah haweenka u tartamaya madaxtinimada.\nMarka lagu daro musharaxiintan, 10 xisbi oo kale ayaa haween u doortay iney noqdaan ku-xigeennada madaxweyne (running mates). Waa markii ugu horreysay ee Tanzania ay aragto tiro intan la eg oo haween ah oo doonaya xilalka ugu sarreeya ee dalka. Inkastoo doorashada ku-xigeennada sida caadiga ah loo eego aragtiyo juqraafiyeed iyo siyaasad, sanadkan waxaa muuqata in xisbiyadu ay xoogga saareen sinnaanta jinsiga.\nGuud ahaan, 18 xisbi ayaa ku jira tartanka madaxtinimada, waxaana tallaabada ay qaadayaan xisbiyada yaryar oo haween u soo xulay musharraxnimada lagu tilmaamay mid muujinaysa in doorashadan ay tahay \"doorashada haweenka\".\nXigashada Sawirka, CCM\nFalanqeeyayaashu waxay leeyihiin go'aanka xisbiyada ay haweenka ugu doorteen musharaxnimo wuxuu ka tarjumayaa isbeddelada bulshada iyo siyaasadda ee dalka ka jiray 15-kii sano ee la soo dhaafay.\nWaxbarashada, wacyigelinta xuquuqda haweenka iyo tusaalaha ay dhigtay Madaxweyne Samia ayaa lagu sheegay iney yihiin sababaha sare u qaaday kalsoonida haweenka ee hoggaaminta.\nMohammed Issa, oo ah falanqeeye siyaasadeed, ayaa yidhi:\n\"Wacyi bulsho wuu jiraa, haweenka tartamayana waa bateen, laakiin marka la barbar dhigo ragga weli taageeradu waa yar tahay.\"\nMararka qaar, xisbiyadu waxay siyaasadda ugu arkaan iney haweeney musharrax soo saaraan si loo helo wejiyo cusub, gaar ahaan xilligan oo codbixiyeyaasha intooda badan yihiin dhalinyaro iyo haween.\nMwajuma Mirambo oo doorashooyin badan u tartantay xilal kala duwan, waxay leedahay:\n\"Sanadihii hore way adkeyd. Dhaqanka ayaa haweenka gadaal  dhigay. Laakiin maanta waxaan aaminsanahay in haweenku ay hogaamin karaan, bulshadaana waxay bilowday iney nagu kalsoonaato.\"\nWaxay sheegtay in isbeddelkan uu ku dhiirrigeliyay in markan xitaa haweeney mucaarad ah ay guul gaadhi karto.\nXigashada Sawirka, INEC\nIn kasta oo tirada haweenka musharraxiinta ah ay korodhay, haddana caqabado weli way jiraan. Xisbiyada siyaasadeed ee Tanzania waxaa wali ka taliyo ragga, haweenkuna marar badan ma haystaan dhaqaalihii ama shabakadihii siyaasadeed ee lagama maarmaanka u ahaa olole weyn.\nTani waxay ka dhigan tahay in kaliya in haweeney musharrax tahay aysan macnaheedu ahayn in fursad fiican ay haysato.\nMohammed Issa wuxuu intaas ku daray:\n\"Haddii laga reebo Samia Suluhu Hassan oo ka socota CCM, musharraxiinta kale ee haweenka mucaaradka ah taageero badan ma haystaan. Dhab ahaantii mucaarad weyn lama arko, xataa dhex-dooda, sidaas darteed ma sahlana in si dhab ah la isu barbar dhigo ragga iyo haweenka.\"\nHanaanka doorashada ayaa sidoo kale dhaleeceyn la kulmay, gaar ahaan sidii ay u sinnan lahaayeen xisbiyada yaryar. Musharraxiinta sida Mwajuma iyo Saum Rashid waxay wajahayaan mishiinka siyaasadeed ee xooggan ee CCM  waana tijaabada ugu weyn.\nSidoo kale, fikirrada bulshada ee horey uga jiray arrimaha haweenka iyo hoggaanka, gaar ahaan miyiga, weli ma dhammaan.\nLaakiin, natiijada doorashada kasta si walba ha noqotee, waa bilowga waqti cusub oo aysan suurtagal noqon doonin in siyaasadda Tanzania looga hadlo iyadoo aan haweenka lagu darin.\nTaariikhda hoggaamiyayaashii haweenka ee hore sida Titi Mohammed, Lucy Lameck iyo kuwo kale wali way xasuusanyihiin, balse jiil cusub ayaa hadda qoraya bog cusub oo taariikhdan ah.\nBishan October 2025 waxii ka danbeeya, ma noqon doontaa doorasho mar ah oo kali ah  mise waxay noqon doontaa bilowga waqti cusub oo loo siman yahay jinsiyad ahaan, siyaasadda Tanzania gudaheeda?",
  "date": "2025-10-02",
  "scraped_at": "2025-10-29T17:33:31.208336+00:00",
  "category": "news",
  "text_hash": "905f58d540795816ec293174f829010f9ba32729925371287dbd5d28c31c3f28",
  "minhash_signature": "4139935,9193100,1526874,7203836,5375883,7006655,3043815,4433028,4166273,1247359,999620,288077,1860789,1311048,7144766,2048507,1674497,4780021,4004257,5782242,1223540,1582035,2623630,15565217,17211279,4783070,5570314,36459952,4393719,4624171,19948228,1170736,143785,1018386,760728,85387,1500642,1028935,3642282,5718977,6167965,409114,969511,209967,183490,1021558,3423577,2695101,3833931,1884710,619540,12020277,3551481,8151446,1473658,1098336,908986,1156638,8614245,955371,1045198,1502620,10177741,761992,8391982,6874767,944166,9977099,306998,1647578,4652022,14205925,600977,835018,5859872,2975168,9097311,10162214,4817567,597542,12824091,3230309,1476059,8971235,19460912,19416377,11959378,20910458,176787,4423296,3088655,3979197,6610445,4407365,1903688,1832726,712539,820457,1227304,10597913,3806895,2004249,36393,6236173,8985400,1227427,14532274,4102469,908075,2566105,6127026,790695,2626736,2408759,3715021,471032,1284635,13713066,614843,425648,427653,8058213,2037717,255354,447603,3077201,386421,20684414"
}