{
  "url": "https://www.bbc.com/somali/articles/cx2p3yy501do",
  "title": "Gabadha ka shaqayn jirtay xayaysiiska iyi aflaanta ee gacanta u gashay Xuutiyiinta Yemen",
  "text": "Xigashada Sawirka, INTISAR AL-HAMMADI\nXuutiyiinta Yemen ayaa sii daayay haweeney dharka xayeyesiisa oo lagu magacaabo Entisar al-Hammadi.\nEntisar ayaa xabsiga ku jirtay ku dhawaad ​​shan sano, waxaa sisaasi u sheegay wakaalada wararka ee AFP qareenkeeda iyo ilo amni  Axadii.\nEntisar Waxaa dhashay hooyo Itoobiyaan ah iyo aabbe Yemeni ah, waxaa lagu xiray bishii Febraayo 2021 magaalada Sanca iyada oo xilligaasi ku guda jirtay howlo sawir qaadid ah.\nWaxaa lagu xukumay shan sano oo xarig ah iyadoo lagu eedeeyay inay jirkeeda ka ganacsanaysay, adeegsiga daroogo iyo in ay macaasi ku kacday.\nEedeymahan ayaa qareenkeeda iyo kooxaha xuquuqul insaanka waxay ku tilmaameen kuwo been abuur ah oo lagu bartilmaameedsanayo xorriyadda haweenka.\nEnd of Ugu akhris badan\n\"Entisar al-Hammadi waxaa la sii daayay fiidnimadii shalay, waxayna hadda ku sugan tahay gurigeeda,\" waxaa sidaasi wakaalada wararka ee AFP u sheegay qareenkeeda, Khaled al-Kamal.\nQareenkeeda ayaa intaa ku daray in iyada iyo saddex qof oo kale lagu qabtay gaari magaalada Sanca , markaasi oo ay gacanta ku dhigeen  Xuutiyiinta\n\"Entisar waxa ay la soo darsay xanuuno kala duwan, xaaladeedana waa ay ka sii dartay, taas oo ka dhalatay cadaalad darada lagula kacay,\" ayuu intaa raaciyay.\nBishii March, Ms Hammadi waxaa loo gudbiyay xabsiga dhexe ee Sanca, halkaas oo ilaalada ay ugu yeereen \" dhillo\" iyo \"addoon\", sababtoo ah maqaarkeeda madow iyo asalkeeda Itoobiya, ayuu yiri qareenkeeda.\nHammadi waxa ay isku dayday in ay is disho 2021-ka, waxaa sidaasi xilligaasi sheegay kooxaha xuquuqul insaanka.\nBishii March, Ms Hammadi waxaa loo gudbiyay xabsiga dhexe ee Sanca, halkaas oo ilaalada ay ugu yeereen \" dhillo\" iyo \"addoon\", sababtoo ah maqaarkeeda madow iyo asalkeeda Itoobiya, ayuu yiri qareenkeeda.\nWaxaa dhalay hooyo Itoobiyaan ah iyo aabbe Yemeni ah, Xammadi waxay internetka soo galisay tobonnaan sawiro ah  iyada oo ku labisan dharka hidaha iyo dhaqanka, Jiinis ama jaakad maqaar ka sameysan, mar ay xiran tahay Xijaab iyo mar aysan xirneen-ba.\nWaxay ku leedahay kumanaan taageerayaal ah baraha Instagram iyo Facebook.\nSida laga soo xigtay hay'adda xuquuqul insaanka ee Human Rights Watch , Hammadi waxay  ka shaqaynaysay muddo afar sano shaqada modelka waxayna ka qeyb qaadatay jillinka filim taxani ah oo telefishin ku yaalla dalka Yemen ka baxi jiray.\nAmnesty International waxa ay sheegtay in markii la xiray Xammadi \"la waraystay iyada oo indhaha laga xiray, dhibaato jireed loo geystay, lagula-na  kacay aflagaado cunsuriyad ah laguna qasbay in ay ' qirto' dambiyo dhawr ah – oo ay ku jiraan inay haysato maandooriye iyo dhillaysi\".\nTacadiyada ka dhanka ah haweenka gaar ahaan deegaanada Xuutiyiinta ay maamulaan ayaa sare u kacday kadib markii dalka Yemen uu sanadkii 2014-kii ka dhacay dagaal sokeeye oo ay Qaramada Midoobay sheegtay in ay abuurtay xaalad bini'aadantinimo tii ugu darneyd.\nXarigeeda iyo maxkamadeynteeda waxay soo bandhigtay cadaadiska Xuutiyiinta ee haweenka iyo tacadiyada lagaula kaco .\nXuutiyiinta ayaa tan iyo markii ay dhacday dowladdii dhexe ee Yemen waxay dagaal kula jireen dowladda caalamku aqoonsan yahay\nIsbaheysiga Sacuudiga uu hoggaamiyo oo ay ku jiraan Imaaraadka Carabta ayaa sanadkii xigay galay dagaalka Yemen iyagoo isku dayaya inay soo celiyaan dowladda.\nDagaalkan ayaa ahaa mid sanadadii u dambeeyay la isku mari la'aa,, waxayna  Xuutiyiinta heshiis la galeen Sucuudiga oo joojiyay weeraradii ay ku hayeeny Xuutiyiinta .",
  "date": "2025-10-27",
  "scraped_at": "2025-10-29T17:27:29.208986+00:00",
  "category": "news",
  "text_hash": "45effb4ee85619acf5395d81dc24527c937d04b8586d5b18a62bc110b6a0323b",
  "minhash_signature": "8892383,6468740,15017927,8919639,3500406,22946524,4029410,6997095,5218208,1218365,9505638,782219,16459807,1843734,44007770,158568,8884993,1974660,11675994,16032897,819244,4495846,1944642,1523057,1405161,1535496,13464076,11561949,4193588,10642074,7190134,13791330,3280475,1286020,156161,5760445,306188,1253175,12925539,16583779,9319695,5721393,2332805,6226799,24452605,5562875,29152418,6195641,317203,4965499,4767507,5926718,6828749,4923620,18114453,24814058,748062,11813461,7482901,4397095,11649997,25336845,2779949,10245216,5859545,1867648,5613821,4426578,7572954,5941259,4671750,4186021,14953688,18993158,3650633,4174485,12103702,19745258,16425217,24825983,6847792,6720464,4451499,237804,14877559,14904515,8580943,2555974,1424334,15405922,7914604,1636521,6455148,4279956,24534487,81233,3322621,4891451,2500743,11445539,88795,31788400,14850236,9402840,9137980,2055493,18049111,7801212,1175530,618551,6359861,14112551,11653990,3069491,9751277,13470721,2250374,1969058,26289130,1910955,582261,2870158,7173002,2792724,14736946,4098881,10363655,23066415"
}