{
  "url": "https://www.bbc.com/somali/articles/c0l7zjn5r7eo",
  "title": "Aabaha qoyskii dhawaan lagu laayey Galgaduud oo oo saluugsan xukunka maxkamadda",
  "text": "Xigashada Sawirka, Baraha Bulshada\nAxmed Maxamuud Canshuur oo ah aabaha qoyskii dhowaan lagu laayay Gobolka Galgaduud, gaar ahaan seddex gabdhood oo uu dhalay iyo hooyadood  ayaa BBCda u sheegay in uu kasoo hor jeedo isla markaasina aanu qaadaneyn xukun ay dhawaan ridday maxakamadda gobolka Galgaduud kaas oo la xiriira rag loo soo qabtay dembigaas, isagoo sheegay in sida xukunka loo riday uu madmadow ku jiray.\nMaxkamadda Gobolka Galgaduud oo xukunka soo saartay ayaa sheegtay in aan la helin caddeymo dhab ah oo muujinaya in eedeysanayaasha ay geeysteen dembigaas waxaana ay dhanka kale ku xukuntay eedeeysanayaasha kala ah, Cabdi Cismaan iyo Gallad Axmed Xuseen tacsiir shan sano xabsi ah, halka Ayuub Maxamed Cabdi lagu xukumay saddex sano.\nMaxkamadda ayaa sheegtay in ciddii aan ku qanacsaneyn xukunka maxkadda ay u furantahay Racfaan muddo soddon maalmood ah.\nHaddaba aabaha qoyska ayaa BBCda uga warramay dareenkiisa iyo waxa uu ku diidanyahay xukunka, isagoo marka hore ka hadlaya dareenkiisa ayuu sheegay  in warka ah in la dilay qoyskiisa uu soo gaaray habeen saq dhexe ah  oo la hurdo isagoo jiifa meel seddex Kiloomitir u jirta xaafadda uu xabdda ka maqlay meel ku aadan xaafadda ay deganaayeen qoyskiisu kadibna markii uu xaafadda yimid u arkay dadkii xaafadda joogay ,qoyskiisa oo dhintay oo rasaas lala dhacay .\nAxmed Maxamuud Canshuur waxa u sheegy in arintaasi ay ahayd arrin fool xun oo aan ku wanaagsaneyn dhaqanka Soomaaliyeed iyo diinta Islaamka ahna wax lala yaabo. Dadka dhintay ayuu ku sheegay in ay ahaayeen afar qof sedex qof iyo hooyadood, kuwaas oo kala ah Sahar Cartan Xirsi oo hooyada ah, Nuurta Axmed Maxamuud, Xaawo Axmed Maxamuud, iyo Faa'iso Axmed Maxamuud oo gabdhahiisa ah.\nEnd of Ugu akhris badan\nMar la weeydiiyay aabaha in ragga ay dowladdu u soo qabatay dilka in uu wax aqoon ah u lahaa iyo in kale, waxa uu yiri \" haa marka hore deris baan ahayn, dad aan is naqaan ayey ahaayeen\" isagoo sheegay in dadkaasi lagu soo qabtay caddeymo ay dowladdu dhexdooda ka heshay.\nAxmed waxa uu sheegay in dowladdu u yeertay oo ay ku tiri raggii u eedeeysanaa dilka qoyska in maxkamad la saarayo sidaasna uu ku yimid maxkamadda.\nIn kasta oo Maxkamadda Galgaduud ay sheegtay inay dembi ku waysay raggaasi eedeeysanayaasha ah aabaha ayaa misna ku dooday in caddeymihii iyo marqaatiyaashii la keenay maxakamadda aanay suurta gelin in raggaasi lagu xukumo dembiga ah in ay dileen qoyskiisa.\nMar la weydiiyay aabe Axmed sababta ay u suurta geli weysay in raggaasi lagu xukumo in lagu helay dembiga ah in ay iyagu qoyska dileen waxa uu yiri aniga oo maleysanayo in raggaasi la xukumo ayey maxakadu igu tiri \"kitaabkan mar\" dadkaan in ay dadkii qoysakaada dilay yihiin ku dhaaro ama kitaab ayaa ayaga lamarsiinayaa ka dibna  iridda ka bax\".\nXigashada Sawirka, Facebook\nAabaha ayaa ku doodaya in arintaasi aanay xaq ahayn isagoo intaa ku daray dadkiisa in la dilay inay caddahay, dadkii dilayna ay ku caddaatay isagana aan dhaar xaq loogu lahayn.\nWaxa uu ku dooday in caddeymo sax ah la keenay maxkamadda sida marqaatiyaal, dadkii aasay qoyska, fuuqa ama qarashka rasaasta la riday ee dadka lagu laayey  oo aan soo qaaday buu yiri kadib markii ay dowladdu ii dirtay, dabadeedna waa la isku fiiriyay buu  yiri waana is lahaadeen\" intaas oo caddeyn ah markii lasoo maray oo wax lagu qaadan karo, waa ay suurta geli weysay in raggaasi sharciga la mariyo ayuu yiri aabaha qoyska.\nMar la weeydiiay Axmed maadaama uu caddeymahaas uu hubo sababta uu ugu dhaaran waayey Maxkamada in raggaasi ay dilka geeysteen waxa uu sheegay in aanu isagu dhaar lahayn isagaoo sheegay in sababta uu ugu dhaaran waayey ay tahay in la yiri waxa aad leedahay diyo \"dadkaasina waa ay ii caddaayeen in ay dadkeyga laayeen, iyadoo la igu yiri in markii aad dhaartana diyo ayaad leedahay\".\nAxmed waxa uu sheegay in arinkaasi aanu weli dhamaan oo uu taagan yahay, isagoo sheegay in dowladda  gaar ahaan madaxweynaha Galmudug uu arinkan dib eegis ku sameeyo.\nAxmed waxa uu sheegay in aanu diyaar u ahayn in uu isagu dad islaameed uu dilo dembigii lagu sameeyay dadkiisa oo inuu sidaasi sameeyo aanu diyaar u ahayn \"nin muslim ah ayaan ahay, xoog iyo xumaan wax ku dooni maayo\" ayuu yiri Axmed oo intaas ku daray in dowladiina ay wax u qaban weysay, dad islaam ah in u dhibaateeyana aanu diyaar u ahayn sidaas darteed uu gurigiisa iska aadayo.\nWaxa aan isku daynay in aan xiriir la sameeyno maamulka maxkamada Galgaduud si aan wax uga weeydiino eedaahaasi loo jeediyay hasa yeeshee nooma suuro gelin in aan helno.",
  "date": "2025-10-20",
  "scraped_at": "2025-10-29T17:17:29.032164+00:00",
  "category": "news",
  "text_hash": "c9a14f8ebded0e409993bd7412c931b3f1e0281430f93ca7b70d1ee5d830a433",
  "minhash_signature": "4802811,2122211,10138177,12824210,8016811,972279,3442114,3497272,15609604,8498114,2229113,2684664,8368725,1750036,545858,21211890,4334407,2771514,1127657,7025773,19742218,363663,2436370,810653,1497576,653739,5157897,11987840,1218788,5383420,308737,7648307,404062,2780819,4170277,7258268,2557194,1394788,8882451,8880263,1458724,88947,2842580,844615,8099829,7884442,17740530,2960501,1849122,2724475,1192147,23752801,11470484,285825,12775283,6180154,7520618,5313216,2558758,99036,670172,9966662,12927855,1402302,26425277,400631,9308627,18602416,1689362,6263986,3374125,5145992,2045768,6234316,5841451,1626423,5614528,1232779,3921600,4028739,13523191,9694641,794348,3056092,10418084,13985024,2059044,8702736,8245005,3935221,92055,868741,16345494,12485721,6377710,563398,2172701,8878816,19914184,5746052,7357062,6579145,18189777,345766,13417080,4592065,3736599,16653834,2431800,10499830,25846833,14766619,162097,8483451,522204,21082987,14796799,7373,1093992,36829874,490303,20459306,7968521,3448380,2688208,4199596,5642027,481562"
}