{
  "url": "https://www.bbc.com/somali/articles/ckg12g4nw4eo",
  "title": "Xiriirka gaarka ah ee hogaamiyihii mucaaradka Kenya ee geeriyooday Raila Odinga uu la lahaa Somaliland",
  "text": "Xigashada Sawirka, Xafiiska Afhayeenka M JSL\nFG: Qormadan dib ayaa loo cusboonaysiiyey.\nWaxaa dalka Hindiya ku geeriyooday hogaamiyihii mucaaradka Kenya, marna noqday ra'iisul wasaaraha dalka Raila Odinga.  Wuxuu ka mid ahaa dad aan badnayn oo lagu tiriyo inay qaabeeyaan siyaasadda Kenya.\nMuddo 40 sano ka badan ayuu siyaasadda ku soo jiray. Kenya marka laga soo tago xiriir fiican ayuu lahaa caalamka iyo gobolka.  Somaliland oo hadda ka hor uu booqday waxay ka mid tahay meelaha aadka looga taageero, oo uu xiriirka dhow lahaa siyaasiyiintooda.\nBishii Juun ayaa booqasho waxaa ku yimid Kenya madaxweynaha Somaliland Cabdiraxmaan cirro oo ay markaas magaalada Nairobi kaga munaaqashoodeen sidii uu Raila ugu ololayn lahaa in ay Somaliland aqoonsi hesho.\nWar kasoo baxay afhayeenka madaxweynaha, Xuseen Aadan Cige, ayaa lagu sheegay in kulanka diiradda lagu saaray hagaajinta xiriirka labada dhinac oo dhinacyo kala duwan ah, sida nabadda iyo ammaanka, waxbarashada, isdhaafsiga dhaqan iyo qeybo kale.\nEnd of Ugu akhris badan\nLabada hoggaamiye ayaa sidoo kale ka wada hadlay arrimaha Afrika, iyagoo ku baaqay xal ay Afrika hoggaamiso iyo horumar loo dhan yahay.\n\"Waxa xusid mudan in Mudane Raila Odinga uu muddo dheer ahaa saaxiib dhaw iyo taageere mayal-adag oo ay Jamhuuriyadda Somaliland leedahay.\"\n\"Intii uu socday kulanka ayaa labada hoggaamiye waxa ay ka wada hadleen sidii loo dardargelin lahaa loona xoojin lahaa xidhiidhka soo jireenka ah ee ka dhexeeya labada Jamhuuriyadood ee Somaliland iyo Kenya, iyo sidii ay labada dhinac iskaga kaashan lahaayeen xagga dhaqaalaha, isku socodka, aqoonta iyo arrimaha isteraatejiga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nMadaxweynaha Somaliland ayaa dhankiisa uga mahadnaqay \"saaxiibtinimada soo jireenka ah ee uu Raila Odinga la leeyahay Somaliland iyo taageeradiisa\".\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nRaila Odinga oo dhexdhexaadiye weyn ka ah Bariga Afrika ayaa horey meelo fagaaro ah uga taageeray qadiyadda aqoonsi raadinta Somaliland, isaga oo ugu baaqay Golaha Fulinta Midowga Afrika inay u aqoonsadaan Somaliland dal madaxbanaan.\n\"Midowga Afrika wuxuu u baahan yahay inuu xaqiiqda ku baraarugo oo aysan suurtogal ahayn in labadan dal aan la isku keeni karin oo aan hal loo aqoonsan karin,\" ayuu yiri sanadkii 2020. \"Somaliland waa xaqiiq ay tahay caalamka inuu ku baraarugsanaado\" ayuu intaa raaciyay.\nRaila Odinga oo sidoo kale ahaa siyaasiga ugu faca weyn siyaasiyiinta Kenya islamarkaasna muddo dheer xabsi ku jiray gudaha Kenya waxa uu isku tilmaami jiray in uu yahay saaxiib dhow ee madaxweynihii labaad ee Somaliland Maxamed Xaaji Ibraahim Cigaal, oo ay isbarteen xilliyadii uu Cigaal xubinta ka ahaa dowladdii rayidka Soomaaliya oo uu Raysal wasaare ka noqday iyo dowladdii kacaanka oo uu la shaqeeyay.\nXigashada Sawirka, Xafiiska Afhayeenka M JSL\nSomaliland waxay ku tilmaantay Geerida Ra'iisul Wasaarihii hore ee Kenya iyo Hoggaamiyihii Mucaaradka  dalkaas Raila Odinga, saaxiib qaali ah iyo siyaasi ruug cadaa ah oo qaddiyadeeda u ololayn jiray oo ay wayday.\nWakiilkii hore ee Somaliland u joogay dalka Kenya Baashe Cawil Xaaji Cumar, oo la hadlay BBC-da ayaa sheegay in Raila Odinga uu door weyn ku lahaa xidhiidhka Kenya iyo Somaliland, iyo suurt ogalinta xafiisyada labada dhinac ee ka furan Nairobi iyo Hargeysa.\nKenya ayaa markii hore joojisay qorshaha ay jamhuuriyadda goonni isu taaggeeda ku dhawaaqday ee Somaliland ku dooneysay inay xafiis diblomaasiyadeed uga furato magaalada Nairobi ee caasimadda Kenya.\nWarsaxaafadeed ka soo baxay wasaaradda arrimaha dibadda Kenya, ayaa lagu sheegay in dowladda federaalka Soomaaliya ay u aqoonsan tahay dal madax bannaan, isla markaana aysan ogolaan karin in Somaliland ay xafiis diblomaasiyadeed ku yeelato magaalada Nairobi.\nSomaliland, waxay gooni isu taageeda ku dhawaaqday sanadkii 1991-kii, balse ma helin aqoonsi ballaadhan oo caalami ah oo ku saabsan madax-bannaanideeda\nKenya ayaa sheegtay in ay sii wadi doonto xiriirka ay la leedahay Somaliland, balse ay u aqoonsantahay dowlad-goboleed ka tirsan Soomaaliya, isla markaana ogolaansho ka hesho Soomaaliya.",
  "date": "2025-10-16",
  "scraped_at": "2025-10-29T17:42:30.113866+00:00",
  "category": "news",
  "text_hash": "f0dfb947a759e575e125ab6b2f860688d102a23bb4277298d0270af6a797c239",
  "minhash_signature": "338416,23563525,5005283,3746621,18486880,3224043,8187241,1832648,11894394,22099407,3392584,15541947,1923274,2363318,2049181,4560947,3073255,1598257,11705254,12012505,11560589,10563474,1223471,12404719,866287,1635976,7201983,5955403,5458945,1298047,7584054,435406,3886131,50093,18508675,11821589,4600804,2820412,16836640,2550250,9149304,5673898,20153692,13344810,8655243,3426978,3055268,5196131,8381596,1560228,5372561,4555217,2237935,5525111,10666341,25036951,4570312,2358552,37743937,3821203,3981199,3638009,24496773,6515008,13576450,11459765,8136791,1197757,17380246,1373941,2774130,15072331,407954,7180517,21663289,7095493,2994126,19240817,10213410,3002908,1686597,606751,12968297,7457640,2653449,7740674,10386917,9669744,2313993,971898,13143609,6998090,17956185,3353129,1803738,14426260,4647353,4797486,8138489,3064540,4693170,2974186,5805317,5513287,32212081,3120422,3475001,12572109,989753,8871279,514869,20591562,35498783,976240,15900270,24578533,592141,3228341,2770536,6393517,4445502,2606507,488004,6520954,3356636,15970085,2046335,11847488"
}