{
  "url": "https://www.bbc.com/somali/articles/cx2p35208nzo?at_medium=RSS&at_campaign=rss",
  "title": "Sidee looga falceliyey in baarlamaanka Jabuuti uu meesha ka saaro xadka da'da madaxtinnimada?",
  "text": "Xigashada Sawirka, Facebook/Ismail Gualleh\nQaar ka mid ah xisbiyada mucaaradka ah ee Jamhuuriyadda Jabuuti ayaa ka hor yimid tallaabadii shalay baarlmaanka dalkaasi ay wax kaga beddeleen dastuurka dalkaas.\nSi gaar ah, waxay ansixiyeen shalay qodob meesha ka saaaraya xaddidaadda da'da madaxweynaha taas oo u gogol xaadhaysa in markii lixaad uu xilka u tartami karo Madaxweyne Ismaaciil Cumar Geelle.\nMucaaradka ayaa ku doodaya in madaxweynuhu uu horey u ballan qaaday in aanu dastuurka wax ka baddel ku sameyn doonin hase-yeeshee ay hadda arrintaasi dhacday.\n\"Dastuurka waxaa laga dhigtay shaadh marna yaraysanaya, marna la ballaadhsanaayo, markii ugu horreysay ee la beddelay waxay 2010 oo dano gaar ah loo beddelay, hadanna isla sidii uun baa loo beddalay\" ayuu BBC-da u sheegay Khadar Cabdi Ibraahim oo ah guddoomiyaha Xisbiga Model.\nMadaxweyne Ismaaciil Cumar Geelle ayaa haatan jira da'aadda 77 jir.\nEnd of Ugu akhris badan\nDhammaan 65 xildhibaan ee goobta joogay ayaa Axaddii u codeeyay in la tirtiro xadka da'da ee 75 sano, taas oo u oggolaanaysa hoggaamiyahan muddada dheer xilka hayay inuu ka qayb galo doorashooyinka la qorsheeyay bisha Abriil ee 2026.\nGo'aankan ayaa u baahan oggolaanshaha madaxweynaha oo ay ku xigto codsi labaad oo baarlamaanka ah labada Noofambar, ama afti qaran.\nGeelle, ayaa xukumayay dalkan ku yaalla Geeska Afrika tan iyo 1999, markaas oo uu xilka kala wareegay Xasan Guuleed Abtidoon, madaxweynihii aasaasay dalkaas.\nXannibaaddan dastuuriga ah ayaa waxaa la soo rogay 2010-kii iyada oo uu Geelle isagu hoggaaminayay dib-u-habeyntan cusub oo ay ku jirto in la tirtiro xadka muddo-xileedka madaxweynaha, balse sida oo kalena la dhimo muddada xilka lixda sano ilaa shan sano.\nGuddoomiyaha Golaha Wakiillada, Dileita Maxamed Dileita, ayaa isbeddelka difaacay isaga oo ku tilmaamay mid lagama maarmaan u ah ilaalinta xasilloonida gobolka oo qalalaase ka jiro. Wuxuu sheegay in taageerada dadweynuhu ay dhaaftay 80 boqolkiiba, inkastoo BBC aanay si madax bannaan u xaqiijiso sheegashadan.\nXigashada Sawirka, SOCIAL\nMucaaradka ayaa se sheegay dhankooda in arrintaas aanay wax ba ka jirin dadkuna xaalkan ka xumaadeen.\n\"Hadalka Guddoomiyaha Baarlamaanka waa mid siyaasadeed, siiba barobagaando, laakiin runtii marka xaqiiqada la taabto reer jabbuuti way kacsan yihiin, way cadhaysan yihiin, mana aqbalayaan mana doonayaan in dastuurkooda la taataabto\" ayuu BBC-da u sheegay Khadar Cabdi Ibraahim.\nGeelle ayaa ah hoggaamiyaha saddexaad ee ugu muddada dheer Bariga Afrika, wuxuu ku xigaa Yoweri Museveni-ga Uganda oo xilka hayay ku dhowaad 40 sano, iyo Isaias Afwerki-ga Eritrea oo talada haya muddo gaaraysa 27 sano.\n\"Madaxweynuhu wuu ku khasaaray siyaasaddii dalka gudahiisa, waayo dadka reer Jabuuti boqolkiiba 42 waxa ay ku nool yihiin saboolnimo xadka dhaaftay, dhallinyaraduna waa shaqo la'aan, waxaana ay ka fikiraan sidii ay dalka ugu tahriibi lahaayeen, markaa isbeddel iyo qof leh siyaasad kale oo cusub baa loo baahan yahay\" ayuu ku dooday Khadar.\nXigashada Sawirka, SOCIAL\nGo'aanka baarlamaanka Jabuuti ee laalay xadka da'da ee musharrixiinta madaxweynenimada ayaa dhalisay falcelin xooggan oo ka imanaysa shacabka gudaha iyo dibadda dalka, gaar ahaan baraha bulshada. Xilli doorashada la qorsheeyay bisha Abriil 2026.\n\"Waqtigii Jabuuti ay toosi lahayd waa yimid, aan dhahno 'maya muddo-xileed lixaad. Waxaan samayn karnaa sida dhalinyaradii Madagascar,\" ayuu yiri Xaakim, arday 24 jir ah\n\"Keliya afgembi dimuqraaddi ah ayaa ka badbaadin kara Jabuuti riyadan madow. Tani waa wax la yaab leh oo aan la rumaysan karin. Waan ka daalnay,\" ayay baraha bulshada ku qortay Xaawa, haweeney u dhaqdhaqaaqda xuquuqda bulshada.\n\"Codbixinta baarlamaanka ma aha wax igu cusub,\" ayay tidhi Sonia Le Gouriellec, oo ah khabiir ku takhasustay Geeska Afrika.\n\"Waxaa jira mudaharaadyo baraha bulshada ka socda, balse waxaan ka baqayaa in mucaaradku uusan heli doonin meel uu isku muujiyo gudaha Jabuuti, oo ah dal cabudhsha xorriyadda hadalka iyo saxaafadda.\"\nDhankiisa, Guddoomiyaha Golaha Wakiillada, Dileita Maxamed Dileita, ayaa sharraxay in isbeddelka dastuuriga ahi uu muhiim u yahay \"ilaalinta xasilloonida dalka, oo ku yaalla gobol ay ka jiraan caqabado amni,\" isagoo tixraacaya dalalka deriska la ah — Soomaaliya, Itoobiya, iyo Eritrea.\nDastuurka dalka ayaa hore u sheegayay in qof ka weyn 75 jir aanu ka qayb gali karin doorashada madaxtinnimada, taasoo hor istaagtay madaxweynaha hadda jira, oo 77 sano jir ah, inuu u tartamo muddo-xileedkiisii lixaad ee doorashada soo socota.",
  "date": "2025-10-27",
  "scraped_at": "2025-10-29T17:11:28.681086+00:00",
  "category": "news",
  "text_hash": "32f44920c969ee41f220f9911a067b8a7a195268a42613af9a05663e9c69b783",
  "minhash_signature": "22089188,10649034,12608699,7180394,7417181,14271004,14228800,6334414,4019459,3283897,13175366,7735664,4581803,28890439,4855979,2575618,16424616,10774366,11870552,1393294,12215812,4090426,7500705,9978276,3230537,15119159,435706,84042,4301261,5635751,10523914,12873613,12501477,4605682,157142,3860602,9248975,857487,25112870,3530820,3022804,16130133,2075112,8092413,1538710,15445709,4761798,28396428,545675,6268823,11628945,27584663,3826964,621068,3187102,946658,25694126,16976447,6595485,7523259,17105482,2083480,10881869,5997368,16165893,3774382,4429997,2839409,803920,5268278,10935359,6955447,1033530,6736292,287755,855752,15213099,3134119,5976385,32794,1858929,8290207,5505967,17617089,176932,6646811,6986244,894181,3001646,3501737,3481419,10060207,2422906,1126628,34221445,1247,19630295,2002302,1227812,1958014,2021490,3832414,2609440,13349589,1316625,19979233,11659018,2333362,453063,4730586,1009201,1668128,1053392,8286316,9420426,6147614,2076266,1319114,4549592,21152434,10518056,14169614,11459364,925539,13661598,579141,5619493,3989064"
}