{
  "url": "https://www.bbc.com/somali/articles/cgkzj371nk0o",
  "title": "Maxaad ka ogtahay dadka garaadka macmalka (AI) u adeegsanaya inay 'Alle' kula hadlaan",
  "text": "Xigashada Sawirka, Prashanti Aswan\nDalka Hindiya iyo qeybaha kale ee caalamka, dadka cibaadeysanaya ayaa u weecanaya dhanka AI loo sameeyay hab ujeeddo leh iyagoo u isticmaalaya cibaadadooda diimeed. Maxaa dhacaya marka mashiinnadu ay noqdaan dallaalkeenna cusub ee ruuxiga ah?\nVijay Meel, oo ah 25 jir arday ah kuna nool Rajasthan, Hindiya, ayaa markii ay ka hor yimaadeen su'aalo iyo caqabadaha nolosha casriga ah u weecday dhanka Alle. Markii hore wuxuu la tashan jiray hoggaamiyeyaasha ruuxiga. Dhawaanahanse, wuxuu la tashi la sameeyaa GitaGPT.\nGitaGPT waa mashiin garaadka macmalka ah (AI) oo lagu tabobaray Bhagavad Gita, 'buugga barakeysan' ee Hinduuda. GitaGPT wuxuu u muuqdaa farriin-qoraaleed caadi ah oo aad weydaarsan lahayd saaxiib – marka laga reebo AI-du waxay kuu sheegeysaa inaad la sheekeysaneyso Alle.\n\"Markii aan kasoo bixi waayay imtixaanaadkeygii bankiga, waan murugooday,\" Meel ayaa sidaa yiri. Balse kadib markuu u weecday GitaGPT, wuxuu ku qoray faahfaahinno ku saabsan xasaradaha hoose ee uu wajahayay wuxuuna codsaday talada AI. \"Diiradda saar ficilladaada iskana daa ka walwalidda mirahooda,\" GitaGPT ayaa sidaa yiri. Tan, iyo hagid kaleba, waxay Meel ka dhigtay mid dareemaya dhiirranaan iyo firfircooni.\n\"Ma aysan i dhaheyn inaanan ogeyn, balse xilligaas, waxaan u baahnaa qof mar kale ii sheega,\" Meel ayaa yiri. \"Rogaal-celintan ayaa iga caawisay inaan dib u eego waxaan ka fekerayay billaabana inaan mar kale isu diyaariyo.\" Wixii intaa ka dambeeyay, GitaGPT waxay u noqotay sida saaxiib, uu la sheekeysto mar ama abo toddobaadkiiba.\nEnd of Ugu akhris badan\nAI waxay qaabeyneysaa sida aan u shaqeyno, wax u baranno una jeclaanno. Waxaase soo kordhaya, inay sidoo kale qaabeyneyso meelaha qaar sida aan u cibaaneysanno. Dadka cibaadeysanaya ee diimaha ugu waaweyn dunida ayaa tijaabinaya mashiinnada. Balse Hinduism, oo muddo dheer lagu yaqaannay ilaahyada ay caabudaan oo si toos ah qofku ugu hor cibaadeysanayo, ayaa soo bandhigeysa isku dhafka iimaanka iyo teknolojiyadda. Iyadoo AI ay taabaneyso qeyb walba oo nolosheenna ah, Hindiya ayaa laga yaabaa inay tooshka ku ifiso waxa ay ka dhigan tahay in arrimaha diinta lagala sheekeysto mashiinnada hadlaya.\n\"Dadku waxay dareemaan inay ka go'doonsan yihiin bulshada, duqeyda iyo macbadyada. Dad badan, inay AI kala hadlaan Alle waa hab ay u dareemaan lahaansho, ee keliya maaha dhanka diinta,\" ayuu yiri Holly Walters, oo arrimaha diinta wax ka dhiga kana tirsan Wellesley College oo Mareykanka ku yaalla, kaasoo bartay walxaha barakeysan, xajka iyo dhaqamada diimeed ee Koofurta Aasiya. In AI lagu dabbaqo diinta waa mid aan laga fursan karin, ayuu yiri Walters. \"Waxaanan leeyahay lagama fursan karo sababtoo ah haatanba way jirtaa.\"\nDhowrkii sano ee la soo dhaafay waxaa la arkay tijaabooyin badan oo diimeed oo AI ah. Sannadkii 2023, barnaamijka AI ee loo yaqaan Text With Jesus ayaa sababay baaqyo ka hor imaansho ah sababo la xiriira in la ogolaaday in AI lagala sheekeysto diinta.\nIsla sanadkaas, App-ka QuranGPT oo loogu talagalay in uu ka jawaabo su'aalaha iyo hagid ku saleysan kitaabka quraanka ayay dad badan kusoo jabeen, waxaa la sheegay in dadka oo ka tan batay awgeed uu hallaabay maalin gudaheed markii la furay. AI waxay xitaa saldhig u ahayd diimaha oo dhan, sida kaniisadda Future, oo ah koox uu bilaabay injineerkii hore ee Google, Anthony Levandowski, kaas oo rajeynaya inuu horumariyo oo kor u qaado aqoonsashada Alle oo \"ku salaysan sirdoon macmal\".\nLaakiin waxyaabaha gaarka ah ee cibaadada Hinduuga ayaa ka dhigaya kiis gaar ah oo xiiso leh. Dhaqan ahaan halka waxyaabaha muqadaska ay yihiin kuwo la arki karo lana taaban karo, teknolojiyaddu waxay noqon kartaa mid taa beddesha, Walters iyo kuwa kale ayaa sidaa leh.\nMarkii ChatGPT iyo waxa laga sameeyay AI ay kor u kacday, tiro ka mid ah hal-abuureyaal ganacsi, kuwo daacad u ah iyo kuwa xiiseeya tignoolajiyada ayaa lagu dhiirigaliyay inay dhisaan chatbots kuwaas oo kaa dhigi doona inaad si toos ah ula falgasho waxyaabaha ay dhigeen \"ilaahyada kala duwan ee Hinduga\" - oo ay ku jiraan AIs badan oo dhammaantood loo yaqaan GitaGPT. Vikas Sahu, oo ah arday ganacsiga barta oo ka yimid Rajasthan, Hindiya, wuxuu horumariyay GitaGPT oo mashruuc dhinac ah oo isaga u gaar ah. Wuxuu filayey inuu si tartiib tartiib ah u bilaabmo, laakiin Sahu wuxuu sheegay in adeeggu uu helay 100,000 isticmaale oo aad u badan maalmo yar gudahood.\nTan iyo markaas, way sii ballaaratay waxaana ka abuurmay chatbots ku salaysan qoraallada kale ee Hinduuda ee noocyada AI ee ilaahyada kale. Sahu waxa uu sheegay in uu rajaynayo in uu \"u qaabeeyo jidka loo maro waxbarista \"ilaahyada [Hindu]\". Waxa uu sheegay in uu isaga tegay jaamacaddii uu dhiganayay si uu maalgelin ugu raadiyo mashruuca.\nXigashada Sawirka, Google\nInta badan ururro-diimeedyada ayaa u bogaya isbeddelka. Horraantii 2025, Sadhguru, oo ah khabiir caan ah oo Hindi ah ahna aasaasaha Isha Foundation, ayaa daah-furay \"Maskaxda Cajiibka\" oo ah app qalwo lagu sameeyo oo ay ku jiraan dhowr qeybood oo AI ah. \"Waxaan u adeegsaneynaa AI inay xikmadihii hore dadka u gaarsiiso qaab ku saleysan waxa hadda dhacaya.\nMa aha keliya in app-ka laga dhigo mid caqli leh, balse waa in khibradda laga helaa mid shakhsiyadeed oo la aamini karo,\" ayuu yiri Swami Harsha, oo ka tirsan Isha Foundation. \"Waxyaabaha ku jira app-ka waxaa ka mid ah waxa ku xusnaa buugga Sadhguru muddo 35 sano ah oo wax laga beddelay, si farriinta ku habboon loo gaarsiiyo qof maalintaas u baahan.\" App-ka ayaa la sheegay inay soo dejisteen hal milyan oo qof muddo 15 saacadood gudahood ah markii la daah-furay.\nAI waxaa sidoo kale loo adeegsadaa baaritaanka ruuxiga iyo kan cilmiyeed. Daraasad la sameeyay sanadkii 2022 ayaa lagu adeegsaday is barbardhigga waxyaabaha ku qoran kutubta Hinduuda.\nKhubarrada ayaa sheegaya in AI sidoo kale loo adeegsan karo soo bandhigidda micnaha qotada dheer ee ku duugan kutubtaas oo aan akhrinta caadiga ah lagu ogaan karin, ayna micno cusub u abuuri karaan qoraallada barakeysan.\nKhatarta waa taas – marka aaladahan loo arko codad ruuxi ah, erayadooda waxay xambaarsanaan karaan miisaan ka weyn intii ay ahayd – ayuu yiri Holly Walters\nSida uu qabo Walters, AI waa uun wax lagu kordhiyay qaababka ay Hinduism iyo teknolojiyaddu horeba iskula falgeli jireen.",
  "date": "2025-10-20",
  "scraped_at": "2025-10-29T17:38:29.926485+00:00",
  "category": "news",
  "text_hash": "4508b6e7558ba7dd5db654d6536349d30706ff4a2ce9928bcea08acc35c29326",
  "minhash_signature": "1004344,2715604,3726832,3263894,9171502,2029183,14687611,51999,13435690,1266748,7550236,886806,8197630,589495,7363820,2907171,283737,324279,217203,1572858,1260150,10097504,1068771,830691,5113,4124278,15168441,10390381,7388339,2867253,3259876,3826906,14566,5399966,1036560,3396637,1785280,5596375,6386310,1737287,1226373,2541253,4261077,512577,523703,1222336,7261,4847382,2946535,12176202,4539798,15724957,5996072,2377145,6200957,17222250,604150,241922,920392,4758898,3351650,5990076,7117152,20733234,879644,55022,1461043,839024,3421709,17515206,115628,10840700,8577723,1289544,225083,10723591,115252,5929840,9715095,13555107,170885,3540960,15241934,20048608,11943830,1738820,1524552,6290390,12838840,13035156,8040846,6125505,5606078,1535971,173859,11599662,12323960,32147,1492760,4572100,1790655,16195715,6618346,454914,5635766,15677460,1987593,533074,7589543,274244,6286383,4493785,2339514,2137501,8635982,1430292,7434363,491897,2623618,289451,262356,3896795,2406423,30065,270203,322605,3518470,2013242"
}