{
  "url": "https://www.bbc.com/somali/articles/cy0pl10rzp8o",
  "title": "Muxuu yahay isu imaatinka bani'aadannimo ee ugu weyn adduunka ee ka dhacaya Hindiya?",
  "text": "Xigashada Sawirka, Ankit Srinivas\nMalaayiin qof ayaa isugu tegay magaalada waqooyiga Hindiya ku taalla ee Prayagraj ee gobolka Uttar Pradesh, si ay uga qeyb qaataan isu-imaatin-la bani'aadannimo ee ugu weyn adduunka.\nRag dambas soo marsaday oo qaarkood qaawan, dhanka diinta Hinduudana laga barakeysto, ayaa ka qeyb galaya munaasabadda Kumbh Mela, iyagoo isugu tegay webiga ay barakeystaan ee Ganges, si ay ugu qubeystaan.\nDadka oo sita boorar lagu xardhay erayo diimeed, iyo sanamyada Hinduuga ayaa isku tuurayay biyaha barafka ah.\nMarka ay kasoo baxaan biyaha, qaar ayaa gacmaha kusoo qaata carrada midabka qalinka leh iyagoo marsanaya jirka.\nKuwo badan ayaa sidoo kale sitay seefaf.\nEnd of Ugu akhris badan\nRaggaas la barakeysto – oo loo yaqaanno Naga sadhus – waxaa la socda malaayiin reer Hindiya ah oo adduunka isaga kala yimid kuwaasoo ku sugan Prayagraj si ay uga qeyb galaan munaasabaddan loogu magac daray isu imaatinka bani'aadannimo ee ugu weyn adduunka.\nMaanta oo u ah maalinta qubeyska waa maalinta labaad ee munaasabadda Kumbh Mela oo 12-kii sanoba mar la qabto. Galabta xilliga dalkaas, ilaa 16 milyan ayaa galaya webiga si ay ugu qubeystaan. Saraakiisha ayaa sheegay shalay oo maalinta koowaad ahayd, in  16.5 milyan oo qof ay webiga ku qubeysteen.\nIn ka badan 20 milyan oo qof ayaa la filayaa inay maanta ka qeybqaataan caado-diimeedyada halkaasi laga sameynayo iyadoo ilaa 400 oo milyan oo qofna ay ka qeybgeli doonaan 45-ta maalmood ee soo socota, sida ay sheegee saraakiisha dalkaas.\nDadka Hinduuga ayaa aaminsan in caado-diimeedkan ay ka dhaqi doonto dembiyada ayna naftoodana nadiifin doonto.\nXigashada Sawirka, Ankit Srinivas\nBooliiska ayaa la daalaa-dhacaya xakameynta dadka tirada badan ee maanta isugu tegay halkaas iyadoo kumannaan ay u suurto-gashay inay isugu tagaan meelo loogu talo-galay dad gaar ah.\nMahant Prayag Puri Ji oo kasoo jeeda deegaanka Juna Akhara ayaa maamulka ku eedeeyay jileec iyo inay xakameyn waayeen qulqulka dadka.\n\"Waa nala riixay oo nalaga saaray marka aan dooneynay inaan qubeysanno,\" ayuu yiri. \"Aad ayaa loo buuxiyay dadkuna anshax ma lahayn. Waan dhacay lugaha ayaana dhaawac iga gaaray. Inaan halkaas ka cararo ayay noqotay oo aan nafetyda badbaadsado.\"\nCaado-diimeedka maanta ee qubeyska, oo lagu magacaabo Shahi Snan – ama qubeyska boqortooyada – ayaa waxaa yimaada rag dadka siinaya talooyinka iyo waxa laga doonayo.\nImaatinkooda waxay wax weyn u tahay dadka ku nool gudaha Hindiya iyo adduunkaba kuwaasoo u yimaada inay ka barakeystaan.\nJoogitaankooda ayaa sidoo kale ahmiyad gaar ah u leh dadka tirada badan ee aaminsan in biyaha webiga ay ka dhaqayaan dembiyada.\nXigashada Sawirka, Uttar Pradesh government\nWaxaa jira lix maalmood oo la jecel yahay in la qubeysto, sida ay go'aamiyeen ragga laga barakeysto, waxaana lagu saleeyaa meerayaal gaar ah. Waxayna kala yihiin:\n13 January: Paush Purnima\n14 January: Makar Sankranti\n29 January: Mauni Amavasya\n3 February: Basant Panchami\n12 February: Magh Purnima\n26 February: Maha Shivaratri\nXigashada Sawirka, Ankit Srinivas\nSaddex ka mid ah kuwan – waa 14 iyo 29 January, iyo 3 February – waxaa loo asteeyay maalmaha loo yaqaanno Shahi Snan waana maalmaha ay qubeystaan raggan laga barakeysto.\nIsu imaatinka ugu weyn ayaa la filayaa inuu dhaco 29 January markaas oo 50 ilaa 60 milyan oo dad cibaadeysanaya la filayo inay biyaha galaan.\nXigashada Sawirka, Ankit Srinivas\nMaamulka gobolka ayaa magaalo weyn oo teendhooyin lagu xardhay ka sameeyay qarka webiga taasoo dherersan ilaa 4,000 hiktar si ay hoy ugu noqoto ragga laga barakeysto, dadka kale iyo weliba dalxiisayaasha booqashada u tegay.\nAsal ahaan xafladda ayaa salka ku haysa sheekada khuraafaadka ah ee ku saabsan dagaal u dhexeeyay sanamyada iyo shayaadiinta ee Kumbh (dheri) dareere macaan uu ku jiro kaas oo soo baxay intii laga goobayay bad-weynta.\nXigashada Sawirka, Ankit Srinivas\nMarkii ay labada dhinac ku dagaallameen dareeraha ku jiray dheriga, dhowr dhibcood ayaa soo daatay oo ku dhacay afar magaalo - Prayagraj, Haridwar, Ujjain iyo Nasik.\nKumbh mela waxaa laga abaabulaa dhammaan afarta magaalo, balse xafladaha ugu weyn ayaa had iyo jeer lagu qabtaa Prayagraj.",
  "date": "2025-01-14",
  "scraped_at": "2025-10-29T17:31:29.416480+00:00",
  "category": "news",
  "text_hash": "6cb0d3819607c959f915f356e67c9369fa43020e9dc03feb679a0f883dcf1ed4",
  "minhash_signature": "98350,15505614,1162197,2415140,5843677,5709428,12828286,5063557,463782,1841859,1843640,681851,1151866,3820165,2693228,1046180,948960,1820327,6885120,2176808,2176434,5327550,4857836,13192138,6271955,4062751,1775773,28995776,19986865,5382590,7196890,13846784,6121465,761439,3164804,24129788,6668254,8599894,8678369,6424421,1437476,26125215,5433898,7288781,4320818,3227847,1460132,6927090,1180055,4849204,4122578,2279365,16435473,4619164,3063150,1542430,5780400,1402280,4795734,15860310,3023916,2515453,23978,927122,2037741,20386485,8710020,9400825,4043809,5138872,1101825,24483616,4885536,9605229,11917560,194134,2732652,8319345,14123512,8470072,1733051,8555804,3235068,1444135,5699009,98145,3102562,2286305,1961622,1393287,1770063,1115508,9678345,8382100,7591056,11919622,2086166,2801394,1492760,8259742,7825447,2182689,3890641,339610,19778565,7492946,804124,2875755,1525639,5345713,14367154,610182,448018,2199905,1803189,10147496,9073896,5026110,3870698,4771502,5406883,2870158,14585027,9277044,1973906,3837552,8223129,4470467"
}