{
  "url": "https://www.bbc.com/somali/articles/cm2nmmmvlr4o",
  "title": "Najma Nashaad oo ka hadashay \"quruxdeeda dabiiciga ah ee dadku ku tilmaamaan iyo tan codkeeda\"",
  "text": "Xigashada Sawirka, Social\nNajma Cabdinaasir Ciise oo loo garan ogyahay Najma Nashaad waxa ay ka mid tahay fanaaniinta Soomaaliyeed ee sida weyn u soo shaac baxay sanadihii dambe.\nWaa fanaanad ay dad badani aad u jecel yihiin marka ay noqoto codkeeda, muuqaallada heeseheeda iyo waliba qurux dabiici ah oo dadku ku tilmaamaan.\nHeesaha ay qaaddo oo u badan jacayl ayaa la arkaa in dhallinyaro badani ay aad ula dhacsan yihiin marka laga eegayo dhinaca baraha bulshada.\nNajma Nashaad taageerayaasheedu waa kuwo kaliya ka garanaya shaashadaha weliba xilliga ay heeseyso, balse waxaa jirta taariikh nololeed iyo waxyaabo xasuus u leh nolosheeda oo aysan dad badani wax badan ka ogeyn.\nNashaad oo wareysi kooban siisay BBC-da goor sii horreysay ayaa sheegtay in ay ku dhalatay magaalada Nairobi ee dalka Kenya, oo ay ku barbaartay magaalada Galkacyo dhinaca Puntland, halka sidoo kale ay nolosheeda in badan oo ka mid ah ku qaadatay magaalada Hargeysa ee Somaliland.\nEnd of Ugu akhris badan\n“Anigu waxa aan ku dhashay dalka Kenya taas oo aysan dad badani ogeyn, waxa aan ku barbaaray magaalada galkacyo, waxaana ku noolahay magaalada Hargeysa, runtii si kale marka loo dhigo waxa aan oran karaa waxa aan ahay Soomaali Sujuu Soomaaliya ku koray”.\n“Dad badan waan ka taariikh ficanahay oo marba haddii aan Kenya ku dhashay, Galkacyana ku koray oo aan cabay biyihii Bardcad Hargeysa harwanaagna aan ku koray dee dabcan taariikhba iima harin”, ayey sii raacisay Najma Nashaad.\nNashaad oo sidoo kale mar wax laga weydiiyay quruxda iyo soo jiidashada gaarka ah ee dadku tilmaamaan ayey arrintaasi uga jawaabtay qaab uu kaftan ku dheehan yahay.\nXigashada Sawirka, Facebook/Najma\n“Marka ay noqoto quruxdayda iyo waxa ay dadku iga yiraahdaan, runtii waxa ay ka mid tahay hadallada igusoo noq-noqda, laakiin anigu marka aan is qiimeeyay dee dadka ayaan la mid ahay, iima muuqdaan wax gaar ah”, ayey tiri.\nWaxa ay sheegtay in qof kasta oo uu ilaahay dhameystiray lixaadkiisa uu qurux badan yahay, dadka sida gaarka ah, “dadka ugu sii fiirsada ee weliba ku yiraahda ma qurux badnid dabcan iyaga ayey wax ka qaldan yihiin” ayey sii raacisay.\nWixii ugu farxadda badnaa ee ay dunida kula kulantay ayey ku tilmaantey maalintii ay hooyo noqotay, isla markaana uu u dhashay wiilkeeda curadka ah.\nNajma Nashaad waa ooridii hore ee fanaan Cawaale Dayr oo wiilkeeda aabbihii ah iyaga oo mar si wadajir ah u soo wada shaac baxay.\nHeesaha ugu caansan ee qaadday waxaa kamid ah heesta halku dhiggeedu yahay ‘Arki maysid’ oo uu sameeyay abwaan Cabdiraxmaan Xaaji, laxankana uu ku laray Cabaas Hiraad.\nErayada heesta waxaa kamid ah:\nArki maysid ilamadan qubi jiriyo oohintaydii\nArki maysid kalsoonidii ambatiyo aaminkaygiiye\nArki maysid ammaantaydii hore iyo ololahaygiiye\nArki maysid intaan oran jiriyo erayadaydiiye!\nArki maysid ogaalkaad lumisay iyo ilaalintaydee\nMana arkaysid xiskii oofin jiray amarradaadiiye!.\nXigashada Sawirka, Facebook/Najma\nHeestaasi waxaa barta Youtube ka daawaday ku dhawaad 17 milyan oo qof iyadoo muuqaalka heesta uu muujinayo jilliin ka turjumaya erayada.\nNajma ayaa jacayl u qaadday wiil dhallinyaro ah oo wajigiisa laga dheehan karo duruuf fara badan, halka iyadu ay ka soo jeeddo qoys ladan.\nUgu dambeyn wiilka ayey is guursanayaan, waxa ayna ku noolaaneysaa guri ay ka muuqato duruufta wiilka ay is calmadeen, waxaase jirta in qoyskeedu ay dayriyeen welibana aabeheed uu dhowr jeer u gacan qaaday intii aysan wiilka is guursan si ay u kala uga harto.\nUgu dambeyn ninka ay nolosheedii ladneyd uga soo tagtay ayaa noqonaya mid dayacay oo aysan ka helin wax farxad ah sidaana waxa ay ugu soo noqneysaa reerkii ay ka dhalatay, waana tan ka turjumeysa heeska ‘Arki maysid’.\nXilligii ay fanka ku soo biirtay Najma waxa ay sheegtay in ay cajiib u ahayd marka ay dad khabiirro dhanka fanka ah ay ku yiraahdaan alleyhe waad soconeysaa oo meel sare gaarsii fankaaga sida ay iyaduba sheegtay.",
  "date": "2024-09-08",
  "scraped_at": "2025-10-29T17:16:30.318033+00:00",
  "category": "news",
  "text_hash": "991a3ead31e80496fc6573f93cd5f90abd8ff541909c60bdf9191033ee8234ef",
  "minhash_signature": "130188,10742106,3488264,26138997,6521443,4916641,6575592,9864872,24998282,4924119,13053363,11071399,150718,15036481,19252706,3803669,6869728,5881526,19473435,7921330,14518068,3705878,6265838,11972366,6534558,2854113,12515247,30786134,18708941,9875576,7022372,1450365,1961717,2288703,3293915,30363715,1889077,975983,4314375,495470,7040484,18778282,5917721,7567422,5853134,3657682,16063348,22324637,4848575,17499711,2319668,3334150,1628586,13322181,487734,562777,15244412,14238935,9589382,1275464,592502,11125538,6179065,8848575,7386874,1990410,572695,2174218,14492640,1264138,21510662,10239778,921971,4401622,7550111,338801,2277904,17887391,2569988,5941271,17325804,3294866,1875342,4703720,1752510,2154769,136220,11261198,12777401,10760494,9163378,1553562,11817528,339417,12078152,4251178,7803453,2838471,1492760,39316139,3035741,19617668,21635,2103354,2378088,32195551,2316965,14917279,7096251,1756984,3159476,2671938,13010432,4582949,4852094,6852417,4609504,4243821,264880,8341678,5861593,902115,3966745,655819,1249614,5185850,3772393,4534076"
}