{
  "url": "https://www.bbc.com/somali/articles/cwypnyjk9zro",
  "title": "Yaa ku guuleystay El Clásico-dii la ciyaaray 123 sano ka hor, maxaase caawa laga filayaa?",
  "text": "Xigashada Sawirka, FC Barcelona\nWaa mid ka mida kulamada loogu daawasho badan yahay caalamka iyo ciyaar u dhaxaysa laba kooxood oo xifaaltan dheer u dhaxeeyo Real Mardid iyo Barcelona.\nCaawa ayaa la filayaa in fiidkii hore ay kooxda Real Madrid garoonka ku soo dhaweysay kooxda Barcelona ciyaar ka tirsan horyaalka Laliga ee dalka Spain.\nWaxaanse dib u eegaynaa taariikha kulankan gaar ah ee aadka loo jecelyahay.\n13-kii Maajo, 1902, kooxda FC Barcelona — oo la aasaasay laba sano iyo bar ka hor — ayaa markii ugu horreysay tagtay caasimadda Madrid, si ay kulan ula ciyaarto koox maxalli ah oo cusub oo la aasaasay laba bilood ka hor, FC Madrid.\nMaalintaas cidna ma ogeyn in ciyaartaas ay noqon doonto bilowgii waxa markii dambe isu beddelay xafiiltankii ugu weynaa taariikhda kubadda cagta adduunka.\nEnd of Ugu akhris badan\nKooxda Catalonia, tani waxay u ahayd kaliya ciyaar \"caadi ah oo fudud\" oo ka tirsan tartanka, iyaga oo ku socda dhinaca finalkii aan laga maarmi karin ee ay la ciyaari lahaayeen Athletic Bilbao, oo markaas loo tixgelin jiray kooxda kubadda cagta ee ugu fiican Spain.\nBooqashadan waxay timid xilli semi-final-ka Koobka Coronation Cup, kaasoo lagu qabtay si loogu dabaaldego Boqor Alfonso XIII kadib markii uu gaaray da'da lix iyo toban jirka, oo markaas loo aqoonsanaa \"da'da qaangaarka,\" isla markaana si rasmi ah u qabtay waajibaadkiisii boqornimo ee Boqortooyada Spain.\nTartankan wuxuu ahaa tartankii kubadda cagta ee ugu horreeyay ee ay ka qeyb galaan kooxo ka kala yimid guud ahaan Spain.\nFC Barcelona waxaa aasaasay 1899-kii koox dhalinyaro ajnabi ah oo deggan magaalada, taasoo ka dhalatay caannimada kubadda cagta iyo ciyaaraha kale ee Ingiriiska ee guud ahaan Yurub.\nKahor kulanka ay la ciyaareysay Madrid, Barcelona waxay laheyd labo sano oo waayo aragnimo ah oo kubada cagta ah iyadoo ka qeybqaadatay Copa Macaya, tartan u dhexeeyay naadiyada Catalan oo socday 1900 ilaa 1903.\nKooxda kubadda cagta ee Madrid waxaa aasaasay injineerka Isbaanishka ah Julián Palacios, oo loo aqoonsaday madaxweynihii ugu horreeyay ee Real Madrid xilligaas  ay weli ahayd koox aan rasmi ahayn intii u dhaxaysay 1900 iyo 1902. Lixdii Maarso, 1902, Palacios wuxuu xilalkii u wareejiyay Juan Padrós, ninka si rasmi ah u aasaasay naadiga.\nMarkii Clásico-dii  ugu horreeyay ee labada koox  dhexmartay ay dhacday, kooxda Catalonia waxaaa u ciyaarayey laba ciyaartoy  oo Swiss ah, hal ciyaartoy oo Jarmal ah, iyo saddex ciyaartoy Ingiriis ah, halka Madrid — oo markii dambe noqotay Real Madrid sanadkii 1920, uu ciyaaray hal ciyaartoy oo ajaanib ah.\nKooxda Madrid ayaa sidoo kale lahayd khibrad tartan oo xadidan, iyagoo dhawr kulan oo saaxiibtinimo la ciyaartay kooxaha kale ee caasimadda.\nCiyaartoyga ajaanibka ah ee kaliya ee Los Blancos  — kuwaas oo tan iyo maanta xirta dharka cad — Arthur Johnson, ayaa dhaliyay goolka ugu horreeya ee ciyaarta, isaga oo noqday ciyaartoygii ugu horreeyay ee taariikhda El Clásico gool ka dhaliya. Laakiin ciyaartu waxay ku dhamaatay Barcelona oo ku guuleysatay 3-1.\nGuushan awgeed, kooxda Catalonia waxay u soo baxday finalka tartanka, halkaas oo ay la ciyaari lahaayeen kooxda Basque-ka ah, Athletic Bilbao, oo ugu dambeyn ku guuleystay horyaalka. Tartankani sidoo kale wuxuu calaamadeeyay koobka ugu horreysay ee waxa hadda loo yaqaan Copa del Rey.\nXigashada Sawirka, Getty Images\nIsku dhacyadii u dhexeeyay dhammaan kooxaha Isbaanishka ayaa sii socday sannadihii xigay. Intii u dhaxaysay 1902 ilaa 1916, Madrid iyo Barcelona waxay kulmeen toddobo jeer, iyadoo Barcelona ku guuleysatay shan kulan, halka labo kulan ay ku dhamaadeen barbaro.\nSi kastaba ha ahaatee, \"khilaafkii\" dhabta ahaa ee u dhexeeyay labada kooxood ee Real Madrid iyo Barcelona wuxuu bilaabmay markii ugu horreysay ee muran garsoor uu ka dhashay kulankoodii sideedaad.\nLabada kooxood ayaa ku ballansanaa inay ku kulmaan is arag oo labada guri ah oo laba lug ah. Barcelona ayaa lugtii hore gurigeeda ku badisay laba iyo hal bishii Maarso sanadkii 1916-kii halka Real Madrid iyaduna lugta labaad ku badisay todobaad ka dib, 4-1.\nMaadaama qaabka tartanka waqtigaas uusan ku salaysnayn farqiga goolasha, ciyaar dheeri ah ayaa loo qorsheeyay 13-kii Abriil, taasoo noqotay mid ka mid ah khilaafaadyadii ugu da'da weynaa ee labada naadi loo diiwaangeliyay.\nGaroonka Campo de O'Donnell ee Madrid ayaa loo xushay inuu martigeliyo ciyaarta, waxaana garsoore loo magacaabay José Ángel Berraondo, oo ahaa ciyaaryahan hore oo Real Madrid ah.\nIntii ay ciyaartu socotay Berraundo waxa uu saddex rigoore u dhigay kooxdiisii hore ee Madrid,waxana uu u diiday gool ay la timid Barcelona.\nGoolhayaha Barcelona ayaa labo rigoore ka badbaadiyay, laakiin ciyaaryahankii Santiago Bernabéu oo markii dambe loogu  magac daray  garoonka Real Madrid ayaa dhaliyay goolkii seddexaad daqiiqadii 118aad. wuxuuna ciyaarta ka dhigay 6-6.\nMadrid ayaa u soo baxday finalka ay la ciyaari lahayd Athletic Bilbao, kaasoo lagu qabtay garoonka Barcelona, halkaasoo qaar ka mid ah taageerayaasha ay wateen boorar cambaareynaya garsoorka Berraondo.\nKooxda Madrid ayaa finalka ku guuldarreysatay iyadoo kulankaasi ku dhamaaday  0-4, waxaana qaar ka mid ah taariikhyahannada kubadda cagta Isbaanishka ee xilligaas sheegay in ciyaartoyda Madrid lagu tuuray dhagaxyo iyagoo ka baxay garoonka.\nXigashada Sawirka, Getty Images\nHoryaalka Isbaanishka ee aan maanta u naqaano La Liga ayaa la aasaasay sanadkii 1929, waxaana kulamada u dhexeeya labada koox noqdeen kuwo joogto ah.\nSanadihii 1950-meeyadii iyo 1960-meeyadii, Real Madrid waxay xoojisay booskeeda xooggan, iyadoo ku guuleysatay shantii koob ee ugu horeysay ee Yurub ee isku xigta, laga soo bilaabo 1956, iyadoo ay ugu mahadcelineyso ciyaartoydii loo tixgeliyey halyeeyo sida Alfredo Di Stéfano oo Argentine-Isbaanish ahaa  iyo Ferenc Puskás, oo Hungarian ahaa.\nXafiiltanka u dhexeeya Real Madrid iyo Barcelona ayaa sidoo kale bilaabay inuu qaato wajiyo cusub, iyadoo xidiga u dashay Holland Johan Cruyff uu hogaaminayay kooxda Catalonia bartamihii 1970-meeyadii, halka ciyaaryahanka Jarmalka Paul Breitner uu ku jiray safka Real Madrid, oo ay garab joogeen ciyaaryahanada Spanishka ahaa Spain Vicente del Bosque iyo Goyo Benito.\nSanadihii xigay, labada koox waxay sii wateen inay safafkooda ku soo kala daraan xidigaha ka soo jeeda dalalka kale ee Yurub iyo wadamada Latin America sida Argentina iyo Brazil.\nReal Madrid waxay soo maratay waqtigii loo yaqaanay \"Galacticos\"  oo ahayd intii u dhaxaysay sanadihii  2000 iyo 2006, xilligaasoo ay kooxda ay ku soo biireeen xidigo waaweyn oo ka yimid dibadda Spain, oo ay ku jiraan Luis Figo oo ka yimid Portugal, Zinedine Zidane oo Faransiis ah, Ronaldo oo Brazil ah, iyo David Beckham oo Ingiriis ah.\nSidaas oo kale Bareceona waxay la timid magacyo caan ah sida Ronaldinho oo Brazil ah, Samuel Eto'o oo Cameroon ka soo jeeda, Thierry Henry oo Faransiis ah, iyo Yaya Touré oo Ivory Coast ah\nLabada xiddig ee shiday El-Clásico isla markaana kaalinta kowaad ka galay tartamada kubbada cagta aduunka ayaa kala ahaa Cristiano Ronaldo oo Portugal u dhashay iyo Lionel Messi oo Argentina u dhashay, kuwaas oo ku kala guulaystay abaal marinta Ballon d'Or wakhtigoodii Real Madrid iyo Barcelona., taasoo ka qayb qaadatay ballaarinta xiisaha caalamiga ah ee lagu daawado labada koox.\nCiyaartoyda kale ee sidoo kale  ee shiday iyagu waxaa ka mid ahaa Xavi Hernandez, Andres Iniesta, Gerard Pique, Sergio Ramos, Lukas Modric, iyo Karim Benzema.\nXigashada Sawirka, Getty Images\nCiyaartii El Clásico ee ugu daawashada badnayd ayaa la rumeysan yahay inay dhacday 23-kii Abriil, 2017, iyadoo laga baahiyay in ka badan 185 wadan iyada oo ay adeegsadeen in ka badan 50 idaacado caalami ah oo xuquuqda ka haysta Horyaalka Kubadda Cagta Spain (La Liga), taasoo gaartay qiyaastii 650 milyan oo qof.\nLabada kooxood ayaa ciyaaray 261 kulan oo El Clasico tartamada oo dhan ah tan iyo markii la aasaasay horyaalka La Liga, iyadoo Real Madrid ay badisay 105 ka mid ah, Barcelona 104, iyo 52 barbaro.\nGuushii ugu weyneyd ee taariikhda El Clásico waa guushii Real Madrid ay 11-1 kaga badisay Barcelona bishii June 13, 1943, magaalada Madrid. Si kastaba ha ahaatee, natiijadii ciyaartan ayaa weli ah mid muran siyaasadeed oo aad u weyni ka taagan tahay, iyadoo lagu eedeeyay faragalin siyaasadeed kaligii taliyihii Francisco Franco oo xilligaasi xukumayay Spain, kaddib markii uu afgambi milateri ku qaaday dowladdii bidixda ee la doortay, si uu u xaqiijiyo in ciyaartu ay sidaas ku dhammaato.\nSi aan u diiwaan geliyo wixii dhacay maalintaas, qoraaga British-ka ah ee Sid Lowe ayaa ka wareystay Fernando Argilla, oo ahaa ciyaaryahankii ugu dambeeyay ee nool ee ka qaybqaata ciyaarta, buug uu daabacay 2012. Argilla ayaa u sheegay inuu ciyaarta ka daawaday kursiga keydka, maadaama uu ahaa goolhayaha Barcelona ee bedelka ku soo galay.\nWaxa uu intaa ku daray inuu xasuusto sarkaal ka tirsan dawladda oo booqday qolka labiska ka hor ciyaarta: \"Nin booliis ah, gaashaanle, ma aqaano, laga yaabee inay ka tirsan yihiin Ilaalada Madaniga ah.\"\nHadda El Clásico, waxaa mar kale xiiso u yeellay xiddiga kooxda Real Madrid kaga soo biiray Paris Saint-Germain Kylian Mbappé iyo mar la raga kooxda Barcelona ka soo baxay Lamine Yamal.\nLabadooda Lamine Yamal iyo Kylian Mbappé, ayaa iska horyimid siddeed jeer oo laba ka mid ah ay yihiin Qaramada.",
  "date": "2025-10-26",
  "scraped_at": "2025-10-29T17:24:29.260081+00:00",
  "category": "news",
  "text_hash": "a044e39987761fe4608c5ad675101287ee40be5d5e411e2ca473dd6367a743fa",
  "minhash_signature": "3672788,5933174,2248260,2847576,1104654,2888108,1566923,2736826,4635963,2027362,335614,4112403,4514682,2628906,138677,955982,1427506,2015818,251203,2522725,4243399,13633845,1309576,4436629,249669,178387,749943,817603,201707,239088,3894985,59833,4867189,3940271,2089356,4795222,5621881,2245262,1911687,16924825,4371445,2615022,8404151,6961142,1246929,2854754,5397110,3146122,2332788,2561477,2339798,5173931,1656545,4279575,1185339,2982119,6180808,8126144,2749514,2080122,751672,6409478,2379917,4579807,3041905,924892,5776484,5198897,932092,3543897,351853,218856,1134269,7135005,9122723,102557,1465831,294440,5262663,1670226,2999408,51260,1710570,687866,5783808,1037332,4762764,3629260,7817399,922823,13798169,10878004,918295,609703,8661899,183642,922969,1567773,1227304,2141439,1704405,1345222,937231,11518269,6438007,6986234,431328,399894,1046956,2236948,1764272,4356571,1270931,3960356,759821,5475029,4003611,6206801,1808103,690352,936838,4987778,613471,1452198,2468590,1359995,19734990,796157"
}