{
  "url": "https://www.bbc.com/somali/articles/cvg762jjn5no",
  "title": "Nin gantaallo uu ka keenay Iiraan marsiin jiray meel u dhow xeebaha Soomaaliya oo la xukumay",
  "text": "Xigashada Sawirka, US Department of Justice\nShakhsi tahriibinayey hubka kaas oo u adeegsaday doon kalluumeysi inuu kusoo raro gantaallada ballistic-ga ee Iiraan ee uu u waday fallaagada Xuutiyiinta Yemen ayaa lagu xukumay 40 sano oo xabsi ah dalka Maraykanka.\nMuhammad  Pahlawan oo u dhashay Pakistan ayaa lagu xiray howlgal ay ciidamada Mareykanka ka fuliyeen badda Carabta (Arabian Se) bishii Janaayo 2024 – xilligaasi oo ay ku qaraqmeen labo Markab oo Maraykan ah.\nShaqaalihii Pahlawan ayaa ka marag kacay in lagu khiyaamay inay ka qayb qaataan, iyagoo aaminsan inay u shaqaynayeen sidii kalluumaysato oo kale.\nXuutiyiinta ayaa xilligaasi weerarro gantaallo ah iyo kuwa diyaaradaha  aan duuliyaha lahayn ku qaaday Israa'iil, waxayna beegsadeen maraakiib ganacsi oo caalami ah oo marayey Badda Cas iyo Gacanka Cadmeed, iyagoo sheegay inay sidaasi u sameeyeen si ay u garab istaagaan reer Qasa. Iiraan ayaa si joogto ah u beenisay inay hubaynayso Xuutiyiinta.\nMarag furka faahfaahsan ee shaqaalaha doonta ay siiyeen maxkamad ku taal gobolka Virginia ee dalka Maraykanka ayaa bixinaysa muuqaal naadir ah oo ku dhex jira hawlgal tahriib ah oo gacan ka geystay awoodda weerarrada.\nEnd of Ugu akhris badan\nQaybaha hubka ee laga helay doonta Pahlawan waxay ahaayeen \"qaar ka mid ah hababka hubka ee ugu casrisan ee Iiran ay ku sii wado kooxaha kale ee argagixisada\", Dacwad oogayaasha Federaalka Mareykanka ayaa sidaasi sheegay kadib maxkamadeyntiisa.\nEedeysanaha oo 49-jir ah ayaa la xukumay Khamiistii, iyadoo horay loogu helay shan dambi- oo ay ku jiraan dembiyo argagixiso iyo inuu soo raray hubka wax gumaada.\nDukumeentiyada maxkamada ayaa muujinaya xukunka labo ka mid ah shanta dacwadood mark la isku daro ay gaareeyso 240 bilood, ama 20 sano. Saddexda dacawdood ee kale ah 20 sano oo kale - taasoo ka dhigaysa wadar ahaan 480 bilood, ama 40 sano.\nSiddeedda qof ee shaqaalaha doonta ah oo maxkamadda ka marag furay ayaa sheegay in aysan waxba kala socon waxa ku jiray baakadaha waaweyn ee saaran doonta loogu magac daray Yunus.\nMid ka mid ah shaqaalaha markabka ayaa sheegay in markii uu Pahlawan wax ka waydiiyay arrintan, loo sheegay in uu maskaxda ku hayo ganacsigiisa.\nPahlawan, si kastaba ha ahaatee, wuu ogaa sida ay shixnaddu khatar u tahay.\nWaxa uu isku tilmaamay in uu yahay \"qof meyd ah oo socda\" fariin qoraal ah oo ay is dhaafsadeen xaaskiisa, oo la diray maalmo ka hor safarka Janaayo 2024  ee lagusoo qabtay.\n\"Kaliya soo duceey in [aan] ku soo laabanno si nabad ah,\" ayaa ku qornyed farriinta, oo caddayn ahaan loo adeegsaday maxkamadda dhexdeeda.\n\"Maxaa sidan ugu hadlaysaa, 'waxa laga yaabaa in aad soo noqoto ama aadan soo noqon',\" ayay waydiisay.\nPahlawan waxa uu u sheegay xaaskiisa: \"Waxa ay shaqadu ku saabsantahay, gacaliso, nooca shaqada ayaa sidaas ah.\"\nHadalkiisii ugu dambeeyay ee uu kula hadlay intii aanu dhoofin waxa uu ahaa: \"joogteey ducadaada, Alle ha igu geeyo si nabad ah oo nabad ha igu soo celiyo, ee soo duceey\".\nXigashada Sawirka, US Department of Justice\nSafarkan, Pahlawan waxa la siiyay 1,400 oo riyaal ($33,274) - oo ah kharash aad u badan oo dacwad oogayaasha dacwadiisa ay ku tilmaameen \"lacag halis ah\".\nSocdaalku waxa uu ahaa \"qayb ka mid ah hawlgal ballaaran\" oo ay maal-galiyeen oo ay iska kaashadeen laba walaalo reer Iiraan ah, Yunus iyo Shahab Mir'kazei, ayay tiri Wasaaradda Difaaca ee Mareykanka ee xilligaas (oo hadda loo yaqaan Wasaaradda Dagaalka) bayaan ay soo saartay bishii June.\nWalaalaha Mir'kazei ayaa lagu eedeeyay in ay xiriir la leeyihiin Ciidamada Ilaalada Kacaanka Islaamiga ah ee Iiraan (IRGC) - oo ah xoogga ugu awoodda badan Iran. IRGC waxa uu Maraykanku u aqoonsaday urur argagixiso shisheeye.\nLabada shakhsi,  Shahab iyo Yunus Mir'kazei ayaa waxaa dacwad ku soo oogay mas'uuliyiinta Mareykanka, laakiin wali waa baxsad,  waxana la rumeysan yahay inay ku sugan yihiin Iiraan.\nPahlawan waxa uu sameeyay laba safar oo tahriib ah ka hor inta aan la qaban – mid waxa uu ahaa bishii Oktoobar 2023, kan labaadna laba bilood ka dib.\nRagga uu u qoray in ay la shaqeeyaan ayaa dhamaantood kasoo jeeda Pakistan waxayna usoo safreen xadka Iran iyaga oo shaqo raadis ah.\nKa hor inta aysan u dhaqaaqin safarka bishii Diseembar, maxkamadda Mareykanka ayaa dhageysatay, shaqaalaha markabka in loo xilsaaray in ay baakadaha waaweyn ku raraan doonida oo joogtay Chabahar xeebta koonfureed ee Iiraan.\nDabadeed, shan ama lix maalmood ka dib, markii ay badda ku jireen, markii ay u dhawaayeen xeebaha Soomaaliya, shaqaalihii markabka waxay tilmaameen doon kale oo habeenkii soo ag istaagtay taas oo ay ku wareejiyeen xamuul.\nMehandi Hassan oo xubin ka ah shaqaalaha ayaa maxkamadda u sheegay in doonta kale ay saarnaayeen ilaa shan nin, kuwaas oo ku hadlay luqad uusan garaneyn.\nSocdaalkoodii xigay ee bisha ku xigtay aya la filayey in uu maro isla dariiqii hore ee safarka. Sidii hore oo kale, waxa ay ka bilaabatay dekedda yar ee Konarak ka hor inta aanay u shiraacan Chabahar, halkaas oo shaqaalihii markabka lagaga dhigay in ay ku raran yihiin sanduuqyo culus.\nBaakadaha, ciidamada badda ee Maraykanka ayaa mar dambe ogaan doona, in ay ku jiraan qaybo ka mid ah gantaallaha ridada dheer ee ballistic ah oo ay Iiraan samaysay, qaybo ka mid ah gantaallaha maraakiibta ka hortagga iyo hub.\nXigashada Sawirka, US Department of Justice\nTaariikhdu markii ay ahayd 11-kii Jannaayo, shaqaaluhu waxay sheegeen in ay ku baraarugeen guuxa  helicopter dushooda taagan iyo markab ay leeyihiin ciidamada badda ee Maraykanka oo garab taagan. Pahlawan ayaa ka soo baxay qolkii uu ku jiray si uu qof walba ugu sheego \"inuu sii socdo\" oo uusan joojin doonida, isagoo u sheegay in markabka iyo helikabtarrada ay leeyihiin burcad badeed.\nCiidamada Badda Mareykanka oo hubeysan iyo saraakiil ka tirsan ilaalada xeebaha ayaa isku dayay inay fuulaan doonta Yunus. \"Waxaa jiray buuq badan,\" mid ka mid ah shaqaalaha Doonta, Aslam Hyder, ayaa sidaasi u sheegay maxkamadda.\nSarkaalka Gaarka ah ee Dagaalka Christopher Chambers ayaa gacantiisa ay u sibxatay oo ku dhacay biyaha intii uu socday hawlgalka - waxana biyha ku booday sarkaalka kale ee dagaalka ee heerka koowaad Nathan Gage Ingram si uu isku dayo inuu badbaadiyo.\nLabada nin ayaa si aad ah ugu rarnaa qalab, si degdeg ah ayey u qaraqmeen sida lagu ogaaday warbixin gudaha ah oo markii dambe la helay. Meydadkooda lama helin, waxaana lagu dhawaaqay inay dhinteen 10 maalmood ka dib.\nShaqaalihii saarnaa Doonta Yunus ayaa ku sugnaa doonta dusheeda labo maalmood ka hor inta aan loo wareejin markab ay leeyihiin ciidamada badda ee Mareykanka, maxkamaddu waxay sheegtay in loo kala saaray laba kooxood oo lagu hayey laba konteenar oo aan daaqad lahayn.\nPahlawan ayaa ku amray shaqaalihii markabka inay been sheegaan, wuxuuna sheegay in kabtankii uu mar hore baxsaday. \"Wuxuu yiri, 'Ha u sheegina inaan anigu ahay kabtanka, sababtoo ah waxa aan kuu geysan\nkaraa dhaawac halis ah haddii aad sidaas sameysid',\" Aslam Hyder ayaa u sidaasi u sheegay maxkamadda.\n\"Wuxuu bilaabay inuu noo hanjabo... in qoyskeena iyo carruurtu aanay  na arki doonin, mana ogaan doontiin waxa ku dhacay,\" ayuu yiri. \"Markaa aad ayaan u cabsannay, waanan aamusnay\" ayuu yiri Aslam Hyder.\nShaqaalaha markabka ayaa mid mid caddeymo u bixiyay, waxaana laga soo saaray konteenarka , si kali kali loogu wareeysto. Qof kasta oo doonta saarnaa - oo uu ku jiro Pahlawan - ayaa la weydiiyay cidda uu yahay kabtanka, sida ay sheegeen dacwad oogayaasha Mareykanka, Pahlawan \"si fudud ayuu isaga fogeeyay, been ayuu sheegay, oo waa uu is qariyey\".\nMilateriga Mareykanka ayaa sheegay in baakadaha laga helay Doonta Yunus ay ahaayeen hubkii ugu horreeyay ee Iiraan ay keento ee ay qabtaan ciidamada Mareykanka tan iyo markii Xuutiyiinta ay bilaabeen inay weeraraan maraakiibta mareysa Badda Cas dhowr bilood ka hor.\nLaakiin Pahlawan waxa uu marayey waddo ay ka siman yihiin mukhalasiinta hubka u siday Yemen.\nIntii u dhaxaysay 2015 iyo 2023, ciidamada Maraykanka iyo xulafadooda ayaa gacanta ku dhigay ku dhawaad 2.4 milyan oo rasaas ah, 365 gantaalada lidka taangiyada ah, iyo in ka badan 29,000 oo hubka fudud iyo kan dabacsan oo ay wateen doomo yar yar oo marayay Badda Carabta, sida lagu sheegay warbixin ay soo saartay Qaramada Midoobay.\nCaadi ahaan, Kuwa wax tahriibiya ayaa isticmaala nooc ka mid ah doomaha yar yar, inta badanna ah kuwa  kalluumeysiga - si ay shixnad ugu daabulaan meel u dhow xeebaha Soomaaliya.\nXigashada Sawirka, US Department of Justice\nWilliam Freer, oo ka tirsan guddiga Golaha Cilmi-baarista Geostrategy ee UK, ayaa u sheegay BBC News in iyadoo inta badan weerarrada Xuutiyiinta ay ku lug leeyihiin hub yar yar, qaybaha laga helay markabka Pahlawan ay yihiin \"mid aad casri u ah oo aad u xoog badan\".\n\"Si dhaqso ah, inta badan shirkadaha maraakiibta waxay go'aansadeen in ay dhammaan safarkooda maraakiibta u weeciyaan, halka ay suurtagal tahay, agagaarka Koonfur Afrika halkii ay ka gudbi lahaayeen Badda Cas.\"\nSocdaalkan dheer ayaa ku daraya10 ilaa 12 maalmood oo wakhtiga socodka ee safar kasta, iyo shidaal dheeri ah, kaas oo kuwa horey u falanqeyay arinkan ay ku qiyaaseen inay ugu kacayso shirkadaha $1m (£748,735) oo dheeri ah safarka kasta oo wareeg ah.\nMaraykanka, UK, Israel iyo Sucuudiga ayaa Iiraan ku eedeeyeen in ay gantaalo iyo hub kale ugu soo gudbiso Xuutiyiinta dhinaca badda, taas oo jabinaysa qaraarkii Golaha Ammaanka ee Qaramada Midoobay, tan iyo markii kooxda hubaysani ay 10 sano ka hor ka saareen dawladda Yemen ee caalamku aqoonsan yahay inta badan waqooyiga-galbeed ee Yemen, taas oo dhalisay dagaal sokeeye oo ba'an. Iiraan waa ay diiday eedeyntaas.\n5tii bishii Juun ee sanadkan, Pahlawan waxaa lagu helay danbi ah inuu maleegay inuu taageero agab iyo dhaqaalle u fidiyo argagixisada; siinta taageero agab  barnaamijka Ilaalada Kacaanka Islaamiga ah ee Iiraan ee barnaamijka hubka wax gumaada; shirqoolka iyo u daabulka walxaha qarxa ee Xuutiyiinta, iyadoo la og yahay in qaraxyadan loo adeegsan doono in dhibaato lagu geeysan karo iyo in uu u hanjabay shaqaalihiisa.\n\"Pahlawan kaliya ma ahayn tahriibiye khibrad leh,\" dacwad oogayaashu waxay sheegeen, \"wuxuu ogaa waxa uu tahriibinayey iyo waxa loogu talagalay in loo isticmaalo.\"\nQareenka Pahlawan oo codsigii ugu dambeeyay u gudbiyay maxkamadda ayaa qoray in nolosha xaaska Pahlawan ay muddo dheer ka fogaaneyso qoyskeeda, sababtoo ah guurka ay isaga guursatay, iyadoo  tan iyo markii la xiray, nolosheedaa iyo tan ilmaheeda ay noqotay \"mid aad u adag\".\n\"Tan iyo markii ay xukuntay xeer-beegtida, Mr Pahlawan waxa kali ah ee uu diiradda saaray wada-hadalkooda telefoonka waa bad-qabka qoyskiisa,\" ayuu yiri qareenkiisa. \"Kama hadlo naftiisa iyo masiirkiisa, wuu ooyaa isagoo ka welwelaya waxa ku dhici doona xaaskiisa iyo ubadkiisa.\"\nLaakiin maxkamaddu waxay xukuntay in xukunkiisa dheer uu ahaa mid ku haboon dabeecadda iyo duruufaha dembiga iyo taariikhda iyo astaamaha eedaysanaha.",
  "date": "2025-10-19",
  "scraped_at": "2025-10-29T17:44:30.330284+00:00",
  "category": "news",
  "text_hash": "f9e16bfd1d2c1060f2f8113443dd63627e1155271dcdc51d4b51546fb70f94f1",
  "minhash_signature": "2259492,2318450,2147681,3120533,350348,754311,127817,230531,1988219,42257,536856,785635,1157609,6547110,5701102,214331,3076244,1436087,549206,1572858,1535153,3366563,897625,978596,5378014,1650388,577779,6618129,142588,6099931,1180482,3959757,913670,3575638,9036339,3647656,938115,3634706,442418,3829031,1961461,3716440,4368236,5131081,4880838,4367847,1459970,1853868,1276790,4171035,1912406,140689,6561748,2811923,479831,812589,525876,2523903,851380,6095885,1386213,2045447,4131135,530947,12887,3030944,6658093,184740,907351,2070628,209923,5618226,111365,6372863,2867229,2942774,1021846,182888,2798196,365628,2179668,4774747,957672,893988,7647292,2405445,4412967,4438562,5012762,2659275,1699043,2071377,4967567,1602631,903960,296154,277722,255794,1227304,970920,1528062,2566720,996779,156173,76133,26502,605849,45484,621084,1348894,601649,6913122,6785939,2137501,759821,2750244,792718,921702,781391,9147057,6256793,729811,3484818,1104238,2189115,802298,93088,7940111"
}