{
  "url": "https://www.bbc.com/somali/articles/cy687613j13o",
  "title": "BIRI-MA-GEYDO - Waa kuwee dadka dilka ka caaggan",
  "text": "Waxaa soo badanaya dilalka loo geysanayo dadka ku suntan nabadda iyo samafalka oo waayadii hore aan lagu degdegi jirin xasaanadda ay huwan yihiin awgeed.\nDadkan dilka ka caaggan oo loo yaqaan BIRI-MA-GEYDO ayaa isugu jira shakhsiyaad haldoor ah oo bulshada ugu jira kaalimo muhiim ah iyo kuwo u nugul in la dulmiyo, sidaas darteedna bulshadu xil iska saartay ilaalintooda.\nInkasoo ay adag tahay in la helo tirokoob rasmi ah, haddana waxaa la aaminsan yahay in sannad walba Soomaaliya lagu dilo boqollaal qof oo Biri-ma-geydo ah, kuwaas oo aan helin bedbaadadii ay mudnaayeen.\nDadka dilka ka caaggan ee sannadkaan la beegsaday waxaa ka mid ah, foolaadka bulshada iyo 'maato ilmadow' ah oo badankood loo dilay aano qabiil ama ujeeddooyin kale oo aysan mudneyn.\nXigashada Sawirka, Social\nDadka aysan birtu gayin waxaa loo kala saaraa 2 kooxood oo kala ah Biri-ma-geydo joogto ah oo xilli kasta ka caagan in aano loo dilo iyo kuwo xasaanadoodu ku kooban wakhti cayimin.\nEnd of Ugu akhris badan\nBiri-ma-geydada joogto\nHaweenka\nCarruurta\nCulimada diinta\nFarriin sidayaasha\nHoggaanka dhaqanka\nNaafada iyo dadka baahiyaha gaarka ah qaba\nDadka laga tirada badan yahay.\nBiri-ma-geydada wakhtiyeysan\nErgada nabaddoonka ah\nWaayeelka\nDhaawaca\nMaganta\nMusaafirka khabaar moogga ah\nMaxaabiista dagaalka\nXirfadleyaasha dadweynaha u adeega, sida macallimiinta iyo dhakhaatiirta IWM.\nSoomaalidu waxay leedahay xeerar soo jireen ah oo qeexaya xiriirka ka dhexeeya bulshooyinka danwadaagta ah iyo sida loo maareynayo xaaladaha ku xeeran noloshooda. Xeerarkaas waxaa ka mid ah mid xeerinaya badbaadada dadka loo yaqaan Biri-ma-geyda, gaar ahaan xilliyada colaaddahu jiraan.\nHaddaba Abwaan Cali-Deeq Maxamed Xaashi oo aqoon durugsan u leh Dhaqanka Soomaalida ayaa BBC-da uga warramay sababihii keenay in la dajiyo Xeerar Biri-ma-geyda, kuwaasoo ay dejiyeen odayaal hore, ilaa haddana lagu dhaqmo.\n“Xeerka Biri-ma-geydadu wuxuu si cad u qeexayaa dhaqamada ka reebban dhinacyada diriraya, gaar ahaan in aan la iska dilin dadka bulshada waxtarka u leh iyo kuwa nugul.\nUjeeddooyinka laga lahaa sameynta xeerkan way badnaayeen waxaanse ku soo koobayaa 7 qodob oo ku qotomay aragti fog, ku waas oo looga jeedey in looga gaashaanto mahadhooyinka ka dhalan kara dagaallada sokeeye, sida:\nIn la yeesho kala-har, oo dhinacyada colka ah aysan isku talaxtagin, jirtoo dagaalka ay nabadi ka danbayn doonto.\nIn dagaalka aan lagu dilin qof dhinacyada dirirsan iyo ummadda oo dhanba wada anfici kara.\nIn colaaddu aysan sii daba-dheeraan.\nIn dagaalku uusan reebin cadaawad iyo uur-ku-taallo aayaha ma-hadho ku noqda isma-hurtada markaas colka ah.\nIn aan la dilin qof markaas aan halis ku ahayn nolosha qof kale.\nIn aan la galabsan ciribxumada nabsiga iyo habaarka ka yimaadda xeergudubka dagaalka.\nIn la dhawro sharafta beesha oo aan magac xumo loo soo jiidin”.\nXeerka Biri-ma-geydadu wuxuu Soomaalidii hore uga dhignaa digniin ku lammaan hormuudka beelaha dirirtu ka dhexayso, ku waas oo abbaanduulayaashooda kula dardaarmi jirey in aysan xeerka ka tillaabsan.\nTusaale waxaa noogu filan tuducdan soo socota oo Abwaan Jimcaale Jaamac Lugey oo noolaa qarnigii tagey uu sida muuqata kula dardaarmayo col duulaan u geyfan. Wuxuuna asagoo ciidanka garansiinaya habdhaqanka goobta dagaalka yiri:\nGuluf xoogle Xaashoow haddii, la isku soo xoomo\nXamarray fardood goor haddii, xawli lagu fuulo\nXogtaan qabo xusuus hore haddaan, xarafka kuu sheego\nXarrago lagama tago duul haddaad, xinif wadaagtaane\nInkastoo xumaantay faleen, xiisadda abuurtay\nQofkii xeerku kuu diido waa, laga xishoodaaye\nXidid yaan la dilin iyo ergada, xumaha duugaysa\nXaaskiyo cirroolaha ayaan, xumo la gaarsiinnin\nXarbi haddaad gaashaan maatidana, dib u xannaaneeya.\nXigashada Sawirka, Social\nSida ka muuqata gabayga Jimcaale Jaamac Lugey, ka sokow in aan la dilin biri-ma-geydada, waxaa xil gaar ah la iska saari jirey dadka maatida ah ee lagu dul dagaallamo.  Tusaale ahaan waxaana mamnuuc ahayd in awrta la rarto, lo’da iyo ariga la dhaco ama aqalka iyo agabka reerka la qaato.\nLaakiin maanta iska daa maato la xannaaneeyee, waaba lagu faanaa jarriimooyinka laga galo biri-ma-geydada. Waxaana la arkaa dhakhaatiir, macallimiin iyo samafaleyaal loo dilo aano qabiil, sidaasna ay bulsho dhan oo ku tiirsaneyd ay afka ugu dhacaan. Dad bandanna waxay is weydiinayaan waxa dhaqankii suubanaa dooriyey?\nAbuukar Sheekh Axmed Al-Badri oo ah qoraa u dhuundaloola sooyaalka dhaqanka Soomaalida, wuxuu tixgelin la’aanta xeerka Biri-ma-geydada u aaneynayaa jihawareerka siyaasadda dalka oo saameyn taban ku yeeshay hannaankii dhaqanka oo saldhig u xeerar dhaqameedka.\n“Dadku haddey hoggaan quman waayaan wey muunad beelaan. Waxayna lumiyaan waxyaabo badan oo aasaas u ahaa jiritaankooda ummadeed, sida dhaqanka, caadada, hanka iyo wax walba oo ay ku mideysnaayeen”, ayuu yiri Al-Badri oo intaas ku daray in dowladihii dalka soo maray ay ka gaabiyeen in ay Xeerka Biri-ma-geydada ku daraan sharuucda dalka.\n“Xeerka biri-ma-geydadu wuxuu ka soo unkamay miyaga, halkaas oo bulshadu ku dhaqan ay aqoon durugsan u lahaayeen sharuucda ay degsadeen.\nHaddaba markii magaalooyinka la yimid inta badan xeerarkii dhaqanka waa laga tagey. Waxaana kaalintoodi galay xeerar qalaad oo laga dhaxlay nidaamyadii gumeysiga, ku waas oo meesha ka saaray xeerarkii soo jireenka ahaa oo aan ka soo waaqsan kala-guurkii dhacay”.\nAbuukar Al-Badri oo wax laga weydiiyey sida loo caymin karo xeerarka dhaqanka oo bulshada qiime weyn ugu fadhiya, ayaa hoosta ka xarriiqay baahida loo qabo in xeerarka dhaqanka la dabaqo. Wuxuuna ku taliyey in dib-u-eegis lagu sameeyo hannaanka garsoorka dalka, si Xeerar Dhaqameedka loogu dhafo kuwa madaniga ah.\n“Xeerku wuxuu xeer ku yahay in la dhaqangeliyo oo dugsiyada lagu dhigto. Haddiise laga maarmo sida nagu dhacday, waxaa lumaya qiimaha uu bulshada ugu fadhiyo, illaa uu ugu dambeynta ka suuro xasuusta.  Si haddaba loo xaqiijiyo in aan lagu tuman xeerka, waxaa lamahuraan ah in dalka oo dhan laga dhaqangeliyo Xeer Soomaaliga, iyadoo lagu dhafayo sharuucda dalka”.\nIsku soo duuboo, inta badan dadka dilkooda la xarrimay ee ku xusan Xeerka Biri-ma-geydada waxay sidoo kale xasaanad buuxda ku leeyihiin sharuucda caalamiga ah ee la xeeriyo xilliyada dagaalka.\nTusaale ahaan Axdiga Geneva oo la qoray 1949-kii, waxaa ku jira qayb ka hadlaysa xeerka dagaalka ee la tixgeliyo xilliyada colaadaha, kaas lagu tilmaamay mid ka mid ah guulihii ugu waaweynaa ee la gaarey qarnigii la soo dhaafay.\nHaddaba in Soomaalidu leedahay xeer dammaanad qaadaya badbaadada dadka nugul iyo haldoorka bulshada xilliyada dagaalka, kaas oo beelaha Soomaaliyeed muddo dheer ku soo dhaqmayeen, waxay muujinayaa dhaqan suubban oo mudan in la joogteeyo.",
  "date": "2025-10-21",
  "scraped_at": "2025-10-29T17:18:29.656855+00:00",
  "category": "news",
  "text_hash": "c8a58f508e1b1716cc7f85add0fcd2a55eab7faef0e33dbc2f25fbdd0351ee0e",
  "minhash_signature": "15820797,1133190,3635423,1430746,1690632,6129436,3300432,4778124,5968805,3472447,1623230,926569,2350836,347627,6815272,1058296,854270,1243630,7577893,18289365,3218123,2510608,165294,3070577,716677,13665540,2895986,750008,7046838,2599393,2749934,5307650,41921,2505285,4929674,6837111,1433501,5411130,732381,11965572,9958245,3808726,4569335,1123859,3072059,271670,2775935,982580,3967856,5810656,16868659,4072188,473883,2561912,152358,3904984,986952,3344899,2134754,3962422,1598608,3115770,3435504,1379024,5125784,8209362,4109229,2614445,4783603,3151821,3336321,6459787,2457756,4132828,2225792,12913112,2765627,792164,5182844,147092,1071169,666690,4482665,6826621,870042,3935493,997942,7038,4852317,4759786,8768150,4586581,15474367,3453077,2428841,2913523,1993149,3150458,872890,5557542,417367,7103159,2001689,5670,1727021,630727,591463,1120177,5069770,2672926,1566004,730852,5609698,1028065,830370,4972025,211232,2149330,3777520,188075,6627779,3307760,5935017,1646438,9677013,656863,3571176,3006849"
}