{
  "url": "https://www.bbc.com/somali/articles/cm2zp11mymro",
  "title": "Dowladda Soomaaliya oo iska fogeysay inay heshiis qarsoodi ah la gashay Sweden",
  "text": "Xigashada Sawirka, Radio Sweden\nDowladda Soomaaliya ayaa beenisay warar ay dhowaan baahiyeen qaar ka mid ah warbaahinta Sweden, oo ku saabsan inay galeen \"heshiis qarsoodi ah\" oo isku xiraya gargaarka horumarineed iyo dib u celinta muwaadiniinta Soomaaliyeed.\nWar-saxaafadeed kasoo baxay xafiiska raysal wasaaraha Soomaaliya ayaa lagu sheegay in arrintaas aysan waxba ka jirin.\n\"Eedeymahan waa kuwo been abuur ah, marin-habaabin ah, isla markaana aan sal iyo raad toona lahayn. Ma jirto heshiis qarsoodi ah ama shuruudeysan oo Soomaaliya ay la gashay waddan kale oo ku saabsan dib u celinta muwaadiniinteeda Soomaaliyeed.\n\"Xiriirka u dhaxeeya Soomaaliya iyo Sweden waa mid soo jireen ah, kuna dhisan is ixtiraam iyo sharciga caalamiga ah. Dhammaan wada shaqeynta iyo wada xaajoodyada waxaa lagu fuliyaa heer diblomaasiyadeed oo daah-furan iyadoo lagu hubinayo kormeerka Golaha Wasiirrada iyo isla xisaabtanka hay'adaha dowliga ah.\" Ayaa lagu yiri war-saxaafadeedka.\nXigashada Sawirka, aftonbladet\nRadiyoowga madaxa banaan ee dalka  Sweden ee \"Ekot\" ayaa dhowaan daaha ka qaaday in Sweden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya, kaasoo 100 milyan oo karoon oo ka mid ah miisaaniyadda gargaarka lagu wareejiyay mashaariic  la xidhiidha dawladda Soomaaliya.\nEnd of Ugu akhris badan\nTaas beddelkeeda, Soomaaliya waxay aqbashay, sida ay idaacaddaas sheegtay, dib u soo celinta muwaadiniinta u dhashay.\n\"Khatarta musuq-maasuqa dhici karaa waa mid aad noogu cad aniga oo arrimahan ka shaqeeyey muddo dheer\" ayay tiri Wiilo Cabdulle Cismaan, oo sannado badan ka shaqaynaysay arrimaha dib u celinta Soomaalida.\nSida ay idaacaddu sheegtay, heshiiska ayaa la gaaray bishii Diseembar 2023. Musaafurinta qasabka ah ee Soomaalida ayaa aad kor ugu kacday, iyadoo sanadkii hore  la tarxiilay 28 qof, sida ay booliisku sheegeen.\nEkot ayaa shaaciyay in ilo xog-ogaal ah oo ka kala socda Soomaaliya iyo Sweden ay u sheegeen  in dalabka Soomaalida uu ahaa in \"lacagta kaalmada Sweden la geliyo dadka ku hareeraysan xukuumadsda si ay saameyn ugu  yeeshaan si ka duwan, markaad barbar dhigto sida nidaamka mucaawinadda ee caadiga ah loo maamulo\".\nDhanka kale, mid ka mid ah wargeysyada ugu afka dheer Sweden, Aftonbladet, ayaa qoray war kaas la mid ah.\nWargeyska ayaa soo qaatay wiil Soomaali ah oo lagu magacaabo Xasan Cusmaan oo 24 jir ah, kaas oo uu wargeysku sheegay inuu ka mid yahay Soomaalida lagu qasbay inay isaga baxaan dalkaas.\n\"Wuxuu helay warka kadib markii Swden ay heshiis qarsoodi ah la gashay dowladda Soomaaliya. Hadda wuxuu u baqayaa naftiisa.\" Ayuu wargeysku qoray.\nXigashada Sawirka, X\nSweden ma aysan soo saarin faallo rasmi ah oo la xiriirta arrintan, balse khubarrada diblomaasiyadda ayaa sheegaya in wada-xaajoodyada la xiriira socdaalka iyo iskaa u laabashadu ay tahay arrin xasaasi ah oo u dhaxeysa dowladaha Yurub iyo Afrika, gaar ahaanna xilli bannaanbaxyo looga soo horjeedo soo-galootiga ay ka socdaan eybo ka mid ah Yurub.\nMa aha markii ugu horreysay ee ay soo shaac baxaan wararka ku saabsan in Soomaaliya ay heshiis kula gashay dal Yurub ah celinta muwaadiniinteeda.\nMadaxweynaha Soomaaliya Xasan Sheekh Maxamuud oo sanadkii hore booqasho ku tagay dalka Jarmalka iyo dhiggiisa dalkaas ayaa ku dhawaaqay qorshooyin lagu celinayo Soomaalida aan sharciyan joogi karin dalkaas.\nSweden waxay sheegtay in Soomaali kumannaan gaaraysa ay qeyb ka yihiin dadka magangalyada ka helay Jarmalka, kuwaas oo hadda kaalin wanaagsan ku leh horumarka iyo wada-noolashaha guud ee bulsho-weynta dalkaas.\nSanadkii hore dowladda Jarmalka waxay sheegtay dadka la celinayo in ay sidoo kale dan ugu jirto Soomaali badan oo ku nool jarmalka kuwaas oo si fiican dalka u dhexagalay.\nKulankii madaxweynaha Soomaaliya iyo hoggaamiyaha jarmalka dhexmaray wuxuu xiligaas ka sheegay madaxweynaha Soomaaliya in aysan aheyn Soomaaliya dal dagaal sokeeye ku jira oo ay doonayaan in ay ka helaan Jarmalka maalgelin.",
  "date": "2025-10-08",
  "scraped_at": "2025-10-29T17:49:30.904084+00:00",
  "category": "news",
  "text_hash": "1f9d163badc1e01fe08399b323f1c77d3b6d640e6a97598b25daf9340e01e0a5",
  "minhash_signature": "25729628,3270716,12009339,15165304,5941960,12202599,427022,2503477,1730676,4400002,3392584,1770018,5408790,14274848,4679421,5236664,30387957,3843205,13004,6130055,15068615,31698582,27233474,87114,8961076,734431,15513853,2080410,2639467,1820781,1374051,1046546,11515314,7516320,1360121,156119,1170204,2676253,6412508,7841065,107482,5840342,12971138,489677,1525445,2309451,8904874,10749618,1624475,4310936,10409203,1061239,4466446,13267029,217381,1629388,1066730,1994887,1725895,121868,5309293,1393504,7348084,6573470,3682161,12592741,3614949,1538610,4267787,2029293,16919925,3490274,10091252,5272322,11151761,7983001,4949758,8678428,2502508,17508089,6847792,9375588,7692283,8376164,20416013,5955684,14596274,7896826,8263014,75156,1026850,834278,1591692,567110,21512161,19143554,1882295,18682621,1492760,182207,16766996,5444624,1595687,18179211,663565,35779476,3028942,11197258,6989630,4902015,31044532,15623061,4623748,2903045,10572357,4115662,5843657,1902834,9989171,1128111,2336388,2870158,19010495,7696568,3380146,8183957,7460634,11198796"
}