{
  "url": "https://www.bbc.com/somali/articles/c87e8rz0r7go",
  "title": "Maxay dumarku uga kaadi badan yihiin ragga",
  "text": "Xigashada Sawirka, Getty Images\nNolosha maalinlaha ah, waxaa laga yaabaa in aan aragno in dumarku ay si ka badan ragga ugu wareegayaan ama u socdaan.\nDadka qaar ayaa laga yaabaa inay isweydiiyaan in kaadi haysta ragga ay ka weyn tahay tan dumarka?\nJawaabtu waa: Taasi sax ma aha. Sharaxaaddu waa mid wax yar adag, waxayna la xidhiidhaa jir dhiska, dabeecadda, iyo arrimo maskaxeed.\nWaxaa dhici karta in dumarku ay dareemaan rabitaanka ah inay kaadiyaan si ka badan ragga, balse ma jiro farqi weyn oo u dhexeeya cabbirka kaadi haysta ragga iyo dumarka\nKaadi haystu waa bac u eg kubbad hawo ku jirto oo ku taal caloosha hoosteeda Waxay ka samaysan tahay laba lakab oo jidh ah\nEnd of Ugu akhris badan\nLakabka koowaad waxaa loo yaqaan luuqadda Ingiriiska eray ahaan detrusor, kaas oo ah lakabka dibadda, halka lakabka labaadna loo yaqaan transitional epithelium, kaas oo ku yaal gudaha.\nLakabka dibadda ee detrusor-ka waa mid jilicsan oo dabacsan; wuu balaadhan karaa ama wuu is-xidhi karaa sida kubbad hawo ku jirto, taasoo u suurtagelinaysa kaadi haysta inay kaydiso kaadi badan iyada oo aan qofku dareemin cadaadis. Marka ay buuxsanto ayay qofku bilaabantaa inuu dareemo baahi uu ku kaadiyo.\nLakabka gudaha, ee loo yaqaan transitional epithelium, isna wuu balaadhan karaa si uu u qaado kaadida sii kordheysa, wuxuuna sidoo kale ka ilaalinayaa gudaha kaadi haysta sunta iyo kiimikooyinka waxyeellada leh ee ku jira kaadida.\nXigashada Sawirka, Getty Images\nKaadi haystu waa xubin si qurux badan u dhisan oo adkaysi leh, taasoo awoodeeda balaadhinta iyo isxidhitaanka ay la qabsato isbeddelka tirada kaadida iyada oo aan dillaacin ama jabin inta uu qofku nool yahay.\nDhinaca qaab-dhismeedka jirka, isku-mid ahaanshaha u dhexeeya kaadi haysta ragga iyo dumarka ayaa ka badan farqiga u dhexeeya.\nLabaduba waxay kaydin karaan kaadi dhan 400 ilaa 600 millilitir. Unugyada ku wareegsan kaadi haysta ayaa saameyn kara sida qofku u dareemo baahida inuu kaadiyo.\nHalkaas ayeyse kala duwanaanshuhu ka bilowdaa.\nRagga, kaadi haystu waxay uga ku taallaa qaybta kore ee qanjirka prostate-ka, waxayna ku dhow dahay mindhicirka dambe ee u dhow dabada.\nXigashada Sawirka, Getty Images\nDumarka, kaadi haystu waxay uga taallaa meel u dhexeysa lafaha miskaha, meel u dhow ilma-galeenka iyo xubinta taranka ee gudaha.\nMarka haweeney uur leedahay, kororka cabbirka ilma-galeenka ayaa cadaadis saara kaadi haysta, taasoo keenta inay u baahato inay si joogto ah u tagto musqusha mararka qaar ilaa 20 daqiiqo kasta, gaar ahaan seddaxda bilood ee ugu dambeysa ee uurka.\nXitaa marka haweeneydu uur lahayn, ciriiriga booska ku xeeran kaadi haysta ayaa keeni kara inay si degdeg ah u dareento baahida kaadi, marka loo eego ragga.\nCilmi-baadhayaal qaar ayaa muujiyay in haween qaarkood ay si dhakhso leh u dareemaan rabitaanka kaadi, taasoo la xidhiidhata isbeddelka hormoonnada iyo cabbirka meelaha miskaha oo ah halka ay kaadi haystu ku taal.\nMuruqyada ku yaal hoosta miskaha  halka ay ku fadhiyaan kaadi haysta, ilma-galeenka, iyo mindhicirka  waa kuwo aad muhiim u ah.\nDumarka, dhalmada, isbeddelka hormoonnada, ama gabowga ayaa wiiqi kara muruqyadaas, taasoo saameyn karta awoodda kaadi haysta inay xajiso kaadida.\nQeyb kale oo muhiim u ah xakameynta kaadida waa urethral sphincter  waa muruq wareegsan oo u shaqeeya sida qasnadda, kana ilaaliya kaadida inay soo baxdo ilaa qofku diyaar u yahay inuu kaadiyo.\nSi kastaba ha ahaatee, sabab kale oo keenta kaadida oo ku badan dumarka waa caabuqa mareenka kaadida (UTI), taasoo dumarka ugu badan ku dhacda sababtoo ah dhuunta kaadi-mareenka oo gaaban. Caabuqaasi wuxuu keeni karaa in kaadi haystu aad u dareento, waxaana dhici karta in astaamuhu sii jiraan xitaa ka dib marka la daweeyo.\nWaa caado ay tahay gabdhaha yaryar in loo sheego inay tagaan oo ay kaadiyaan, gaar ahaan marka ay da'doodu yar tahay. Waxaana inta badan la baraa inay ka fogaadaan musqulaha dadweynaha.\nTani waxay keentaa caado ah in la faaruqiyo kaadi haysta ka hor inta aysan buuxin, taasoo xaddidi karta awoodda kaadi haysta ee fiditaanka.\nXigashada Sawirka, Getty Images\nDhinaca kale, wiilasha inta badan looma cadaadiyo inay kaadiyaan marka ay yar yihiin.\nKaadi haystu waxay la qabsataa dabeecadaha lagu tababaray.\nTababarka kaadi haysta  oo ay dhiirrigeliso hay'adda caafimaadka ee UK  wuxuu ka kooban yahay in si tartiib ah loo kordhiyo waqtiga u dhexeeya kaadida hadda iyo tan xigta.\nTani waxay caawisaa in si wanaagsan loo habeeyo xidhiidhka ka dhexeeya kaadi haysta iyo maskaxda, taasoo yareyn karta dareenka degdegga ah ee loo baahan yahay in la kaadiyo.\nSidaas darteed, ma aha in la yiraahdo kaadi haysta dumarka way ka yar tahay tan ragga, balse booska fiditaankeeda ayaa kooban.\nHaddaba, kaadi badan oo ku badan dumarka waa natiijo ka timaadda isku darka jir dhis, dabeecad, iyo isbeddelada ku dhaca jidhka haweeneyda waqti ka waqti.\nBarofaysar Michelle Spear waa macallimad caafimaad oo wax ka dhigta Jaamacadda Bristol ee dalka UK.",
  "date": "2025-08-01",
  "scraped_at": "2025-10-29T17:12:28.650276+00:00",
  "category": "news",
  "text_hash": "11d38b54ba68b93382664ed40fde34312e32c9f87f769973ea39fdb3fca8072c",
  "minhash_signature": "4744932,441231,12066323,7854192,1198050,2807522,5438151,3686574,5309781,5059080,1307663,168475,2009935,3720765,2384322,5923797,768725,670124,5146861,1702268,3901443,10455691,9097076,966434,7237949,6825806,3457093,4799643,3235519,10259259,15255493,2351110,4445423,25351076,937916,1223919,3072888,2685667,5872670,18391737,16676381,2946795,2274318,778709,3731415,8418137,2800626,1302645,6871809,5538632,1912406,4906189,2695936,1516837,14547832,15520877,5448827,7439006,7331711,5420151,17391089,750550,185451,6615864,2916517,8609183,7978458,11609823,4563795,23166531,4104096,7108637,5322354,3591494,4306154,1745679,6182595,6927042,312003,2155662,8033033,962192,1133017,10116972,4658249,290671,43372376,5543004,659637,3989503,1570285,9207208,805644,12431988,13881973,5201,5143325,2629202,12837622,787130,3298077,8136612,3920507,4754740,4897568,5655653,714401,1807306,10745997,4690504,18783023,11604218,14597109,2180274,2831116,1059970,2069390,16299690,3603670,9649330,8244838,3213811,4063971,13165713,5218808,12970013,6812126,15489819"
}