{
  "url": "https://www.bbc.com/somali/articles/cg5e0d15d66o",
  "title": "Trump oo toban arrimood ka sheegay Soomaaliya iyo Ilhaan Cumar",
  "text": "Xildhibaanadda Soomaalida ah ee Ilhaan Cumar oo ka tirsan Aqalka Kongareeska Mareykanka iyo Madaxweyne Donald Trump ayaa mar kale u muuqda in ay goradda is geli doonaan, kaddib hadallo kulul oo uu Trump warbaahinta u mariyay saacadihii la soo dhaafay.\nQoraal oo uu soo dhigay bartiisa Truth Social ayaa Mr. Trump waxa uu Ilhaan Cumar ku tilmaamay \"gabadh ka soo jeedda dal sabool ah oo colaado ragaadiyeen islamarkaana isku dayaysa in Maraykanka ay barto sida wax loo maamulo\".\n\"Dalka Ilhaan Cumar ka soo jeeddo ee Soomaaliya, wuxuu la daalaa dhacayaa dawlad-dhexe oo daciif ah, saboolnimo joogto ah, gaajo, argagixiso mar kale soo kacaysa, budhcad-badeed, tobannaan sano oo dagaal sokeeye ah, musuqmaasuq, iyo rabshado baahsan. Boqolkiiba 70 shacabku waxay ku nool yihiin saboolnimo aad u daran waxayna wajahayaan amni-darro iyo cunto yaraan baahsan.\"\nWaxa uu ku eedeeyay in Ilhaan Cumar ay guursatay walaalkeed si ay u hesho muwaadinnamada Maraykanka. Waxa kale tilmaamay in ay dalka Maraykanka ay u yeedhinayso waxa ay tahay in la sameeyo iyo sida loo samaysanayo.\nTrump oo Ilhaan Cumar ku dhaliilaya dalka ay ka soo jeeddo oo muddo dheer ku jiray dagaallo sokeeye ayaa muuqaal gaaban oo ku baahay baraha bulshada waxa uu ku yidhi:\nEnd of Ugu akhris badan\n\"Waxay ka soo jeeddaa Soomaaliya. Sidee bay yihiin hadda? Sidee dowladdoodu tahay? Madaxweyne ma leeyihiin? Golo wasiirro ma leeyihiin? Waxa uun ma leeyihiin? Booliis ma leeyihiin? Waan jeclahay dadka ka yimaadda meel aan waxba lahayn — waxba, gabi ahaanba wax la'aan ah — markaasna ay noo sheegayaan sida dalkeenna loo maamulo\".\nXigashada Sawirka, Getty Images\nXisbiga Jamhuuriga ayaa sare u qaaday ololahooda ay ku doonayaan inay ku aamusiyaan dhaleeceynta taariikhda Charlie Kirk, iyagoo beegsanaya xildhibaanka Dimuqraadiga ee Ilhaan Cumar hadallo ay jeedisay ka dib toogashadiisa, waxayna ku baaqeen in laga xayuubiyo doorkeeda guddiga dowladda.\nWareysi ay bixisay usbuucii hore, Ilhaan Cumar waxay ku sheegtay inay \"damqasho\" u hayso haweeneyda uu ka dhintay Kirk, laakiin waxay ku dhaleeceeysay kuwa soo jeedinaya saameynta garabka midig \"wuxuu rabay dood madani ah\". Waxay sidoo kale dhaleecaysay xildhibaanka Jamhuuriga Nancy Mace, iyada oo ku eedaysay \"inay dhibaatayso kuwa ay u aragto inay ka hooseeyaan\".\nMace ayaa hadda dib u soo jawaabtay qoraal ay soo dhigtay barta X: \"Waxaan gudbineynaa qaraar ah in @Ilhan laga xayuubiyo hawlihii guddigeeda ka dib hadalkeedii foosha xumaa ee dilkii Charlie Kirk\".\nQoraalkaasi xigay ayay ku dartay: \"Tallaabooyinka kala bar kuma filna, Ilhaan Cumar kuma filna qiyamka Mareykanka, boos kuma lahan Congress-ka, waana in la waaniyo\".\nKhilaafka u dhaxeeya Ilhaan Cumar iyo madaxweyne Trump ayaa muddo dheer soo taxnaa, xitaa muddo-xileedkiisii hore.\nXilligii uu madaxweyne Trump ku jiray ololaha doorashada, waxaa aad loo xusuusta hadal uu ka yiri Soomaalida ku nool Mareykanka oo ahaa in falal argagixiso ay kusoo kordhiyen Minnesota, oo haddii la doorto uu ka hortagi doono qulqulka qaxootiga iyo muhaajiriinta Soomaalida.\nWaxaa kale oo aad loo xusuusta hadal caan baxay oo ay tiri Ilhaan oo aha in dadka Minnesota aysan soo dhaweynin qaxootiga oo keliya, balse sidoo kale ay u diraan Washington, oo ay ula jeedday doorashadeedii maadaamma ay qaxooti ahaan dalka ku soo gashay.\nMarkii la dhaariyay lhaan Cumar aya waxay farta ku fiiqday arrimo ay kamid yihiin taageerada Trump uu siiyo dowladda Sacuudiga ee dagaalka ka wada dalka Yemen, waxaana ay ku baaqday in Trump uu joojiyo taageerada uu siiyo xulafada Sacuudiga uu hoggaamiyo ee dagaalka kau qaaday dalka Yemen.\nTan iyo markii la soo doortay Ilhaan Cumar, waxay fursad kasta oo soo marta u adeegsatay inay weerarto siyaasadaha Donald Trump, waxaana tusaale loo soo qaadan karaa markii ay ka hadashay hakadkii ku yimid adeegyada dowladda kadib markii madaxweyne Trump uu aqalka Kongreska ka dalbaday dhaqaale lagu dhisayo derbiga xadka Mareykanka iyo Mexico, si uu u ansixiyo dhaqaalaha lagu kala wadayo adeegyada dowladda.\nXigashada Sawirka, .\nXildhibaankan laga soo doorto gobolka Minnesota ayaa wacad ku martay in ay ka hor iman doonto qorshayaasha Trump ee ku aaddan dadka soo galootiga ah.\nWaxay sheegtay in ay la dagaallami doonaan qorshayaasha Trump uu doonayo inuu fuliyo\nIlhaan Cumar oo ka tirsan Congress-ka Mareykanka ayaa qoraal ay soo dhigtay boggeeda Facebook waxay tallaabada Trump ku tilmaamtay \"Shisheeye nacayb iyo mid naxariis darro ah islamarkaana aan Ameerika laga oggolaan\".\n\"Waxaan la dagaallami doonaa tallaabo kasta oo jidka ku soo jirta\" ayay intaa ku dartay.\nWaxa uu hadda ka hor bartiisa kusoo qoray \"TRUE!!! (waa run) isaga oo ka jawaabayay faallooyinka muxaafidka ee ah in Trump uu ku dhawaaqi doono xaalad degdeg ah oo qaran oo uu isticmaalo hantida milatari si uu u hoggaamiyo \"barnaamijka masaafurinta ballaaran\".",
  "date": "2025-09-19",
  "scraped_at": "2025-10-29T17:37:29.864270+00:00",
  "category": "news",
  "text_hash": "1185c0b8a0a5e1518b572ab693a755071efa2be41820115cbea1bef4054a5180",
  "minhash_signature": "4189613,3396961,6939556,4766324,6017429,4450499,7253303,547307,5286697,8778765,4935211,7844279,13038062,5103372,26230409,10716407,2814166,3447857,775639,7930989,329779,5949078,2834826,2561616,329045,2868017,7711646,8327680,13382390,9399682,1328208,480191,673036,118659,1077559,1026942,1904778,15982655,19581534,1883440,1009650,11840967,4203691,11598580,3072059,989367,7773802,538653,14281683,124624,3474099,8477545,1476777,3286499,1521205,3349500,1014072,1034118,4010095,10699821,11895477,9597218,4275578,850741,7169065,4215959,1236180,4544949,1367464,1637907,11375665,4732381,13570131,1443161,10654606,275175,12519951,5339090,267121,32794,12258,4327649,7598460,3680577,1061501,1355263,6436293,921258,2317924,1950100,801273,551783,2847863,1433526,1638426,6884534,3646999,11701251,1598419,3636378,8061764,962965,2864808,5689346,5578315,10592578,991022,16819380,2355772,837531,3817397,8214967,4503504,4799853,7096724,1430292,9594490,157472,4802778,1160363,2364037,2999256,3564292,2431681,6701850,4098881,764229,16236925"
}