{
  "url": "https://www.bbc.com/somali/articles/c5yp2gzpe18o",
  "title": "Markabka uu iska leeyahay ninka Israa'iiliga ah ee ay Iran ka doonayso $170 milyan oo doollar",
  "text": "Garsoorka Iran ayaa dalbaday in lagu ganaaxo 170 milyan oo doolarka Mareykanka ah mulkiilaha markab xamuul oo horaantii sanadkii hore lagu qabtay gacanka Persian, laguna eedeeyay inuu xiriir la leeyahay Israel.\nCiidamada Ilaalada Kacaanka Islaamiga ah ayaa markabka la wareegay 20 bilood ka hor bishii April 2024 waxayna xireen 25 ka mid ah shaqaalihii markabka, kuwaas oo qaarkood markii dambe la sii daayay.\nSannadkii hore, isla markii uu baahay warka ku saabsan qabashada markabka \"meel u dhow marinka Hormuz\", ayaa la sii daayay muuqaal muujinaya ciidamada Ilaalada Kacaanka Iran oo markabka ku galay diyaarad helikobter ah.\nAsghar Jahangir, oo ah afhayeenka garsoorka Iran ayaa shir jaraa'id oo uu ku qabtay Tehran ku yiri: \"Qaar ka mid ah konteenarada markabkan waxay sideen walxo khatar ah oo waxyeello leh, kuwaas oo ka marka loo eego sharciga Jamhuuriyadda Islaamiga ah ee Iran ee xeebaha Gacanka Faaris iyo Badda Cumaan, lagu helay inay ku xad-gudbeen mabaadi'da marinka ee in ah in si dhib la'aan ah lagu maro, ayna khalkhal geliyeen nabadda, nidaamka, iyo amniga gobolka.\"\nWaxa uu sheegay in dacwad ka dhan ah shirkadda iska leh markabkaasi la gudbiyay taa oo lagu eedeeyay \"maalgelinta argagixisada\", arrintaasina ay ku socoto dib u eegis dhanka garsoorka ah, balse aan weli la cayimin xilliga la qaadi doono dacwadda.\nEnd of Ugu akhris badan\nXigashada Sawirka, NurPhoto via Getty Images\nAsghar Jahangir ayaa sheegay in mulkiilaha markabka uu yahay \"qof saameyn ku leh\" dowladda iyo \"kaaliyaha dhaqaale\" ee ciidamada badda Israel.\nXiliga laqabanayay Mareykanka ayaa falkaasi ku tilmaamay mid \"burcad badeed\" isagoo dalbaday in lasii daayo shaqaalahooda. Wasiirka arrimaha dibadda ee Israa'iil ayaa sidoo kale ugu baaqay Midowga Yurub in ay Ilaalada Kacaanka Iran ku darto \"ururada argagixiso\".\nSida laga soo xigtay afhayeen u hadlay garsoorka dalka Iran, markabkan marka laga reebo shixnaddiisa ayaa qiimihiisu dhan yahay 170 milyan oo doolar, wuxuuna siday 2,760 konteenar.\nMarkabkan oo lagu magacaabo MSC Aris, isla markaana ku socda calanka dalka Portugal ayaa waxaa iska leh shirkadda Zodiac Shipping oo horay dhowr markab looga qabsaday biyaha ku teedsan dalka Iran.\nMarkii la qabtay markabka, Zodiac Shipping wuxuu sheegay inaysan mas'uul ka ahayn markabka, inkastoo uu xiriir la leeyahay MSC. Zodiac wuxuu sheegay inay \"si buuxda mas'uul uga tahay\" xamuulka, shaqaalaha iyo waddada uu qaadayay.",
  "date": "2025-10-29",
  "scraped_at": "2025-10-29T17:05:28.305686+00:00",
  "category": "news",
  "text_hash": "2d261e2d37169a462041ca7837f4a93c896bed47bfa73870798ace8d1858efca",
  "minhash_signature": "9725071,28861811,869466,1424291,6233757,28185485,10083739,242800,9223050,27984234,2356614,4541716,1157609,6999013,3657679,8878422,3112923,8851449,1911495,34250594,5493545,6566014,1656378,19375886,10722763,33626687,2434346,7133532,6379703,23061752,3353229,77238,2159805,8331849,13447877,27872246,7534828,26294827,2756982,16449816,574176,4815410,7318106,17289627,19300698,9719639,17824771,7918510,317203,1812456,21381716,11042319,24834128,10340074,3053223,32636580,3721768,4200902,1369409,15263403,2894668,26871567,10336522,22219720,12236258,2121971,12201052,26115652,29449649,21152736,8472318,8103989,2322382,12179361,3544140,2516138,232095,9123031,7857760,183942,4112397,6034375,7333770,8437035,10080701,35335840,13736036,4438562,19203053,16469391,839870,5980459,10052668,32485561,17133277,38883748,5557693,4260166,1492760,1513895,18571252,8348090,8700938,9709956,6999873,4049902,32768633,2347493,13260398,12540298,1496624,3699358,5071935,8422183,3510423,27276025,1867819,22421335,2624900,321196,248808,2870158,16618090,16248207,21214143,4073868,41299414,4059448"
}