{
  "url": "https://www.bbc.com/somali/articles/cgkzrjdpj67o",
  "title": "Maxaadan ka ogayn musiibada ka taagan Darfur iyo kooxda RSF?",
  "text": "Xigashada Sawirka, Reuters\nXoogaga Gurmadka Degdegga ah ee RSF ayaa ku dhawaaqay inay gacanta ku hayaan magaalada El Fasher, oo ah caasimadda gobolka Waqooyiga Darfur, oo ah magaaladii ugu dambeysay ee ugu weyneyd ee ay gacanta ku hayaan ciidamada Sudan.\nKu dhawaaqistani waxa ay ka dhigan tahay isbeddel aasaasi ah oo ku yimid khariidadda dagaalka ee gobolka, maadaama dhammaan shanta gobol ee Darfur ay hadda gacanta ku hayaan ciidamada taageerada degdegga ah (RSF).\nWarkan ayaa lagu sheegay war rasmi ah oo la soo saaray iyo sawiro muujinaya in ciidamada ay gudaha u galeen gudaha magaalada iyo xarunta taliska qeybta 6-aad ee ciidamada lugta.\nIyadoo la filayo inuu bayaan ka soo baxo taliska ciidamada oo lagu cadeynayo sida ay wax u dhaceen, gudoomiyaha golaha madax banaanida dalka Sudan, Abdel Fattah al-Burhan, ayaa sheegay in ka bixitaanka magaalada loo sameeyay \"si loo ilaaliyo nolosha muwaadiniinta iyo in laga ilaaliyo El Fasher burbur kale.\"\nWaxa uu sharraxay in qaar badan ay isku dayayaan in ay si dhuumaaleysi ah ku maraan wadooyinka galbeedka iyo koofurta, waxaana uu sheegay in tiro ka mid ah dadkaasi la dilay xilli ay doonayeen in ay gaaraan Tawila, gaar ahaan dhanka galbeed oo ay ku sugan yihiin Ciidamada Gargaarka Degdegga ah, halkaas oo ay sidoo kale ku heystaan tiro dad ah, ayuu yiri.\nEnd of Ugu akhris badan\nXigashada Sawirka, Reuters\nQabshada Ceel Fasher waxay ka dhigan tahay isbedel weyn oo dhanka militariga ah, iyadoo magaaladu ay ka dhigan tahay fariisimadii ugu dambeeysay ee ciidanku ku lahaa gobolka Darfur, kaas oo ka kooban ku dhawaad afar meelood meel dhulka Suudaan.\nEl Fasher waa mid ka mid ah goobihii ugu xumaa ee ay ka dhaceen dagaallada sokeeye ee Suudaan: waxa ay Qaramada Midoobay ku tilmaantay xuddunta dhibaatada,  dadka ku go'doonsan halkaas waxaana ka go'ay cunnadii iyo daawadii ay go'doomiyeen RSF-ta, dad badan ayaa ku dhintay, kuna barakacay dagaalka.\nWaxay ku taal waqooyiga gobolka Darfur, meel in ka badan 800 oo kilomitir dhanka galbeed ka xigta caasimada Khartoum, waxayna qiyaastii 195 kiiloomitir u jirtaa Nyala oo ah caasimadda gobolka Koonfurta Darfur.\nEl Fasher waxay ku taal meel istiraatiiji ah oo ku taal Waqooyiga Darfur. Hadda waa magaalada kaliya ee weyn ee laga heli karo magaalooyinka waqooyiga Suudaan, sida Ad Dabba, dhanka Darfur, sababtoo ah waxay u dhowdahay juqraafi ahaan meelahaas.\nXigashada Sawirka, GETTY\nMagaaladu waxay qani ku tahay kheyraadka dabiiciga ahoo kamid ah xoolaha iyo macdanta, taas oo dhaqaalaheedu muhiim ka dhigeysa, marka laga yimaado muhiimadda ciidan iyo tan siyaasadeed.\nSidaa darteed, El Fasher waxay u taagan tahay marinka ugu muhiimsan ee kolonyada gargaarka bini'aadantinimo ee ka imaanaya Port Suudaan ee xeebta Badda Cas, kuwaas oo hadda hela mucaawino shisheeye ka hor inta aan loo qaadin qaybo kala duwan oo ka mid ah gobolka Darfur.\nSidoo kale, Chad waxay xuduud la leedahay El Fasher dhanka galbeed iyo Liibiya oo dhanka waqooyi ah, taasoo ka dhigaysa goob istaraatiiji ah oo muhiimad ciidan u leh xisbiga maamula, gaar ahaan marka la eego joogitaanka kooxaha hubeysan iyo ciidamada Suudaan ee ku sugan xudduudaha labada dal ee deriska ah, sida laga soo xigtay warbixinnada warbaahinta iyo ururada ay khuseyso amniga gobolka, sida kooxda xasaradaha caalamiga ah.\nEl Fasher waxaa dega qabaa'il iyo qowmiyado kala duwan oo ka kala yimid guud ahaan Suudaan. Si kastaba ha ahaatee, dadka intiisa badani waxay ka soo jeedaan qowmiyadaha ay ka soo jeedaan kooxaha hubaysan, sida Zaghawa, Fur, iyo Masalit. Qaar badan oo ka mid ah kooxahan ayaa deggan xeryo barakac oo ku baahsan El-Fasher.\nGacan ku heynta Ciidamada Taageerada Degdegga ah ee magaalada El-Fasher, ayaa loo arkaa in ay wax ka bedeleen dagaalka socday tan iyobishii April sanadkii 2023.\nXoogaga waxay hadda maamulaan inta badan galbeedka Suudaan, iyagoo siinaya dhul ballaaran iyo istiraatiijiyad qooto dheer.\nFalanqeeyayaasha ayaa aaminsan in isbedelkani uu u riixi karo dib u habeynta khariidadda isku dhaca iyo dheeli-tirka awoodda gorgortanka. Si kastaba ha ahaatee, waxay sidoo kale kor u qaadaysaa cabsida laga qabo in dagaalku uu gaaro gobollada waaweyn ee Kordofan iyo Darfur, halkaasoo daacadnimada qabaa'il iyo danaha dhaqaale ay isku xiran yihiin.\nEl Fasher hal maalin kuma dhicin, ee waa ka dib go'doomin dheer iyo dhibaatadii bani'aadantinimo oo daba dheeraatay. Xakameynteeda waxay wax ka bedeli kartaa wejiga dagaalka, iyo malaha wejiga Suudaan laftiisa. Maanta, waxay hoos timaadaa maamul cusub waxayna wajaheysaa xaqiiqo aan la hubin.\nSida suudaaniyiintu ayka dhiir sugayaan waxa xigi doona isbeddelkan ka dib, su'aasha ugu weyn ayaa ah: El Fasher ma noqon doontaa bilowga dhamaadka dagaalka, mise bilawga cutub sii adag?",
  "date": "2025-10-28",
  "scraped_at": "2025-10-29T17:09:28.337683+00:00",
  "category": "news",
  "text_hash": "044abf7ac4e1f95caad27f7af1508bdbf4fad07d4e24c1178c284f3ccb05c82c",
  "minhash_signature": "1872077,1248418,9057333,3597860,205881,10046990,11011284,5119088,7112886,2376606,1754962,59520,2753369,1054367,11713884,720898,8378922,10774366,3779146,841151,649828,14082669,12998978,581289,1195470,82550,15207472,4104497,43695,2856319,13035207,4747575,11602874,1869612,3222399,2676790,13248310,6385070,11886997,10138239,3932370,5673898,9081842,3720981,1393177,1997035,6353518,103442,317203,2482151,6232663,8982839,6023581,17227848,3064800,1859368,9023580,3930718,10452200,257553,4981654,9208300,11360511,1281345,6171592,3935330,66938,4549625,1689362,5977737,246921,1442833,6109870,1854261,3081411,7506875,2994126,3083975,11011889,5462164,7479689,645018,1710570,9466501,1752510,4787201,34426282,15734589,64238,2288514,4150511,1436431,5555,5523348,4298016,18040489,5163449,5942836,1492760,2590770,3106705,5059174,1998655,11040727,19082747,2738613,6929355,5784076,4341048,6544036,1355313,3073218,5481911,6519302,517430,10434790,4757486,14452401,7634642,1769137,3395426,1187385,4875190,12021673,3087610,2500917,15681808,4828411"
}