{
  "url": "https://www.bbc.com/somali/articles/cj972yd2xldo",
  "title": "Xus la yaab leh oo ka dhaca dalkan Muslimka ee Soomaaliya xiriirka dheer la leh",
  "text": "\"Anigu kaligay iskama iman halkan; markuu igu yiraahdo imaaw, waan imaadaa,\" ayay tiri Sherine, haweeney aan kula kulmay afafka hore qubuurta Imam Xuseen ee Qaahira. Waxay si xooggan u muujisay in booqashada ninka uu Nabi Maxamed NNKH awoowaha u yahay ay suurtagal tahay oo kaliya iyadoo loo maro nooc ka mid ah 'kaarar casuumaad' oo loo diro dadka raacsan, meel kasta oo ay joogaan.\nFikraddan waxaa wadaaga Masriyiin badan, kuwa waxbartay iyo kuwa aan wax baranba, kuwaasoo aaminsan in booqashada qubuurta Imam Xuseen ay suurtagal u tahay kaliya dadka uu isagu oggolaaday. Waxay fasiraan oggolaanshahan iyadoo loo fududeeyo safarkooda kuna suurtogasho inay istaagaan qubuurtiisa horteeda.\nSherine waxay u sheegtay BBC Carabi: \"Sida aan qofna u tegi karin guriga qof kale la'aantiis casuumaad, ayaa sidoo kale loola mid tahay, xataa haddii aad agtiisa joogto, haddii uusan ku doonayn, ma imaan kartid hortiisa.\" Tani waxay maskaxda ku soo celisay muuqaal caan ah oo fannaanadda Amal Zayed ku jishay filimka \"Labada Qasri Dhexdooda,\" markii ay ku tiri (Mudane Sayed): \"Sayidkeen Al-Xuseen ayaa i casuumay, markaas ayaan u jawaabay\"?!\nSi kastaba ha ahaatee, Sherine, oo aaminsan in \"cidii soo booqata halka laga qabuuraha aysan la kulmayn niyad jab,\" ma jecla inay booqato xilliga ay Masriyiintu ugu yeeraan \"Mawliidka,\" sababo la xiriira ciriiriga aadka u badan ee ka hor istaaga inay gudaha u gasho masaajidka. Si kastaba, mararka qaar way booqataa Sayid Al-Xuseen.\nInkasta oo goobtan, oo ku taalla wadnaha magaalada Qaahira, oo ay barxadahadeedu noqdeen meel ay booqdaan dad ka kala yimaada daafaha dunida, haddana dalxiisayaasha iyo muwaadiniinta sida Sherine ayaa laga yaabaa inay la kulmaan dhibaatooyin ku saabsan helitaanka goobta xilliga dabaaldegga Mawliidka, marka ay buuxsanto ilaa xad, iyadoo ay camiraan \"taageerayaasha Sayidna Al-Xuseen,\" taasoo ka dhigta  meel aan xataa lug lagu tagi karin. Halkaas oo sanadkii laba jeer lagu qabto isu-soo-bax aad u ballaaran.\nEnd of Ugu akhris badan\nWaxaa si wanaagsan loo yaqaan in Imam Xuseen ibn Cali, oo ah wiilka uu awoowaha u yahay Nabi Muxamed (NNKH), uu dhashay horraantii bisha Sha'baan sanadkii afraad ee taariikhda Islaamka. Si kastaba ha ahaatee, Masriyiintu waxay sidoo kale u dabaaldeggaan xuskiisa Talaadada ugu dambeysa ee bisha Rabi' al-Aakhir, dhacdo hareysa xuska dhalashadiisa, taasoo sanadkan ku beegan 21-ka Oktoobar. Maxaa sabab u ah arrintan?\n\"Masriyiintu waxay ku xiran yihiin Ahlul-Bayt-ka (qoyska Nabi Muxamed NNKH) iyagoo u sii maraya Imam Xuseen, kaas oo ah furaha jacaylkooda oo dhan ee ay u qabaan ehelka Nabiga,\" ayay tiri weriyaha iyo qoraaga reer Masar Nawara Najm, taas oo xaqiijisay inaysan marnaba ka harin booqashada qubuurtiisa markasta oo ay u baahato si ay ugu raadiso \"deggenaanasho\"\nWareysi ay siisay BBC-da, waxay ku sheegtay imaanshaha \"madaxa sharafta leh\" ee Masar – sida ay rumeysan yihiin Masriyiin badan – inuu ahaa \"dhalasho cusub oo u bilaabatay Masriyiinta, dhalasho ruuxi ah,\" taasoo keentay in ay munaasabaddan ugu yeeraan \"Mawliid,\" oo Masriyiintu ay u arkaan mid farxad iyo sharafba leh.\nWaxaa cajiib ah in hadalkaas oo kale uu adeegsaday Imaamka iyo daaciga Masjidka Al-Xuseen ee magaalada Qaahira, Dr. Moamen Al-Khaliji, oo BBC-da u sheegay \"Waxay la mid tahay dhalashadii Masar oo kale\", waxayna muujiyeen sida ay ugu faraxsan yihiin imaatinkiisii Masar oo ay ku tilmaameen \"dhalasho\".\nInkasta oo ay jiraan sheekooyin kala duwan oo ku saabsan goobta uu yaallo \"madaxa sharafta leh,\" haddana jacaylka gaar ahaaneed ee Masriyiintu u hayaan Imam Xuseen ayaa ka dhigaya mid meel gaar ah kaga jira qalbigooda.\nDr. Cabdul-Baaqi Al-Qataan, oo ah borofisar taariikhda iyo ilbaxnimada Islaamka ka dhiga Jaamacadda Cayn Shams, ayaa u sheegay BBC-da in Faatimiiyiinta iyo Masriyiintii waqtigaas ay u arkeen imaanshaha madaxa Imam Xuseen sidii \"dhalasho cusub, ama dhalashadiisii labaad, ka dib tii ugu horreysay.\"\nWaa xusid mudan in taariikhyahanno dhowr ah ay sheegeen in madaxa Imam Xuseen la geeyey Qaahira maalin axad ah siddeedii bisha Jumada al-Aakhir sanadkii 548 Hijri. Si kastaba ha ahaatee, Masriyiintu waxay xuska sannadguuradaas u dabaaldeggaan laba bilood ka hor taariikhda rasmiga ah ee ku qoran taariikhda Hijriyada.\nDr. Al-Qataan wuxuu sheegay in doorashada taariikhda laga yaabo inay la xiriirto \"safarkii ugu horreeyay ee madaxa laga soo qaaday Ashkelon,\" markaas oo uu Al-Afdal, wasiirka Faatimiyiinta, uu madaxa u qaaday Masar dhammaadkii bisha Rabi' al-Aakhir. Wuxuu intaas ku daray in arrintani sidoo kale laga yaabo inay sabab u tahay khilaafka ku saabsan waqtiga rasmiga ah ee madaxa la geeyey Qaahira, taas oo qaar ka mid ah taariikhyahannadu ay sheegeen inay ahayd Rabi' al-Aakhir sanadkii 549 taariikhda Hijriga.\nImaamka masaajid Xusayn wuxuu BBC-da u sheegay in xafladaha dhalashada Imam Xuseen ee gudaha masaajidkiisa \"ay yihiin kuwo nabdoon oo ay ka mid yihiin akhriska Qur'aanka, duruus ku saabsan xadiisyada, casharro ku saabsan nolosha iyo taariikhda Nabi Muxamed, iyo jacaylka qoyska Nabi, iyo sidoo kale habeenno ay ka dhacaan akhris Qur'aan iyo ducooyin.\"\nXigashada Sawirka, Dr. Moamen Al-Khaliji, Imam and Preacher of Imam Hussein Mosque\nJacaylka Xuseen waa furaha farxadda.\niftiinkiisuna meel walba ku faafay.\nQabiil ka soo farcamay abtirsinye  qofka La doortay.\nNuurka wajigiisa ayuu ku iftiimiyey Masar.\nWaa erayadii qasiidadii Sheekh Taha al-Fashni, oo geeriyooday horaantii 1970-meeyadii, waxay muujinayaan rumaysnaan qoto dheer oo ay qabaan inta badan Masriyiinta in madaxa Xuseen, wiilkii uu awoowaha ahaa Nabi Muxamed NNKH ee gabadhiisu dhashay , lagu aasay dhulkooda. Tani waxay dhacdaa inkastoo qaar ka mid ah dadka Masar, sida xubno ka tirsan waxa loo yaqaan \"dhaqdhaqaaqa Salafiga,\" ay arrintan beeniyaan.\nMacluumaadkan waxaa daabacay Google YouTube.  Waxaan dalbanayenaa fasaxaaga ka hor inta aan la furin, waxaa laga yaabaa inay isticmaalayaan cookies iyo farsamooyin kale. hadii aad u bahato akhri Google YouTube xeerarka cokie iyo kan ku saabsan xogta gaarka ah ka hor inta aadan aqbalin. si aad u aragto xogta guji ‘aqbal oo soco’.\nDhammaadka YouTube boggan\nMacluumaadkan lama heli karo\nWaxaa xusid mudan in ka dib markii Imaam Xuseen lagu dilay dalka Ciraaq tobankii bishii Muxarram ee sannadkii 61-aad ee Hijriyada, kuna beegan tobnaadkii Oktoobar 680-kii,Miilaadiga, jirkiisa lagu aasey meesha maanta loo yaqaan Qubuurta Al-Hussainiya ee Karbala, sida ay isla ogol yihiin taariikhyahannadu.\nSida laga soo xigtay taariikhyahannada, madaxu waxa uu noqday muran ka dhashay dhacdooyinkii ka dambeeyay dilkii Xuseen, oo ay geysteen ciidamadii Ibn Ziyad, guddoomiyihii Ciraaq xilligii xukuumadda Umayyad Califa Yazid ibn Muawiyah, ciidamadiisuna madaxiisa ku wareejiyeen magaalooyin kala duwan oo Ciraaq iyo Bilad al-Sham ah.\nWaxaa jira qisooyin kale oo sheegaya in madaxa loo celiyey Madiina oo lagu aasey agagaarka hooyadiis, Sayidah Faatima, xabaalaha Al-Baqiic', sida lagu sheegay buugga Al-Tabaqat Al-Kubra ee uu qoray Ibn Sa'd, taariikhyahanka iyo xadiisyahanka qarnigii labaad Hijri, iyo sidoo kale Ibnu Taymiyyah, xadiis rugii noolaa qarnigii toddobaad iyo sideedaad ee Hijriga.\nWaxaa kaloo jira qisooyin sheegaya in madaxii Al-Xuseen uu ku aasan yahay khasnadda hubka ee Dimishiq tan iyo dowladdii Yaziid bin Mucaawiyah, waxaana lagu yiri Bab Al-Faradis oo ka mid ah albaabadii taariikhiga ahaa ee Dimishiq hore, sida uu Ibnu Kathiir ku sheegay (Al-Bidayah wa Al-Nihayah).\nWaxaa sidoo kale jira riwayado sheegaya in madaxa Al-Xuseen lagu aasay keydka hubka ee Dimishiq xilligii Yazid bin Muawiyah, sida lagu sheegay  qoraal laga helay albaabka Bab Al-Faradis, oo ah mid ka mid ah albaabada taariikhiga ah ee Dimishiqii hore, sida uu ku xusay Ibn Kathir buuggiisa ' Al-Bidayah wa Al-Nihayah'\nBBC-da ayaa la xiriirtay Maktabadda Ingiriiska si ay wax ugu tiraahdo waxa loo yaqaan \"Qoraal gacmeedkii taariikhiga ahaa ee ugu da'da weyn\" kaasoo soo jeedinaya in madaxa Xuseen laga wareejiyey Ashkelon loona qaaday Masar. Qoraal gacmeedkan, oo uu qoray taariikhyahanka Axmed ibn Yuusuf ibn Cali, oo loo yaqaan Ibn al-Azraq al-Farqi, ayaa ahaa garsoore ka soo jeeda qoys caan ah oo ku noolaa Mayyafariqin, oo ah magaalada ugu weyn ee Diyarbakir, hadda ku taalla Turkiga.\nBuuggiisa, \"Taariikhdii Mayyafariqin,\" Al-Farqi wuxuu ku xusay qoraal-gacmeedka - oo ay BBC-du ka heshay nuqul la sawiray - labada qisooyin ee ugu caansan. Midda hore waxa uu yiri \"waxaa jiray dadka reer Eshkalon ah oo dadka reer Dimishiq waydiistay madaxii Al-Xuseen, markaasuu la siiyey, markaasay  ayu qaadeen Eshkalon oo ay ka dul dhiseen macbad weyn, waxaana lagu bixiyey lacag aan la qiyaasi karin\".\nQisada labaad ee uu uga waramay cutubka ku saabsan Ciraaq, gaar ahaa xukunkii Yasiid Ibnu Mucaawiyaah iyo xilkii Al-Xuseen, waxaa uu yiri \" Waxa la sheegay in madaxda lga qaaday Karbala iyo in Jirkiisa lagu aasay tan kowaad ayaa ah tan qisada saxda ah ee sida ballaaran loo wariyey.\nWuxuu sheegay in madaxu yaallay Eskhalon ilaa sannadkii 549 ee Hijriyada,Dabadeedna waxaa u soo baxay khaliif Al-Zafer oo madaxii ku duubnaa sanduuqa laabta ku qaaday isagoo Ashqeloon ka soo qaaday geeyeyna Masar wuxuuna  Masar ka dul dhisay macbad weyn, wuxuuna ku bixiyey lacag faro badan.\nXigashada Sawirka, AFP via Getty Images\n\"Waxaad tahay jacaylkayga weyn, kan ugu horreeya iyo kan uugu dembeeya, mana jiro qof kale oo aan adiga ahayn, jacaylkayga, qalbigaygu wuxuu u xiran yahay jacaylkaaga.\" Waa tuduc ka mid ah hees uu leeyahay fanaankii reer Lubnaan ee Ragheb Alama. Nawara ayaa maqashay heestan oo uu ku luuqeeyay mid ka mid ah asxaabteeda mar ay booqatay Al-Xuseen, iyadoo ku muujinaysay heerka uu gaarsiisan yahay jacaylka ay u qabto.\nNawara waxay sheegtay in jacaylkeeda Xuseen uu leeyahay dhinac \"aan macquul ahayn,\" oo ku dhuumanaya dareen \"sirr\" ah, marka lagu daro in uu matalo qiimaha \"geesinimada, is-huridda, iyo ka hortagga madaxda cunsuriga ah iyo beenta, iyo baaqyadiisa ka dhanka ah ceebaynta iyo adduunka.\"\nImaam Xuseen waxa ay taageerayaashiisu u yaqaaniin \"madaxweynaha Jamhuuriyadda Qarsoon,\" oo ay ula jeedaan inuu yahay hoggaamiyaha ruuxiga ah ee Masar, iyo \"Waardiyaha Bakarooyinka\" oo dadka martida u ah khayr, barako iyo iftiin u bixiya.\nXigashada Sawirka, Getty Images\nDr. Moamen, Imaamka iyo daaciga Masjidka Al-Xuseen, wuxuu yiri, \"Barakada ugu weyn ee Awliyada xaqa ah ee Ilaahay ee Masar ku sugan waa sayidkeenna Imaam Xuseen, waana sababta aan ugu yeerno ilaaliyaha Barakooyinka, taas oo ah, waa kan ugu khayrka badan awliyadii Ilaahay ee xaqa ahaa ee Masar.\"\nImaamka oo ku takhasusay cilmiga fiqiga iyo falsafada ee kuliyadda aasaasiga ah ee diinta, ayaa intaa ku daray in tani ay muujinayso heerka uu gaarsiisan yahay jacaylka ay Masaarida u qabaan Xuseen, kaas oo awoowgiis Nebi Muxamed uu \"la soocay\" oo uu ku tilmaamay \"in cid kale aanay lahayn\", marka uu yidhi \"Ilaahay waa jecel yahay qofka Xuseen jecel\" xadiis.\nRuntu waxa ay tahay in qofkasta oo u kuur gala bulshada Masar uu arki doono, in 800 oo sano, ay Masaaridu iska dhaxleen jacayl ay u qabaan Xuseen, kana maran kooxaysi.\nWaxay siiyeen magacyo kala duwan oo ka tarjumaya qadarin iyo sharafta uu ku leeyahay qalbiyadooda. Waxay madaxiisa ka dhigeen Kabco ay u safraan mar kasta oo ay raadinayaan degenaansho, farxad, iyo barako, iyaga oo aan dan ka lahayn arrimo muran ka taagan yahay oo arrintan ku saabsan.",
  "date": "2025-10-22",
  "scraped_at": "2025-10-29T17:07:28.368888+00:00",
  "category": "news",
  "text_hash": "74446119b8b8ffd1993e18bf1468e37bc1adeac998a908e714b05e9f291e3377",
  "minhash_signature": "1388556,2959463,3091023,1950992,1203274,874039,789087,5799711,5032519,946809,21479,504298,2468849,2737320,1886794,394921,2367262,227165,2028625,554102,9857695,3109440,1817122,4436629,21137,425806,264460,3507300,3786600,610873,2823181,467032,2065174,75208,678001,484806,1572898,1790799,1104624,1737287,723373,1654401,529519,2934928,5590241,786533,2346184,2160439,317203,68927,80497,804483,8142,1384928,6458,4578253,6274371,204581,4236903,1395250,6674185,2045447,425968,194598,1314673,4856291,376138,3142595,3219382,5607690,4783175,1699584,3066012,4637588,277659,2841221,2854440,3937306,1601657,1062306,1648267,257900,8784654,1424595,4440962,2549819,1196521,3309294,208698,352932,5498009,3998096,560618,327573,2086700,1827755,1279608,149,86489,13666723,173134,8060930,272755,592252,783028,1097738,423618,1101684,98073,457090,5868208,3148166,902373,1157284,1332660,1377107,2448800,3409479,1703593,3612843,1353405,1342359,322619,257057,374386,10204567,11236995,3062348"
}