{
  "url": "https://www.bbc.com/somali/articles/clydzmne9nxo",
  "title": "Sidee buu u guuldarraystay mooshinkan ka dhanka ah Ilhaan Cumar",
  "text": "Xigashada Sawirka, Getty Images\nXisbiga Jamhuuriga ayaa sare u qaaday ololahooda ay ku doonayaan inay ku aamusiyaan dhaleeceynta taariikhda Charlie Kirk, iyagoo beegsanaya xildhibaanka Dimuqraadiga ee Ilhaan Cumar hadallo ay jeedisay ka dib toogashadiisa, waxayna ku baaqeen in laga xayuubiyo doorkeeda  guddiga dowladda.\nWareysi ay bixisay usbuucii hore, Ilhaan Cumar waxay ku sheegtay inay \"damqasho\" u hayso haweeneyda uu ka dhintay Kirk, laakiin waxay ku dhaleeceeysay kuwa soo jeedinaya saameynta garabka midig \"wuxuu rabay dood madani ah\". Waxay sidoo kale dhaleecaysay xildhibaanka Jamhuuriga Nancy Mace, iyada oo ku eedaysay \"inay dhibaatayso kuwa ay u aragto inay ka hooseeyaan\".\nMace ayaa hadda dib u soo jawaabtay qoraal ay soo dhigtay barta X: \"Waxaan gudbineynaa qaraar ah in @Ilhan laga xayuubiyo hawlihii guddigeeda ka dib hadalkeedii foosha xumaa ee dilkii Charlie Kirk\".\nQoraalkaasi xigay ayay ku dartay: \"Tallaabooyinka kala bar kuma filna, Ilhaan Cumar kuma filna qiyamka Mareykanka, boos kuma lahan Congress-ka, waana in la waaniyo\".\nKa gudbinta, oo Mace ay kusoo qortay barteeda X, ayaa ujeedkeedu ahaa \"in la canaanto Ilhaan Cumar ee Minnesota lagana saaro Guddiga Waxbarashada iyo Shaqaalaha iyo Guddiga Miisaaniyadda\".\nEnd of Ugu akhris badan\nKa gudbinta dalabkan ayey ku soo qaadatay wareysi uu la yeeshay wariye Medhi Hassan, kaas oo ay ku andacoonayaan in Ilhaan ay \"magac dishay  Charlie Kirk oo ay ku sheegtay inuu isagu mas'uul ka ahaa dilkiisa\". Waxa uu ahaa isla wareysigii ay Ilhaan ku dhaleeceeysay jawaabaha  siyaasadeed tan iyo toogashadii.\n\"Waxa jira dad la mid ah Nancy Mace, oo si joogto ah u dhibaateeya, waad ogtahay, dadka ay u aragto inay ka hooseeyaan oo ay rabto inaysan ka jirin dalkan\" Ilhaan ayaa sidaasi u sheegtay Hassan wareysiga uu kula yeeshay barnaamijkiisa Zeteo.\n\"Oo waad ogtahay waxaad haysataa dad sida Trump oo kale ah, kuwaas oo kiciyey rabshado ka dhan ah dadka aniga oo kale ah, waxaana muhiim noo ah inaan u yeerno iyaga, inaga oo dareemayno carr iyo murugo,\" ayay tiri\".\nWareysiga Ilhaan waxa ay ku tilmaantay dilka Kirk mid \"dhib dhalin kara\".\nWaxa ay tiri: \"Runtii aad ayaan uga naxay  inaan maqlo warka, inaan daawado muuqaalka. Waad ogtahay, waxa kaliya ee aan ka fikiri karay waxay ahayd xaaskiisa, caruurtiisa, muuqaalkaasi  wuxuu ahaan doonaa mid weligiis nala nool\".\nXigashada Sawirka, AP\nIyadoo ku qortay barta X, Mace waxay tiri: \"Ma jiraan wax qalbiyadeenna diirinaya oo ka badan dadkii naga soo wacay degmada Ilhaan Cumar oo taageeraya tallaabadii aan ku canaananaynay oo aan uga xayuubinayno guddiyada\".\nIlhaan oo laga soo doorto Minnesota ayaa horay looga saaray Guddiga Arrimaha Dibadda ee Aqalka bishii Febraayo 2023 ka dib markii lagu eedeeyay inay sameysay hadallo yuhuud naceyb ah oo ay markii dambe raali gelin ka bixisay.\nLaakin Ilhaan Cumar iyo siyaasiyiinta xisbigeeda Dimuqraaddiga ayaa sheegay in arrintaasi  ay ahayd aargoosi ka dib markii labo xubnood oo Jamhuuriyiin ahaa laga saaray guddiyo ay ka tirsanaayeen 2020-kii, markaas oo Dimuqraadiyiintu ay haysteen aqlabiyadda Aqalka.\nMace ayaa bayaan ay soo saartay ku sheegtay \"Ilhaan Cumar waxay na tustay qofka saxda ah ee ay tahay: waa qof difaacda rabshadaha siyaasadeed oo diidaysa inay cambaareyso khasaaraha nafeed ee aan waxba galabsan oo aysan ku habooneyn ajandaheeda, xitaa dilkii Charlie Kirk\".\nSi kastaba ha  ahaatee Xildhibaan Nancy Mace oo ka tirsan xisbiga Jamhuuriga, lagana soo doorto South Carolina ayaa Arbacadii ku guul darraysatay mooshin ay ku doonaysay in ay ku aamusiso Xildhibaan Ilhaan Cumar oo ka tirsan xisbiga Dimoqaraadiga kaas oo ku saabsan hadallada dilkii Charlie Kirk ka dib markii afar ka tirsan Jamhuuriga ay ka soo horjeesteen soo jeedinteeda.\nCodbixinta 214-213 ayaa soo afjartay dadaalkii Nancy Mace ay ku doonaysay inay Ilhaan Cumar ku canaanto oo ay ka xayuubiso dhammaan hawlihii guddiga ay ka tirsan tahay, ayadoo loo cuskanayo arrinta ku aadan dhaleeceynta ay u jeedisay u dhaq-dhaqaaqihii muxaafidka ahaa ee Charlie Kirk ee la toogtay. Ilhaan ayaa si adag u beenisay inay si toos ah u sheegtay faallooyinka ay soo xigatay Mace, iyadoo Dimuqraadiyiinta Aqalka Wakiilada ay taageereen.",
  "date": "2025-09-18",
  "scraped_at": "2025-10-29T17:39:29.955621+00:00",
  "category": "news",
  "text_hash": "fe10791d733a566a43837fc12e81b0395a1fb8226ee096529ffe34dfb7063996",
  "minhash_signature": "5882603,13946732,2147681,987076,924857,505284,909534,133315,6231835,5195092,4935211,2684438,5457414,3920186,7540056,17200461,2814166,10774366,3081706,17425199,971752,19239197,4281931,4436629,556205,2868017,7703183,8327680,13523666,1838814,2583341,10209390,6263455,118659,1077559,10520112,4255688,8909545,1892374,1883440,4423183,2545073,16549743,14436334,26170019,4476352,3449638,10971808,6327625,1838727,25635989,7113521,1376187,3530674,271462,6679754,12200809,1459508,13832145,12998090,11895477,7752756,10030351,2982276,16368301,25909905,29598149,836319,3763853,1637907,24206659,15952712,4155035,1879511,2238931,8069114,2277904,5339090,10728427,8071890,12258,6208371,4482665,2297055,1121368,6101490,5528259,19423636,14614154,5681017,1263085,691346,10624026,6020362,1521895,80101,4512508,516027,1598419,662857,8061764,1686786,21320219,156173,7000243,4874443,991022,6452673,453063,10372950,3817397,2222885,7585717,4799853,13188134,4092195,15523581,157472,2530851,1183406,303351,2999256,2288993,5948751,1455976,4098881,10099880,1241360"
}