{
  "url": "https://www.bbc.com/somali/articles/c0kpxv0r5z8o",
  "title": "Maxay yihiin caqabadaha horyaalla hirgalinta heshiiska Ceerigaabo,  kheyraadka dabiiciga ahse door ma ku leeyahay colaadda",
  "text": "Xigashada Sawirka, Baraha bulshada\nWaxaa magaalada Ceerigaabo ee xarunta Gobolka Sanaag lagu soo gabagabeeyay shirkii nabaddeynta ee maalmihii u dambeeyay ka soconayay Magaalada, iyada oo uu goob joog ka ahaa madaxweynaha Somaliland Cabdiraxmaan Cirro.\nHaddaba maxay yihiin caqabadaha horyaala dhaqan galka heshiiska ee ay tahay in wax laga qabto iyo doorka khayraadka dabiiciga uu ku leeyahay colaadaha soo noqnoqda ee ka dhaca gobolka Sanaag?\nSi nabaddu u ahaato mid sii jirta ayay tahay in la sii wado nabadeynta sida uu qabo Qareen Guuleed Dafac oo arrimaha bini'aadantinimada iyo gobolka ka faalooda ''Nabaddu si ay noqoto mid waarta oo sii jirta waxaa loo baahan yahay in dadaalada nabadeed aan la joojin oo aan loo qaadan in halmar ay ku dhammaato, nabadda iyo nabadaynta maalin qura kuma dhammaato. Dadka waa in la isu soo jiidaa oo la is fahamsiiyaa oo xiriiradooda la xoojiyaa, waana in wax laga qabtaa waxaabaha marka hore colaadaha keena ee isha u ah dadku inay is qabsadaan oo is dilaan''\nShirka nabadeynta ee la soo gabagabeeyay ayaa waxaa ka maqnaa mid kamid ah beelaha deegaanka, iyada oo gobolka Sanaag yahay mid ay beelo badan deggen yihiin, ayna tahay in si gaar ah loo eego ''Gobolka Sanaag marka hore waa gobol xasaasi ah oo u nugul arrimaha colaadaha, sababta oo ah beelo kala duwan baa deggan, waana sababta markii gooni isutaaga Burco looga dhawaaqay qodobadii lagu dhawaaqay ay ka mid ahayd in arrinta gobolka Sanaag si gaar ah loo eego, waxaana berigaa ay qaadatay dhowr sanadood. Marka in beeli ka maqan tahay waxa ay muujinaysaa in aanu weli arrinku dhamaystirmin'' ayuu yiri Guuleed Dafac.\n''Dowladdu waa inay xoojisaa maamulka iyo kala dambaynta gobolka, mararka qaar reeruhu inay is dilaan waxaa keena in dambiilayaashu baxsadaan oo lasoo qaban waayo, waa in ammaanka la xoojiyo oo booliska la daadajiyo, maxkamadaha la adkeeyo, caddaalada la xoojiyo, beelaha gobolka degga oo dhana ay iska dhex arkaan maamulka'' ayuu sii raaciyey.\nEnd of Ugu akhris badan\nKhayraadka dabiiciga ayaa kamid ah waxyaabaha uu gobolka Sanaag caanka ku yahay iyada oo mararka qaarna uu sababi karo isku dhaca beelaha.\n'Berigii hore dadku waa yaqaaneen sida loo maareeyo arrimaha beeyada ama kaluumaysiga waayo wax ay boqlaal sano ku soo dhaqmayeen ayay ahayd. Hadda waxaa soo kordhay Dahab oo dadku ma yaqaan si loo maareeyo waayo cidda leh lama yaqaan, taasina waxa ay keentay dadku isku dhacaan. Waa arrin afrika ka dhacda, marka dahab yimaado waa lagu yaacaa, taasina isku dhac bulsho ayay abuurtaa. Gobolku markii hore ayuu sii nuglaa, marka ''haa'' dhib badan buu ku hayaa gobolka waana mid kamid ah waxyaabaha ay tahay in awoodda la sii saaro oo la sii xoojiyo oo wax laga qabto''.\nSi looga badbaado colaado ka dhalata khayraadka ayaa qareenku wuxuu qabaa in dowladda looga baahan yahay maamulkeeda. ''Dowlada ayay tahay inay maamusho khayraadka. Dahabka dadkaa helay dabadeedna waa ku yaaceen iyada oo dowladu xeerar iyo nidaam aysan u samayn, kolkaa markiiba dhibaatuu keenay. Waxa ay u baahan tahay dowladu in gacan ku hayn fara badan ku samayso inay maamusho, nidaamiso oo qaabka leesanka u bixiso ka taxadarto. Marka khayraadka dabiiciga dhinacna waa ka barako iyo khayr, dhinacna waxaa u ka noqdaa dhibaato oo dalalka uu inkaarta ka noqday waxaa kamid ah Suudaan, Koonfurta Suudaan iyo Congo. Waxyaabaha lagu kala bartayna waa sida loo maareeyo waxay ku xiran tahay in uu wax ku taro ama inuu wax ku yeelo''.\nXigashada Sawirka, Facebook\nShirkaasi ayaa laga soo saaray Lix qodob oo ay isku raaceen ergadii iyo guddiyadii nabadda ka shaqaynaysay.\nWasiirka Gaadiidka iyo horumarinta jidadka Somaliland Cismaan Ibraahim Nuur, isla markaana ah guddoomiyaha guddiga qaban qaabada shirka nabadda Ceerigaabo ayaa warbaahinta la wadaagay qodobada oo ay kamid ah yihiin in nabadda iyo walaaltinimada lagu wada noolaado guud ahaan gobolka Sanaag iyo degmada Ceerigaabo, waxaa ay beeluhu isla qaateen in nabadda loogu baaqo lagana howlgalo sidii loo raadin lahaa cid kasta oo ka maqan gogosha nabadda ee madaxweynaha Somaliland dhigay, waxaa loogu baaqay xukuumada Somaliland inay ka fuliso mashaariic horumarineed gobolka sida ugu dakhsiiyaha badan.\nWaxaa kale oo kamid ahaa qodobada uu wasiirku sheegay in lagu heshiiyay in dowladda Somaliland ay masuul ka tahay ammaanka iyo nabadda gobolka Sanaag.\nSuldaan Siciid Suldaan Cabdisalaan oo ka qayb galay shika ayaa soo dhoweeyay qodobada shirka laga soo saaray ''Maanta oo ay tahay maalin taariikhi ah oo aan halkan isugu nimi nabadgalyada gobolka Sanaag, intii ka qayb qaadatay waan uga mahadcelinayaa waana soo dhoweynayaa waa maalin taariikhi ah, madaxweynahana gaar baan ugaga mahad naqayaa howshaas isagaa u ahaa garwadeen gogoshana bilaabay, raggii la qaban qaabiyay ee la qabtayna waan uga mahadcelinayaa, madaxweyne waxaan leeyahay inta hartayna dhammaystirkeeda adigeey kuu taalaa iyo dowladaada, marka anagana garab baan kugu siinaynaa diyaar baan u nahay, wixii dhimmana waan dhamaystiraynaa''.\nMadaxweynaha Somaliland ayaa dhankiisa baaq u diray beelaha dega Ceerigaabo inay ka shaqeeyaan nabadda ''Waxaan ku soo gunaanadayaa hadalkayga oo summadna uga dhigayaa in nabaddu ay kamid tahay shaqooyinka aanay dowladuhu kaligood fulin karin, nabaddu gunta ayay ka soo tolantaa, sidaa awgeed ma hirgasho haddii aanay qofka ama qoyska iyo bulshadu ka soo unkamin iyaguna aanay ilaalin. Heshiiskaa aynu gaadhnay, nabaddaa aynu unugnay waa in aynu dhaadhicinaa''.",
  "date": "2025-10-23",
  "scraped_at": "2025-10-29T17:45:30.297053+00:00",
  "category": "news",
  "text_hash": "489cfb1375d35bc12a8d60fb8f5c5c9baaf0499b2a415efa2379a83d6ab73fd9",
  "minhash_signature": "4483140,2395931,18865116,4861915,5554336,5495100,628816,1761769,4776594,6395875,7296105,522455,1646447,1528026,10112934,5335380,3496227,5044825,1011790,3943821,3594358,342355,1992289,6468896,1967557,2694284,1913150,6074903,64586,6624010,8986856,3767196,6612917,7616240,805629,2498419,3205678,5596375,3008520,3517212,9323,5329109,15032184,9882457,8140240,3926050,24137107,1059770,7260637,6110717,7797782,6653905,127150,7981935,11357660,5607614,5954198,197472,4356103,1530210,1315521,4939359,2412580,2584076,1073205,6274706,3028566,8464352,10110188,2488354,3151647,26786271,493051,1526376,852431,1048402,4376132,3825330,1558614,26717708,2575586,10206378,6793357,6330008,810597,7045385,178016,6925322,1284148,1091997,21896640,11311934,12321054,11387331,3464622,5122676,2019229,324164,12950483,5194045,8478591,986768,11456990,7806879,20652329,1852057,6960830,5834132,132718,3081854,2143798,2846863,4356009,1430020,8384176,5556682,131038,760321,4862167,9085615,2730198,6963914,2542765,1305797,5920302,933452,17140221,8804149"
}