{
  "url": "https://www.bbc.com/somali/articles/cx2pe6pj2m7o",
  "title": "Sidee loo go'aamiyaa abaalmarinta nabadda ee Nobel ee 2025 ee ay ku guuleystay María Coria?",
  "text": "Xigashada Sawirka, NobelPrize\nHoggaamiyaha mucaaradka Venezuela María Coria Machado ayaa la guddoonsiiyay abaalmarinta nabadda ee Nobel Peace Prize 2025.\nMachado, oo 58 jir ah, ayay guddiga Nobel-ka ku ammaaneen in ay tahay \"mid ka mid ah tusaalayaasha aan caadiga ahayn ee geesinimada rayidka ee Latin America waayadii u dambeeyay\". Waxay qaaday olole ka dhan ah madaxweynaha Venezuela Nicolás Maduro Moros, oo xukunkiisa 12 sano ay dad badani u arkaan mid aan sharci ahayn.\n\"Aqoonsigan baaxadda leh ee halganka dhammaan dadka reer Venezuela waa dhiirigelin aan ku soo gabagabeyno howsheenna: Waan inaan helbo xorriyad,\" Machado ayaa sidaas ku tiri hadal ay soo saaray.\nMagacaabista ama musharaxnimda ayaa xiranta 31 Janaayo. Xubnaha guddiga waxay samayn karaan magacaabistooda ugu dambayn kulankooda ugu horreeya ee Febraayo.\nWaxay ka wada hadlayaan dhammaan magacaabista, ka dibna waxay dejiyaan liis kooban. Qof kasta oo la magacaabo ayaa la qiimeynayaa oo waxa baaraya koox la-taliyayaal joogto ah iyo khubaro kale.\nEnd of Ugu akhris badan\nGuddigu waxay kulmaan bishiiba hal mar si ay uga hadlaan magacaabista. Go'aanka wuxuu u eg yahay in la gaaro bilaha Agoosto ama Sebtembar, ayuu yiri Harpviken.\nGuddidu waxay is-afgarad ka gaaraan xulitaankooda. Haddii aysan gaarin go'aan wadajir ah, go'aanka waxaa lagu gaarayaa cod aqlabiyad ah.\nMarkii ugu dambeysay ee xubin guddiga ka mid ah ay shaqada uga tagto iyadoo mucarada ah ama wax diiddan waxay ahayd 1994-kii, markaas oo hoggaamiyihii Falastiin Yaasir Carafaat uu abaalmarinta la wadaagay Shimon Peres iyo Yitzhak Rabin ee Israa'iil.\nIyadoo liiska buuxa ee magacaabista uu yahay mid sir ah, musharaxiinta waa u madax banaan yihiin inay shaaciyaan laakin ma jirto si loo xaqiijiyo waxa ay shaciyeen.\nMagacyada sanadkan la shaaciyay waxaa ka mid ah Maxkamada Caalamiga ah ee Dambiyada, NATO, Chow Hang-tung oo u ololeeya Hong Kong oo xiran iyo Qareenka Xuquuqda Aadanaha ee Canada Irwin Cotler.\nHogaamiyayaasha Cambodia, Israa'iil iyo Pakistan ayaa sheegay inay magacaabeen madaxweynaha Maraykanka Donald Trump. Magacaabistooda waxaa la sameeyay gu'gii iyo xagaaga taas oo ka dambeysa waqtiga kama danbeysta ah ee magacaabista ee 31-da Janaayo, markaa ansax ma noqoneyso in ay ka mid noqoto abaalmarinta 2025.\nWaxa uu helayaa Bilad, shahaado, 11 milyan oo lacagta Swedishka ah ee krone, taas oo u dhiganta ($1.19 milyan) iyo tixgelin degdeg ah oo caalami ah.\nWaxa lagu dhawaaqi doonaa maalinta Jimcaha ee 10ka Oktoobar saacadda markay tahay 12:00 wakhtiga Afrikada Bari, taas oo looga dhawaaqayo Machadka Nobel ee Norway ee Oslo, waxana ku dhawaaqi doona guddoomiyaha guddiga, Joergen Watne Frydnes.\nXafladan ayaa ka dhici doonta hoolka shirarka ee magaalada Oslo 10-ka bisha Disembar oo ku beegan sanad guuradii ka soo wareegatay geeridii Alfred Nobel.",
  "date": "2025-10-10",
  "scraped_at": "2025-10-29T17:36:29.829742+00:00",
  "category": "news",
  "text_hash": "ab67532695986f5b6f73b6ca5f658511bdfe42735ee0450d26315d9bd31c399a",
  "minhash_signature": "5255968,2422132,17169987,7764608,644731,2727001,10521856,10936109,691119,9261139,626158,3715658,462059,35774218,3202456,22685620,627446,643969,413138,16667368,2602393,497643,665829,49076927,20553037,4799004,4337543,15701827,16661448,54667935,4278628,1408377,15098745,9063744,4448554,887389,133818,5597215,11842896,3128279,8119580,60292092,4521215,27608192,7370281,5983340,22405233,40243066,7366857,47677331,4004658,2143045,14694399,8085109,1925925,17486514,1981519,246131,4970516,14187786,27514119,28818025,4551966,1459184,14152752,7937843,10042986,29888279,35175719,698561,11427050,10591560,14953688,16340759,13477062,2530171,3766665,9860139,163177,6316933,10489373,3554861,513467,12367617,28178364,12257769,7122533,3157921,16172131,3710058,15217812,20791465,6665592,12040260,3696990,10999062,518166,2440126,1492760,17504082,3014392,10161568,17706596,3782917,3430275,1586892,273177,3442801,19615900,7069877,66912180,18137370,850322,3069491,3954282,7327599,14302163,15139463,16240713,16200365,3922056,5392373,9278549,30840109,7716899,276343,9858714,6314036"
}