{
  "url": "https://www.bbc.com/somali/articles/cm2zyjl12ezo",
  "title": "Waa kuma wiilka Soomaaliga ee mar kale taariikhda ka dhigay kubadda cagta adduunka?",
  "text": "Xigashada Sawirka, Cumar Cartan\nGarsooraha Soomaaliga ah ee kubadda cagta Cumar Cabdiqaadir Cartan ayaa dhigay taariikh cusub oo aysan horay u samayn garsoorayaal badan oo Soomaaliyeed tan iyo xorriyadii Soomaaliya.\nCumar oo horrey usoo dhigay rikooro sare oo uu ka gaaray garsooranimada kubada cagta ee Qaarada Afrika ayaa hadda ka mid noqday garasoorayaal loo doortay tartanka koobka adduunka ee FIFA.\nWaxa uu ka mid yahay saddex garsoore dhexe oo laga soo doortay Afrika iyo wakiilka kaliya ee ka socda dalalka  Afrikada ee Saxaraha ka hooseeya si uu u dhexdhexaadiyo koobka adduunka ee ciyaartooyda da'adoodu ka yartahay labaatan sanno jir ee loo qayaan FIFA U-20 World Cup 2025.\nCiyaarahaas kubbadda cagta adduunka ayaa la qorsheeyay inay ka dhacaan dalka Chile inta u dhaxaysa dhammaadka bisha Sebtember ilaa bartamaha bisha Oktoobar.\nGarsoore Cumar Cabdiqaadir Cartan waxa uu ku biirayaa Jalal Jayed ee Morocco iyo Youcef Gamouh ee Algeria oo ah garsoorayaasha ugu waaweyn qaaradda.\nEnd of Ugu akhris badan\nCartan ayaa mar sii horreysay noqday garsoorihii ugu horreeyay ee Soomaaliya ka socda ee qabta ciyaartii wareega afarad dhamaadka ee koobka kooxaha qaarada Afrika isagoo dhexdhexaadiyey kooxaha Pyramids FC ee reer Masar oo ka badisay kooxda Mamelodi Sundowns  Koonfur Afrika ciyaar ka dhacday Qaahira. Sidoo kale waxa uu dhexdhexaadiye ka noqday tartanka qaramada Afrika ee AFCON.\nCaawiyeyaasha kale ee laga soo xulay Afrika waxaa ka mid ah Gilbert Cheruiyot oo ka socda dalka Kenya, Abelmiro Montenegro oo ka socda, São Tomé and Príncipe, Khalil Hassani oo ka socda Tunisia, Eric Ayimavo, ka socda Benin, Lahsen Azgaou, Morocco, iyo Mostafa Akarkad oo isna ka socda dalka Morocco.\nMaxamed Axmed Deysane oo ah ciyaaryahan horey usoo matalay xulka Soomaaliya sanadihii 1980-meeyadii sidaas oo kale ka mida kooxdii heerka kowaad ee Naadiga Batroolka isla markaana ah fallanqeeye ciyaaraha ayaa BBC-da u sheegay in Cumar uu sharaf u soo hoyiyey garsoorka kubada cagta ee Soomaliya\n\"Taas waxay dhiirigelin u tahay dhalinyada kale ee Somaaliyeed, Cumarna wuxuu taas u gaaray dadaal dheeri ah oo uu sameeyey taas oo magaca Soomaalida kor soo qaaday, xiiligaygii ma jirin garsoore Soomaaliyeed oo heerkan gaaray iyagoo haystay fursad dalku uu ahaa nabad ciyaaruhuna heleyeen taageero dowladdeed iyo mid shacbiba,\"ayuu yiri Deysane.\nXigashada Sawirka, Cumar Cartan\nCumar hadda waa garsoore heer caalami ah oo u diiwaan gashan xirirka kubada cagta ee Afrika ee CAF iyo xiriirka kubada cagta ee adduunka ee FIFA.\nWuxuu sheegay in nidaamyo ay leeyihiin dhamaan xiriirrada caalamigaa ee dunida ka jira kuwaas oo hoos taga xiriirka kubadda cagta aduunka ee FIFA, sidaas darteedna isagu uu ka mid yahay garsoorayaasha u diiwan gashan xiriirka kubada cagta qaarada Afrika ee CAF.\nWuxuu sidoo kale Cumar ka qayb galay tababarro xirfadaha garsooraha oo caalami ah oo in ka badan labaatan garsoore oo Qaaradda Afrika ka socda loogu qabtay dalka Masar.\nTartamadii ugu waaweyntaa ee Cumar Cabdiqaadir Cartan uu ka mid ahaa garsoorayaashi qabtay waxaa ka mid ahaa tartankii CAF Under20 iyo CAF under 23 ee Qaarada Afrika.\nCartan wuxuu kale oo uu garsoore ka ahaa ciyaartii finalka ee CAF under 23 oo sanadkan ka dhacday dalka Marooko una dhaxaysay dalka Masar iyo Marooko.\nSidoo kale Cumar wuxuu garsoore ka ahaa ciyaaraha Champion league ee Qaarada Afrika gaar ahan wuxuu si la yaab leh u dhexdhexaadiyey ciyaartii afar dhamaadka Koobkaas ee u dhaxay kooxaha Al-Ahli ee dalka Masar iyo Esperance ee dalka Tuniisiya.\nCiyaarihii is reebreebka koobka aduunka ee ka dhacay dalka Qadar ayuu garsoore Cumar dhexdhexaadiyey saddex ciyaarood oo ka tirsanaa kuwii loogu soo baxay koobkaas sanadkii 2021-kii oo ay ciyaareen dalalka Togo iyo Namibia, Tansania iyo Benin.\nXigashada Sawirka, Cumar Cartan\nDhanka kale Cumar ayaa sanadkii 2023-ka dhexdhexaadiyey ciyaar ka tirsan isreeb reebka koobka adduunka ee sanadka 2026-da lagu qabayo dalalka Maryakanka, Mexico iyo Canada taas oo ka dhacday dalka Koonfur Afrika una dhaxaysay Eswatini iyo Liibiya.\nXirirka kubada cagta ee Qaarada Afrika ayaa Cumar Cabdiqaadir Cartan u xushay liiska garsoorayaal qabanaya ciyaaraha Koobka Qaramada Qaarada Afrika oo ka socda dalka Ivory Coast\nKoobka kubadda cagta ee Qaaradda Afrika ayaa la qorsheynayey in sanadkii 2023 la qabto hase yeeshee dib u dhac ayaa ku yimid wuxuuna qabsoomay 13-bisha Janaayo isagoo socon doona ilaa 11 Febraayo sanadka 2024-ta.\nCumar wuxuu sheegay inuu bixiyey kaadhka cas ilaa labo jeer dhammaan tartamada caalamiga kubadda cagta ee uu ka qabtay Qaaradda Afrika.\nArrinta cajiibka ah ayaa ah in sidoo kale Cumar Cartan uu yahay garsooraha kaliya ee Soomaaliyeed ee u tababaran in uu isticmaalo VAR, wuxuuna ku qabtay habkan tartamo ka dhacay Afrika, isagoo haysta shahaadada aqooneed ee garsoorenimada VAR.\nCumar Cabdiqaadir Cartan wuxuu sanadkii 1995-tii uu ku dhashay xaafadda Buulo-xuubeey ee degmada Wadajir ee magaalada Muqdisho.\nHeerkiisa waxbarashada hoose, dhexe iyo sare ayuu ku qaatay isla Muqdisho isagoo heerka kowaad ee jaamacada ku qaatay daraasaadka horumarinta.\nWuxuu BBC-da u sheegay inuu heerka uu gaaray arsoorka kubadda cagta ee Qaarada Afrika ay ugu suurto gashay dadaal shakhsi ahaaneed oo muujiyey iyo kordhinta aqoontisa.\nWuxuu sidoo kale sheegay inuu rajaynayo inuu qaban doono kulamo waaweyn oo ka tirsan koobka aduunka.",
  "date": "2025-09-06",
  "scraped_at": "2025-10-29T17:26:29.423326+00:00",
  "category": "news",
  "text_hash": "8a4f2942c75a9b56993d6bb23019168cb2c689524fa0c2ef7d8de0bada880b0a",
  "minhash_signature": "415410,3041717,8492,9777712,299569,4186439,196904,36207120,1830183,151672,2296463,6009222,247773,4675264,3587242,11125630,49042,10774366,428193,14670453,4456838,334994,10491980,13089436,7298897,4057053,1903285,1316690,7506866,38322,3973279,1121430,21651858,2535775,2601874,19258483,7653585,3504470,1453,4158147,5389233,4213510,4270928,452570,8382167,1423885,633491,14761715,14714578,3411788,5655570,26723598,2293974,3301212,1146603,1371485,1251785,14801694,1622349,3330581,4069755,827764,6782017,7966806,3418224,828447,13526095,6823669,17919694,5729432,4689543,5978883,7930077,208040,972225,5210740,56899,1751761,4479167,6942601,2412868,8847795,29373660,17354404,4169222,4313272,7815715,1872297,8094193,9763528,17312741,1981739,233164,1266774,3293237,915564,12199929,2980224,1227304,9451146,3884846,374458,19729801,408791,4120098,1540224,8376910,813288,708045,22008673,4222514,6164848,75301,419989,278508,1721326,4129859,2333317,580268,9327280,620989,578145,3292105,1732486,14517997,7734560,1069102,6065427"
}