{
  "url": "https://www.bbc.com/somali/articles/cq8e311qdyzo",
  "title": "Sidee Ousmane Dembélé u muujiyey inuu istaahilo abaalmarinta Ballon d'Or",
  "text": "Xigashada Sawirka, Getty Images\nXiddiga kooxda Paris St-Germain ee Ousmane Dembele ayaa markii ugu horraysay ku guulaystay abaal marinta Ballon d'Or ka dib markii ay kooxdaas saddexda koob ee France ku guulaysatay ay sidoo kale cayaaryahanno dhowr ah oo ka mid ah ay heleen abaal marino dhawr ah xaflad ka dhacday magaalada Paris.\n28-sano jirkaan weerarka ka ciyaara ee reer France ayaa dhaliyay 35 gool, waxaana uu sameeyay 14 caawin 53 kulan oo uu u saftay PSG xilli ciyaareedkii hore isagoo kula guuleystay kooxda horyaalka Champions League, horyaalka faransiiska iyo Koobka French cup.\nWaxa uu ahaa gooldhaliyaha ugu sareeya horyaalka Ligue 1, isagoo dhaliyay 21 gool, waxaana loo magacaabay ciyaaryahanka ugu sarreeya horyaalka Faransiiska iyo Champions League.\nWaxa uu sidoo kale ka caawiyay PSG finalka koobka kooxaha adduunka oo ay guuldarro ka soo gaartay Chelsea, cayaar ka dhacday New Jersey.\nDembele, oo abaal-marintan uga guulaystay da'yarka Barcelona ee Lamine Yamal, ayaa ka qayb galay xafladda ka dhacday Paris, isagoo ilmeeyay markii uu masraxa taagnaa – inkastoo ay kooxdiisu ciyaareysay fiidnimadii Isniinta.\nEnd of Ugu akhris badan\nWeeraryahanka ayaa haatan dhaawac ku maqan, taasoo la micno ah inuu seegay guuldaradii 1-0 ee PSG ka soo gaartay Marseille kulan wax ka beddel lagu sameeyay duufaan dhacaysay darteed.\n\"Waxa aan hadda la kulmay waa wax aan caadi ahayn, wax eray ah uma hayo, waxa ku dhacay PSG\" ayuu yiri Dembele oo isagoo qiiroonaya ay hooyadiis kula soo biirtay masraxa.\n\"Waan yara walaacsanahay, ma fududa inaan ku guuleysto koobkaan, iyo in uu I gudoonsiiyo Ronaldinho oo ah halyeey kubada cagta ah, waa wax aan caadi aheyn.\n\"Waxaan rabaa inaan u mahadceliyo PSG oo ii timid 2023. Waa qoys cajiib ah, madaxweyne Nasser [Al-Khelaifi] wuxuu ii yahay aabe oo kale, waxaan sidoo kale rabaa inaan u mahadceliyo dhammaan shaqaalaha iyo tababaraha oo sidii aabbe oo kale ii ah - iyo dhammaan asxaabteyda kooxda.\n\"Waxaan si dhab ah ugu guulaysanay wax walba si wadajir ah, waxaad igu taageerteen wakhtiyadii fiicnaa iyo wakhtiyadii adkaa, koobkan shaqsiga ahi waa mid kooxda oo dhan u ah guul u soo hoyatay\".\nXigashada Sawirka, Getty Images\nDembele wuxuu ka mid noqday tiro cayaartoy Faransiis ah oo abaalmarintan hore ugu guulaysaty waxayna kala yihiin:\nRaymond Kopa – 1958\nMichel Platini – 1983, 1984, 1985\nJean-Pierre Papin – 1991\nZinedine Zidane – 1998\nKarim Benzema – 2022\nOusmane Dembele – 2025\n30ka cayaartoy ee ugu horreeyey tartanka abaalmarinta Ballon d'Or ayaa sidan u kala galay kaalimaha:\n30. Michael Olise\n29. Florian Wirtz\n28. Virgil van Dijk\n27. Declan Rice\n26. Erling Haaland\n25. Denzel Dumfries\n24. Fabian Ruiz\n23. Jude Bellingham\n22. Alexis Mac Allister\n21. Serhou Guirassy\n20. Lautaro Martinez\n19. Joao Neves, Paris Saint-Germain\n18. Scott McTominay, Napoli\n17. Robert Lewndowski, Barcelona\n16. Vinicius Jr, Real Madrid\n15. Viktor Gyokeres, Arsenal\n14. Desire Doue, Paris Saint-Germain\n13. Harry Kane, Bayern Munich\n12. Khvicha Kvaratskhelia, Paris Saint-Germain\n11. Pedri, Barcelona\n10. Nuno Mendes, Paris Saint-Germain\n9. Gianluigi Donnarumma,  Paris Saint-Germain\n8. Cole Palmer, Chelsea\n7. Kylian Mbappe, Real Madrid\n6. Achraf Hakimi, Paris Saint-Germain\n5. Raphinha, Barcelona\n4. Mohamed Salah, Liverpool\n3. Vitinha, Paris Saint-Germain\n2. Lamine Yamal, Barcelona\n1. Ousmane Dembele, Paris Saint-Germain\nMaamulaha PSG Luis Enrique – oo loo magacaabay tababaraha sanadka – ayaa u qalma in lagu amaano abaal marinta Dembele sababtoo ah taatiko uu bedelay bartamihii bishii Disembar.\nWaxa uu Dembele ka soo beddelay baalka midig isagoo keenay booska weerarka dhexe kulankii Lyon 15kii Diseembar, isagoo booskaas  ka dhaliyay kaliya shan gool. 30 gool ayuu u dhaliyay PSG taariikhdaas wixii ka dambeeyay.\nDembele ayaa ugu dambeyntii muujiyay tayo wanaagsan oo ku qancisay Barcelona inay bixiso 96.8 milyan ginni, taasoo laga yaabo inay kor ugu kacdo £135.5m, si ay ugala soo wareegto Borussia Dortmund 2017.\nSi kastaba ha ahaatee, PSG - oo loo magacaabay kooxda sannadka ee abaalmarinta Ballon d'Or 2025 - ayaa ahayd kooxdii cayaartoygaas heshiiska la gashay, iyagoo kula soo wareegay 43.5 milyan oo gini 2023.\nXigashada Sawirka, Getty Images\nDembele ayaa sidoo kale dhaliyay labo gool todobo kulan oo uu u saftay xulka Faransiiska xilli ciyaareedkii 2024-25.\nWaa ciyaaryahankii lixaad ee Faransiis ah ee ku guuleysta abaalmarinta iyo kii labaad ee qarniga 21aad ka dib guushii Karim Benzema ee 2022.\nLamine Yamal oo 18, ayaa ku dhameystay kaalinta labaad - wuxuuna sidoo kale ku guuleysatay abaalmarinta Kopa Trophy ee ciyaaryahankii ugu fiicnaa.\nShan ka mid ah 10-ka ciyaaryahan ee ugu sarreeya ayaa qeyb ka ahaa kooxda PSG xilli ciyaareedkii hore oo ay ku jiraan Vitinha (Saddexaad), Achraf Hakimi (Lixaad), Gianluigi Donnarumma (9) iyo Nuno Mendes (10aad).\nXiddiga Liverpool Mohamed Salah ayaa galay kaalinta 4-aad halka uu 8-aad galay xiddiga Chelsea iyo England ee Cole Palmer.\nKu guuleystihii sannadkii hore, khadka dhexe ee Manchester City iyo Spain, Rodri, ayaan markan soo gelin liiska musharraxiinta ka dib markii uu dhaawacmay.",
  "date": "2025-09-23",
  "scraped_at": "2025-10-29T17:19:29.063064+00:00",
  "category": "news",
  "text_hash": "9f9e62b518a8cc98f7efc035593d37a569acffc97867e8cb569dd27659e733d3",
  "minhash_signature": "786773,5309270,4088097,12974691,28839094,5673178,1442412,14060274,17643798,8728356,2436006,2718122,4324616,2799638,5015342,3439530,244852,14723,8326217,28303177,858909,8628754,1240066,4436629,8738433,10517608,7857235,25362080,4846913,7239742,11627372,5140507,3389300,80482,1103589,3959236,1968797,15562689,4811401,4429305,4035812,4139673,4470329,13035402,17392742,2309451,933265,7681210,2405333,3135855,17654290,2853243,5707416,271442,4345059,5493996,571024,7439006,274319,15160915,1972912,999105,14179625,2197575,4796474,208783,2467938,8161903,553330,8766025,16009737,11000648,14953688,15976363,3881345,2038450,1422262,1757173,511983,2609026,2297265,22087994,5535546,9871619,14333735,3024679,976229,8113737,3338034,3428736,6116518,3268456,2169682,3871143,10522374,13595930,14348535,12029936,1492760,356491,5263129,48574964,2458411,800394,1312472,2062015,10818069,6113787,7395801,12422714,3708468,5401405,5272110,530450,3146699,3186463,2155228,7958355,16209465,6902449,6341175,15310030,522826,1167934,1312809,8142710,7176875,10848015"
}