{
  "url": "https://www.bbc.com/somali/articles/cg5vlvl7gq4o",
  "title": "Wax badan ka ogow is aragii ugu horreeyey ee Lamine Yamal iyo Cristiano Ronaldo oo caawa ballansan",
  "text": "Xigashada Sawirka, Getty Images\nWaa laba jiil oo dahabi ah oo midna masraxa ka sii baxayo midna soo galay oo wacdarro ka dhigayo garoomada ciyaaraha kubada cagta ee Yurub.\nCristiano Ronaldo, halyey muddo dhowr iyo labaatan sano ciyaaraya kubadda cagta ahna shumac ka dhex ifaya ciyaaraha kubada cagta ee Yurub iyo caalamka iyo da'yarka mucjisada lagu tilmaamay ee soo koray masraxa kubadda cagta ee caalamka Lamine Yamal ayaa ku ballansan is aragoodii kowaad ee ay garoon isaga hor imaanayaan.\nLabada xiddig ee hiboolayasha ah ayaa caawa finaalka koobka horyaalka Qaramada Yurub ku ciyaaraha garoonka Allianz Arena ee magaalada Munich ee  dalka Jarmalka, waxaana ciyaarta xiisaha u yeellaya waa inay hanashada koobka ku tartamayaan Ronaldo iyo Lamine Yamal.\nRonaldo, waa finalkiisii afaraad ee uu la gaarayo dalkiisa Portugal 25-kii sanno ee u xirnaa funaada dalkiisa halka Lamine Yamal ay tahay kiisii labaad ee uu u ciyaarayo Qarankiisa Spain oo final Joogo.\nHaddi Ronaldo iyo dalkiisu Portugal ay hantaan koobkan waa kii labaad oo qaadayaan isagoo koodii kowaaad qaaday sanadkii 2019-kii, halka haddii Yamal kula guulaysto Spain uu noqonayo koobkiisii labaad ee Yurub ee dalkiisaa la qaadayo isago sanadkii 2024 la qaaday.\nEnd of Ugu akhris badan\nKulankani wuxuu noqonayaa markii ugu horreysay ee Yamal oo ka tirsan Barcelona – lana hadal hayo inuu ku guuleysan karo Ballon d'Or xilli ciyaareedkan – uu wajaho Ronaldo oo shan jeer ku guuleystay abaalmarintaas, kana tagaya kooxda Sacuudiga ee Al-Nassr xagaagan marka uu dhamaado heshiiskiisa.\nBBC Sport ayaa eegaysa waxa Ronaldo iyo Yamal ay toddobaadkan ka yiraahdeen midba midka kale – iyo sida ay isugu egyihiin ama u kala duwan yihiin.\nLabada ciyaaryahan ayaa la weydiiyay midba midka kale isku diyaarinta kulankaan.\nRonaldo oo hadda 40 sanno jir ayaa yiri, \" Cunnugan yar wuxuu run ahaantii wax wanagsan ka sameeyey kooxdiisa iyo qarankiisaba taaso si fiican u caawisay\"\n\"Waxay u tahay jawi wanaagsan oo isaga oo ku muujin  karo tayadiisa\" ayuu intaas raaciyey Ronaldo. Isagoo sii hadlayey CR7 waxaa uu yiri \" Ha soo barbaaro, ha saarin cadaadis, ha saarin cadaadis si aan ugu raaxaysan karno tayadan oo kale sanado badan.\"\n\"Waxaan jeclaan lahaa inaan ka qaado cadaadiska oo aan keligiis u daayo. Wuxuu leeyahay hibbo aad u badan.\"\nLamine Yamal oo farqi weyn oo xaga da'ada u dhaxeeyo Ronaldo, 13 bishaluuliyana jirsanaya 18 sanno ayaa ixtiraam u muujiyey Ronaldo.\n\"Waa halyeey kubadda cagta ah. Aniga, sida ciyaartoyda kale oo dhan, waxaan u hayaa ixtiraam weyn Cristiano.\n\"Kani waa nooca ciyaarta aan doonayo inaan ciyaaro, si aan u muujiyo aniga cidda aan ahay.\"\nKani waa kulankiisii ugu dambeeyay ka hor inta uusan gaarin 18 sano jir, waxaana uu horay ula soo qaaday koobka Qaramada Yurub Spain, iyo labo horyaal oo La Liga ah iyo Copa del Rey oo uu la qaaday Barcelona.\nWaxa uu u ciyaaray Barcelona 106 jeer, wakhtigaas waxa uu u dhaliyay 25 gool, caawiyena ka ahaa 18 kale, Spain waxa uu u saftay 20 kulan, lix gool iyo sagaal caawiye.\nWaxa uu shabaqa soo taabtay semi-finalka  ee koobkan uu caawa ciyaarayo finalkisia- isagoo dhaliyay labo gool kulankii Khamiista ay 5-4 kaga badiyeen France. Sidoo kale afar gool oo El Clasico ah ayuu ka dhaliyay Real Madrid.\nMarkii uu Ronaldo jirsaday 18-sano waxa uu 19 kulan u saftay kooxdiisii hore  Sporting, isagoo ku lugyeeshay  5 gool 3 kalena caawiye ka noqday, walina umuu ciyaarin Portugal ama koob weyn ku qaadin isagoo da'diisu tahay 17 ama ilaa 18 tobban toona.\nRonaldo ayaa koobkiisii ugu horreyey la qaaday kooxda Man-United sanadkii 2004-tii.\nXigashada Sawirka, Getty Images\nLabadoodaba waa u muhim hanashada koobkan,\nWariye Ciise Talyaano oo ka faallooda arrimaha ciyaaraha kuna sugan magaalada Muqdisho ayaa BBC-da u sheegay si uu u arko waxa Lamine iyo Ronaldo ugu dhigan tahay ku guulaysiga koobka horyaalka qaramada Yurub\nLamine Yamal:\n\"Lamine Yamal guushiisa koobkan waxay ka dhigantahay tallaabo uu horay uqaaday, yaraan ayuu ku qaaday dhammaan tartamada qaaradiisa, waxa u haraya oo kaliya inuu ku guulaysto koobka adduun. Sanadkan waxa uu soo qaaday Horyaalka Spain, Super Cupka iyo koobka Boqorka oo uu Barcelona la wada qaaday, waxana muddo ka dib uu kooxda geeyay afar dhammaadka Champion-ka. Ninkan yari waa gool dhaliyo, kubad sameeye iyo hogaamiye. Inuu koob ka hor qaado Ronaldo waa taariikh cusub oo udhigmaysa\" ayuu yiri Ciise.\nCristiano Ronaldo:\n\"Ronaldo isaga oo 40-jira inuu xulkiisa keenay finaalkan waa arin muujinaysa hogaamintiisa, waxa uu xulka udhaliyey gooshii ay uga soo baxeen Germalka, taas oo ku guulaysigiisa koobkanna ay usii noqonayso dhiiri-gelin uu ku hiigsado koobka adduunka 2026. Ronaldo waa gool-dhaliyaha guud ee Portugal waana ninka ugu badan ee kulama u ciyaaray, laba koob oo hore ayuu la qaaday, haddii kanna uu kula guulaysto waa diiwaan uu dalka udhigay\"\nsidoo kale khabiirka ciyaaraha Maxamed Axmed Deysane ayaa  isna qaba in uu muhiim u yahay labada hiboole.\n\"Wiilkan yar Lamine Yamal, mustaqbalka waa ciyaaryahanka baddeli doono meshii ay baneeyeen Ronaldo iyo Messi, marka caawa ayuu Lamine xaqiijin doono inuu halkaas la wareegayo\" ayuu yiri Deysane.\nWuxuu intaa raaciyeye Deysane in Ronaldo ay tani u tahay tusaale ciyaartoyda kale inuu ciyaarayo isagoo da'diisu weyn tahay isla markanaa uu gool dhalin badan sameeyey intuu joogay Horyaalka Sacuudiga ahna ninka labaad ee tartanka uu finalka Jooga ugu gool dhalinta badan isagoo 7-dagool.\nTaageerayasha dunida ee garoonka iyo shaashadaha caalamka ka daawan doonna kulan ayaa sidoo kale labadan xiddig ku kala eegi doona indhaha taageeranimo ee kooxaha Realmadrid iyo Barcelona.",
  "date": "2025-06-08",
  "scraped_at": "2025-10-29T17:41:30.460551+00:00",
  "category": "news",
  "text_hash": "2c87cf4f3704f4c1f97a7634a2e85b9103e8139d1616034bf1d0a7142bea9bd1",
  "minhash_signature": "10312984,3349546,12698971,4048518,1329978,1535314,6370557,5640197,9467103,4537049,5314718,5464294,1866989,2589896,3875150,6702738,212871,7432887,6223150,12038023,8203176,7885680,5435663,4436629,2214616,2110314,87310,666240,4374386,12156476,830857,586883,2472055,4605682,7325403,9406668,2061416,3598296,1557901,7664863,5058147,1596874,26384842,486732,2330185,2727285,14578038,10196996,1694783,2295751,2421205,66589,3178097,12059902,1860940,3181329,5033511,3919364,9998952,1055876,2853115,6409478,1624059,4372043,8128564,4715951,3331994,7652072,627061,11723815,17526318,7053007,4883733,3901518,2538270,2251527,7049361,20010080,2902270,926524,7777193,8830423,5687931,1596224,1331899,4206985,6467566,4495947,9254995,11335352,2367127,1662199,6838590,4475303,1602990,647336,430455,1417332,2606919,4607637,3955703,374458,520419,124617,1338918,4525402,2917,8274287,5795100,5361300,1150003,8999358,4513424,10728956,2111666,1806252,767287,1137466,4537616,374962,2618515,508728,1141787,390584,6213877,742229,10330785,7573068"
}