{
  "url": "https://www.bbc.com/somali/articles/c14per1763no?at_medium=RSS&at_campaign=rss",
  "title": "Maxay yihiin tallaabooyinka ay Somaliland xalka ugu raadinayso nidaamka E-Visa ee 'saameynta ku yeeshay'?",
  "text": "Xigashada Sawirka, Getty Images\nSomaliland ayaa sheegtay in ay weli ku hawlan tahay xal u raadinta cabasho muddooyinkii u dambeeyey ay muujinayeen qaar ka mid ah dadka reer Somaliland ee sita baasaaboorada ajaanibka ah ee ka soo noqonaya qurbaha, kuwaas oo nidaamka E-visaha ee Soomaaliya uu saameeyey.\nDiyaaradha ayaa shuruud uga dhigay u safraya Somaliland in ay haystaan dalku galka Soomaaliya, taas oo dadka qaar ay cabasho ka muujiyeen.\nWasiirka Wasaaradda Duulista Hawada iyo Horumarinta Madaaradda ee Somaliland Fu'aad Axmed Nuux oo shalay ay u yeedheen guddi hoosaadka arrimaha dibedda u qaabilsan Golaha Guurtrida ee Somaliland, si wax looga weydiiyo caqabad dhinaca socdaalka ee soo wajahay dadka reer Somaliland ee dibeddaha ka soo noqonaya, ayaa sheegay in Xukuumaddu wado dedaallo iyo qorsheyaal xal loogu raadinayo caqabadaha dhinaca Somaliland ah ee taagan.\nFu'aad Axmed Nuux, oo weriyeyaasha la hadlay kulankaas ka dib, ayaa sheegay in ay dhibaatada ka taagan socdaalka ay tahay mid culeys ku haysa maamulka hawada.\n\"Nasiib darro wada hadalladii Somaliland la furtay Soomaaliya ayaa keenay in hawadii ay Qaramada Midoobay maamulaysay in lagu soo celiyo gacanta Soomaalida\", ayuu yiri wasiir Fu'aad.\nEnd of Ugu akhris badan\nSomaliland ayaa u muuqata in aysan ku qanacsanayn in dadka u safraya dhulkooda la waydiiyo dalku galka E-visa.\nWasiirka Duulista hawadu waxa uu sheegay in ay qaadeen taalaabooyin ay xal ugu raadinayaan cabashada ka timid dadka safraya qaarkood.\n\"Waxaanu warqado aanu mowqifkayga ku cadaynayno u dirnay Qaramada Midoobay, ICAO, Mareykanka, Taiwan, Itoobiya, midowga Yurub iyo Midowga Afrika. Waxa kale oo noo socda arrimo sharci oo aan ku doonayno in aan kaga baxno wada hadallada hore ee Soomaaliya lala furay,\" ayuu yiri wasiirku.\nWaxa uu ilduuf ku tilmaamay heshiiskii lagu soo wareejiyay hawada Soomaaliya.\n\"Dadka reer Somaliland waxaan u sheegaynaa marka arrimaha noocan oo kale ahi socdaan, waa arrimo farsamo oo u baahan shuruuc iyo nidaam sharci oo la maro, taxadirkoodana u baahan,\" ayuu u sheegay warbaahinta.\nXigashada Sawirka, Somaliland\nDhinaca kale war-saxaafaddeed Wasaaradda Duulista Hawada ay soo saartay toddobaadkii hore ayey ku sheegtay in ay diyaaraddaha yimaada Somaliland waayi doonaan ogolaansha Isticmaalka madaaradda Somaliland ay hadii ay u hugaansami waayaan awaamiirtooda.\n\"Wasaaraddu iyada oo gudanaysa waajibaadkeeda dastuuriga ah ayay qaaday dhammaan tallaabooyinkii loo baahnaa, isla markaaan diyaaradaha ka hawl-gala madaaradda Somaliland iyo kuwa isticmaala xuduud-haweedka Somaliland ay si dhammaystiran u raaci doonaan shuruucda duulimaadyada iyo Socdaalka ee Somalialnd, ciddii u hoggaansami waydaana ay luminayso oggolaanshaha isticmaalka madaaradda iyo hawada sare ee Somaliland\", ayaa lagu yir warsaxaafadeedka.\nWaxaa xusid mudan in Soomaaliya iyo Somaliland uu dhexmaray muran ku salaysan maamulka hawada sanadkii 2024 ka. Murankaas ayaa ka dhashay kadib markii diyaaradda Itoobiya ay u hoggaansami waysay amar ka soo baxay dowladda Soomaaliya. Intaas ka dib ayaa waxaa xigay diyaarado laga celiyay hawada Soomaaliya.",
  "date": "2025-10-27",
  "scraped_at": "2025-10-29T17:32:29.383145+00:00",
  "category": "news",
  "text_hash": "04ca0871b45372ccaf17676e283e21d9b6ac9bb175bd43a930258ca89ac39da3",
  "minhash_signature": "1123128,3286680,412105,26482766,9109688,2556229,10816072,1282661,3649674,11872815,8417600,4652693,9243839,43154,23612472,5598541,7344957,10774366,22703454,9119295,13826897,995764,19909306,4436629,3925867,14136643,8762677,892653,7139210,14497063,12968637,19116303,3956762,1204182,10053046,8390597,27801110,4936731,22736837,3437655,17984503,14916674,13022857,16139116,23756536,3115655,10276694,61789544,6446765,17680590,10701523,15852564,17313419,1134566,1657095,292347,10304810,3382399,8604736,1053916,8978141,16703681,43472372,2880758,10961520,8957280,20305767,3790242,618034,1888443,5238017,566156,5588889,7089375,8641409,7342376,2994126,6927443,9925168,13624669,8427919,22187891,1577435,4383264,3536131,15711498,7106770,8111782,7374819,4347730,2388294,3140059,59115885,8430666,19865747,2669788,6750294,5557091,796085,2873784,3355743,8830523,8948419,5566865,14829853,3856038,9623125,4721378,12073916,18847403,2897716,9871797,3834582,17067371,15102848,2177534,2304923,10248407,13392788,2718892,2086776,2606507,28615373,16950705,22071464,2599779,3766242,5208372"
}