{
  "url": "https://www.bbc.com/somali/articles/c15k1283ln7o",
  "title": "Waa tuma \"Haweeneyda Birta ah\" ee lagu wado inay hoggaamiso Japan?",
  "text": "Xigashada Sawirka, Getty Images\nWaxay ahayd uun ka dib labo isku day oo guuldarraystay, Sabtidii, Sanae Takaichi ugu dambayntii waxay gaadhay hammigeedii dheeraa.\nHaweeneydan 64 jirka ah waxaa loo doortay hoggaamiyaha Xisbiga Dimuqraadiga Xorta ah ee haya talada Japan (LDP) xilli la xusayay 70-guurada aas-aaska xisbigaas – taasoo u furaysa waddada inay noqoto ra'iisul wasaarihii ugu horreeyay ee dumar ah ee dalka Japan.\nWaa wasiir hore oo dowladeed iyo baraamij sameeye telefishin, sidoo kalena mar bay ka ahayd durbaan-tumeyaal koox heesa muusigga culus .\nHadda waxay wajahayaan caqabadda ah inay hoggaamiso kaliya xisbi la tacaalaya sidii uu kalsoonida codbixiyeyaasha u soo ceshan lahaa kaddib fadeexado iyo khilaafyo midig-fog ah – balse sidoo kale waddan wajahaya heerka dhalashada carruurta oo aad u hooseeya iyo xiisado siyaasadeed oo sii kordhaya oo caalamka ah.\nSanae Takaichi waxay ku dhalatay gobolka Nara sanadkii 1961. Aabbaheed wuxuu ahaa shaqaale xafiis, halka hooyadeedna ay ahayd askari booliis. Siyaasaddu aad bay uga fogeyd nolosheedii ay kusoo kortay.\nEnd of Ugu akhris badan\nMar ay ahayd durbaanle aad u xiiseysa muusigga loo yaqaan \"heavy metal\", waxay caan ku ahayd inay sidato ulo fara badan, maaddaama ay uluhu jebi jireen inta lagu guda jiro tumidda durbaanka si xoog leh.\nSidoo kale, waxay ahayd quuse-badeed iyo  qof jecel baabuurta– gaarigeedii ay aadka u jeclayd ee Toyota Supra hadda waxaa lagu soo bandhigay matxafka Nara.\nKahor inta aysan gelin siyaasadda, Sanae Takaichi waxay si kooban uga shaqeysay soo jeediso barnaamij telefishin.\nHimiladeeda siyaasadeed ee Sanae Takaichi, waxay soo bilaabatay 1980-meeyadii, xilliga uu xumaaday xiriirka ganacsi ee u dhexeeyay Mareykanka iyo Japan. Iyadoo go'aan ku gaartay inay fahanto sida Mareykanku u arko Japan, waxay ka shaqeysay xafiiska haweeneydii dimuqraaddiga ahayd ee Patricia Schroeder, oo ahayd xildhibaanad si weyn uga hadasha dhaliilihii ay u jeedisay Japan.\nTakaichi waxay aragtay Maraykanka oo isku dhex geynaya luqadaha iyo cuntooyinka Japan, Shiinaha, iyo Kuuriyada, iyadoo arkaysay sida Jabbaan badanaa loola xiriiriyo Shiinaha iyo Kuuriyada Koonfureed.\n\"Haddii Japan aysan is difaaci karin, masiirkeedu mar walba wuxuu noqon doonaa mid ku tiirsan ra'yiga aan qotodheerayn ee Maraykanka,\" ayay ku soo gabagabeysay.\nXigashada Sawirka, Getty Images\nWaxay u tartantay doorashadii baarlamaanka ee ugu horreysay sanadkii 1992 iyada oo madax-bannaan ahayd, balse ma aysan guuleysan.\nDadaal badan oo ay samaysan, sanad ka dib ayey ku guuleysatay kursi, waxayna ku biirtay Xisbiga LDP sanadkii 1996. Tan iyo markaas, waxay ku guuleysatay inay noqoto xildhibaan 10 jeer, hal mar oo keliya ayaa laga adkaaday, waxayna dhistay sumcad ka mid ah codadka muxaafidka ah ee xisbiga.\nWaxay sidoo kale soo qabatay  xilal sare oo dowladeed, oo ay ku jiraan wasiirka badqabdka dhaqaalaha, wasiirka dowlad-goboleedka ee ganacsiga iyo warshadaha, iyo xilka wasiirka arrimaha gudaha iyo isgaarsiinta oo ay muddo rikoor ah soo qabatay.\nSanadkii 2021, Takaichi waxay markii ugu horreysay  tartan u gashay hoggaaminta  xibiga LDP, balse way ku guuldaraysata, waxaana ka guulaystay Fumio Kishida. Waxay mar kale isku dayday sanadkii 2024, markaas waxay hogaamisay wareegga koowaad ee codbixinta, balse ugu dambeyn way guuldaraystay  iyadoo Shigeru Ishiba uu kaga guuleystay.\nSanadkan oo ahaa isku deygeedii saddexaad, ayey xaqiijisay guusha, tan ayaa iyada dabcan ka dhigaysa inay noqoto haweeynadii ugu horreysay ee Ra'iisul Wasaare ka noqota dalka Japan marka uu barlamaanku meelmariyo magacaabideeda.\n\"Hadafkaygu waa inaan noqdo Haweeneyda Birta ah,\" ayay u sheegtay koox carruur ah oo iskuul ah intii ay ololaheeda dhowaa socday.\nTakaichi waa haweeney si adag uga soo horjeeda fikirka casriga ah, waxayna muddo dheer ka soo horjeedday sharciga u oggolaanaya dumarka guursaday inay magacooda hooyo sii haystaan, iyadoo ku adkaysanaysa in taasi dhaqanka dhaawacayso. Sidoo kale, waxay ka soo horjeeddaa guurka dadka isku jinsiga ah.\nSi kastaba dhawaan ayey muujisay dabac intii lagu guda jiray ololaheeda waxay ballanqaadday inay khidmadaha ilaaliyaha carruurta ka dhigi doonto qayb ahaan mid canshuurta laga dhimo, sidoo kalena soo jeedisay in shirkadaha bixiya adeegyada daryeelka carruurta ee gudaha loo sameeyo dhimista canshuurta.\nXigashada Sawirka, Bloomberg via Getty Images\nQoyskeeda iyo waaya-aragnimadeeda shaqsiyadeed waxay xoojinayaan hindiseheeda siyaasadeed: ballaarinta adeegyada isbitaallada ee caafimaadka haweenka, siinta shaqaalaha taageerada qoyska aqoonsi weyn, iyo hagaajinta doorashooyinka daryeelka bulshada gabowga ee Japan.\n\"Anigu si shaqsi ah waxaan mar saddex jeer nolosheyda soo noqday kalkaaliso iyo daryeel bixiso,\" ayay tiiri.\n\"Taasi waa sababta go'aankaygu uu uga sii adkaaday sidii loo yarayn lahaa tirada dadka qasbanaaday inay shaqadooda ka tagaan sababo la xiriira daryeelka, tarbiyadda carruurta, ama carruurta oo diida inay iskuulka aadaan.\"\n\"Waxaan rabaa inaan abuuro bulsho aysan dadku iska dhiibin xirfadahooda.\"\nXigashada Sawirka, Getty Images\nTan iyo markii la asaasay xisbiga LDP, sanadkii 1955-tii, wuxuu xukumayey siyaasadda Japan, laakiin hadda wuxuu dhumiyey taageeradiisa, iyadoo ay sabab u tahay niyad-jabka ka dhashay dhaqaalaha gaabiska ah, hoos u dhaca tirada dadka, iyo xanaaqa bulshada.\nTakaichi waxay ka tirsan tahay dhinaca midig ee LDP, doorashadeeda LDP waxay rajeynaysaa inay ku soo ceshato cod-bixiyayaasha xagjirka ah ee u jeestay xisbiga Sanseito ee midigta fog.\nXisbiga Sanseito, oo ku tartamaya hal-ku-dhegga \"Jabbaan Marka Hore,\" ayaa dhawaan ka soo kacday hal kursi ilaa 15 kursi, iyagoo ka jiiday cod-bixiyayaasha xagjirka ah. LDP waxay lumisay inta badan kuraasta labada aqal ee baarlamaanka.\nTakaichi lafteeda ayaa qirtay dhibaatada khudbad ay jeedisay ka dib markii ay ku guuleysatay wareegga koowaad ee codbixinta: \"Waxaan si gaar ah uga helnay dhaleeceyn adag taageerayaasheena asaaska ah, xagjiriinta, iyo xubnaha xisbiga.\"\n\"LDP waa inay isbedeshaa danta Jabbaan ee hadda iyo mustaqbalka. Mar walba waxaan horay u dhigeynaa danaha qaranka waxaanan maamuli doonnaa dalka iyadoo la ilaalinayo dheelitirnaan.\"\nBaarlamaanka ayaa la filayaa inuu xaqiijiyo magacaabiddeeda ra'iisul wasaare 15-ka bishan Oktoobar.",
  "date": "2025-10-05",
  "scraped_at": "2025-10-29T17:43:30.243887+00:00",
  "category": "news",
  "text_hash": "c6d9396e69a506409d38bf4bd5209f6dc6b4dd67f84251bba5df78439c232848",
  "minhash_signature": "4558404,6441728,9917805,4492304,3201435,2142890,3687666,5212205,2144830,20197360,3019282,653683,8539493,10658365,9358532,4501466,3722802,4337241,1020892,3984719,2358277,46833,3760464,4436629,10655018,34759679,7166615,3291175,9188559,538548,5750004,4678731,3023875,930784,6293391,7773643,1970066,16321816,3275588,140861,3774772,317314,495068,726122,1178689,5195918,521912,8876288,4081249,10662252,5502835,7292635,7818714,6620645,2272582,1033153,1597893,2525894,1429468,10352094,8466819,1789291,2098208,5122119,732862,8101001,10230522,1415890,760267,2225471,1996031,211554,307809,1858749,2084606,331581,14213397,14605134,5548273,9695325,960440,1833445,7035613,7158501,3351699,6101490,422700,93710,7286183,619186,14354115,5060466,2448468,5155977,317736,2046670,5223962,1657350,1227304,20313,50577,3976487,12677196,263064,4893994,4873585,2536508,2248845,10619,3181617,3087797,3891502,12272773,6866276,820037,3226547,1308585,58715,6235640,6579376,1534275,14158216,33055363,431331,1928421,6390172,9304171,17010914"
}